{"title":"The lion king","uid":4961548,"size":1326303392,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:00faf6ca2cf26ababba0d0d2a9e381b7a3935ec7&amp;dn=The+lion+king&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yo_nu_tz_18","files":4,"time":1245336667,"description":"The Lion King is a 1994 American animated feature produced by Walt Disney Feature Animation. Released to theaters on June 15, 1994 by Walt Disney Pictures, it is the 32nd film in the Walt Disney Animated Classics series. The story, which was strongly influenced by the William Shakespeare play Hamlet, takes place in a kingdom of anthropomorphic animals in Africa.[3] The film was the highest grossing animated film of all time until the release of Finding Nemo (a Disney/Pixar computer-animated film). The Lion King still holds the record as the highest grossing traditionally animated film in history[4] and belongs to an era known as the Disney Renaissance.[5]\n\nThe Lion King is the highest grossing 2D animated film of all time in the United States,[6] and received positive reviews from critics, who praised the film for its music and story. During its release in 1994, the film grossed more than $783 million worldwide, becoming the most successful film released that year, and it is currently the twenty-fourth highest-grossing feature film.\n\nA musical film, The Lion King garnered two Academy Awards for its achievement in music and the Golden Globe Award for Best Motion Picture - Musical or Comedy. Songs were written by composer Elton John and lyricist Tim Rice, with an original score by Hans Zimmer.[7] Disney later produced two related movies: a sequel, The Lion King II: Simba's Pride; and a part prequel-part parallel, The Lion King 1Ã‚Â½.","torrent":{"xt":"urn:btih:00faf6ca2cf26ababba0d0d2a9e381b7a3935ec7","amp;dn":"The+lion+king","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00faf6ca2cf26ababba0d0d2a9e381b7a3935ec7","infoHashBuffer":{"type":"Buffer","data":[0,250,246,202,44,242,106,186,187,160,208,210,169,227,129,183,163,147,94,199]},"announce":[],"urlList":[]}}