{"title":"Dr Zakir Naik - Religious Fundamentalism and Freedom of Expressi","uid":6156043,"size":1109133121,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:023339e9abae8e59380ecaa4b043098e8aeb5318&amp;dn=Dr+Zakir+Naik+-+Religious+Fundamentalism+and+Freedom+of+Expressi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"o2a1","files":2,"time":1297039520,"description":"High quality Debate Religious Fundamentalism a stumbling block for the Freedom of Expression - Dr Zakir Naik, as shown on Peace TV. 1994\n\nDR. ZAKIR NAIK - PRESIDENT, IRF\n\nA medical doctor by professional training, Dr. Zakir Naik is renowed as a dynamic international orator on Islam and Comparative Religion. Dr. Zakir Naik clarifies Islamic viewpoints and clears misconceptions about Islam, using the Qur'an, authentic Hadith and other religious Scriptures as a basis, in conjunction with reason, logic and scientific facts.\n\nDr. Zakir is popular for his critical analysis and convincing answers to challenging questions posed by audiences after his public talks. In the last 12 years (by the year 2008), Dr. Zakir Naik has delivered mo re than 1200 public talks in the U.S.A., Canada, U.K., Saudi Arabia, U.A.E., Kuwait, Qatar, Bahrain, Oman, South Africa, Italy, Mauritius, Australia, Malaysia, Singapore, Hongkong, Thailand, Guyana (South America), Trinidad and many other countries, in addition to numerous public talks in India.\n\nHe has successfully participated in several symposia and dialogues with prominent personalities of other faiths. His public dialogue with Dr. William Campbell (of USA), on the topic, The Quran and the Bible in the light of Science held in city of Chicago, U.S.A., on April 1, 2000 was a resounding success.\n\nHis Interfaith Dialogue with prominent Hindu Guru Sri Sri Ravi Shankar on the topic The Concept of God in Hinduism and Islam in the light of Sacred Scriptures held at Palace Grounds, Bangalore, on 21st Jan. 2006, was highly appreciated by people of both the faiths.\n\nIn the issue dated 22nd Feb. 2009 of the Indian Express list of the 100 Most Powerful Indians in 2009 amongst the billion plus population of India, Dr. Zakir Naik was ranked No. 82. In the special list of the Top 10 Spiritual Gurus of India Dr. Zakir Naik was ranked No. 3, after Baba Ramdev and Sri Sri Ravi Shankar, being the only Muslim in the list.\n\nSheikh Ahmed Deedat, the world famous orator on Islam and Comparative Religion, who had called Dr. Zakir, &quot;Deedat plus&quot; in 1994, presented a plaque in May 2000 awarded to Dr. Zakir Abdul-Karim Naik for his achievement in the field of Dawah and the study of Comparative Religion with the engraving &quot;Son what you have done in 4 years had taken me 40 years to accomplish, Alhamdullilah.\n\nPEACE TV - THE SOLUTION FOR HUMANITY\n\nPeace TV is a 24 Hour Islamic spiritual edutainment international satellite TV channel telecasting &quot;Free to Air&quot; state-of-the-art TV programmes in English and Urdu.\n\nThe TV programmes feature internationally famous English speaking scholars and orators like Dr. Zakir Naik, Shaikh Ahmed Deedat, Yusuf Estes, Yassir Fazaga, Yasir Qadhi, Dr. Jafar Idris, Shaikh Salem Al Amry, Hussain Ye, Siraj Wahhaj, Jamal Badawi, Ather Khan, Dr. Abu Ameenah Bilal Philips, Mokhtar Magraoui, Yusuf Islam, Abdullah Hakim Quick, Brother Abdur Raheem Green and many others.\n\nAs well as Urdu speaking scholars and orators like Dr. Israr Ahmed, Maulana Abdul Kareem Parekh, Dr. Abdul Aziz, Shaikh Sanaullah Madani, Maulana Ashfaque Salafi, Shaikh Faizur Rehman Nadwi, Maulana Ejaz Aslam, Shaikh Shamim Fauzi, Maulana Salman Nadwi, Dr. Shuaib Sayyed and many others.\n\nFor more information please visit our official websites http://www.peacetv.org or http://www.peacetv.tv or http://www.peacetvurdu.org\n\nBrought to you by The Shahadah Project - http://www.shahadahproject.com","torrent":{"xt":"urn:btih:023339e9abae8e59380ecaa4b043098e8aeb5318","amp;dn":"Dr+Zakir+Naik+-+Religious+Fundamentalism+and+Freedom+of+Expressi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"023339e9abae8e59380ecaa4b043098e8aeb5318","infoHashBuffer":{"type":"Buffer","data":[2,51,57,233,171,174,142,89,56,14,202,164,176,67,9,142,138,235,83,24]},"announce":[],"urlList":[]}}