{"title":"Phil Accardi's Chalice - 1988 - Take Control - 80s Geophagus se","uid":4580106,"size":55377507,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:048a58003d01cf1370e72773ad01a58cb8ce888a&amp;dn=Phil+Accardi%5C%27s+Chalice+-+1988+-+Take+Control+-+80s+Geophagus+se&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"apisto","files":12,"time":1229388090,"description":"192\n\nrare Self-released on casete only (there's a &quot;radio station only vinyl promo&quot; even more rare)\n\ncassette rip\n\nPhil Accardi and Chalice\nBabylon, New York\nDiscography\n*Take Control. Almighty Rock Music. 1988. CS.\nTake Control\nPhil Accardi: lead vocals, drums, Hammomd B3, Grand piano, percussion, backing vocals, strings, emulator, synthesizers, string and horn synthesizers, rhythm and acoustic guitars, gong, bass; various effect and pad synthesizers on &quot;Bright as the Stars&quot;; lead guitar on &quot;Take Control.&quot; Mike Muller: lead guitar, bass, synthesizers, acoustic piano glissandos, backing vocals. Bill Poulos: bass, backing vocals. Desi Desiderio: Hammond B3 on &quot;On My Way&quot; and &quot;Victim of the Night.&quot; Guy Lodico: synthesizers, keyboard embellishments; string arrangements on &quot;More Than Anything.&quot; Nicki Leigh: backing vocals. Bruce Bowes: bass. Ken Wallace: sequencher on &quot;Take Control.&quot;\nSide 1: Eyes of Burning Fire (Phil Accardi). On My Way (Foster / Jones / D. Anca / Accardi). More Than Anything (Accardi). High on Love (Accardi). Side 2: Take Control (Accardi). Running Around (Accardi). Victim of the Night (Accardi). Bright as the Stars (Accardi). Additional lyrics by Bill Lamont, George and Nicki Leigh.\nProduced by Phil Accardi and Carl Canedy. Pre-production at D.P.I. Studios, Islip, New York. Engineered by Mark &quot;Wally&quot; De Pierro. &quot;Bright as the Stars&quot; recorded in 1983 at Sonic Sound Studios, Freeport, New York. Engineered and co-produced by Dr. Jerry Comito. &quot;Running Around&quot; recorded in 1985 at Al Falcon's Studio 3973, Long Beach, New York. Engineered by Artie Ware III. All other tracks recorded 1986 / 1987 at Ian London Studios, New York. Engineered by Ken Wallace, Mike Hogan, Phil Accardi, Mike Muller, Vincent Ansini, Bruce Bowes, Bernie Lacurto and John Dunn. Mixed at U. C. A. Recording, Utica, New York. Engineered by Bob Yauger and Carl Canedy. Mastered by Tony Dawsey at Masterdisk. Photography by Neil Calandra, assisted by Michael Friedel for Sanctum Studios, New York. Logo and cover design by John Cappadona for Air Wear Graphics, West Hempstead, New York. Front cover costume by C. C. Star, Sonda, New York. Alisha: hair and makeup artist.\nCompilation\n*Underground Metal 2. Regency Records 790-082-2224. 1989. Song: Victim of the Night.","torrent":{"xt":"urn:btih:048a58003d01cf1370e72773ad01a58cb8ce888a","amp;dn":"Phil+Accardi%5C%27s+Chalice+-+1988+-+Take+Control+-+80s+Geophagus+se","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"048a58003d01cf1370e72773ad01a58cb8ce888a","infoHashBuffer":{"type":"Buffer","data":[4,138,88,0,61,1,207,19,112,231,39,115,173,1,165,140,184,206,136,138]},"announce":[],"urlList":[]}}