{"title":"Between 2 Worlds - A documentary of the Mayan Calendar","uid":5811722,"size":737109559,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06edf314687a6f371d10d08864e4ee9b5f2ba03d&amp;dn=Between+2+Worlds+-+A+documentary+of+the+Mayan+Calendar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"geogaddi000","files":-1,"time":1283666467,"description":"AVI Information\n   Filename: Between 2 Worlds.avi\n   Filesize: 737104222 Bytes (702.96 MB)\n   Streams (i.e. Video, Audio): 2\nVideo Stream\n   Compression: XVID - XVID MPEG-4\n   Avg. Bitrate: 1522.94 kbit/s\n   Resolution: 720x364\n   Color Depth: 24 bits\n   Running Time: 3546.78 s (59m 6s)\n   Framerate: 29.9700 fps\n   Microseconds Per Frame: 33366 ms\n   Frames: 106297\n   Keyframes: 414 (Every 256)\nAudio Stream\n   Wave Type: 85 - MPEG Layer 3\n   Avg. Bitrate: 128.00 kbit/s\n   Sample Rate: 48000 Hz\n   Bit Depth: 0 Bits\n   Channels: 2\n   Audio Delay: 0.00 s\n\n\n\n &lt;a href=&quot;\nhttp://www.inbetween2worlds.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.inbetween2worlds.com/&lt;/a&gt;\n\n\n&quot;BETWEEN 2 WORLDS&quot; is a film about revealing the purpose of the Gregorian calendar and the European notion concerning &quot;Manifest Destiny.&quot;  It is about all the unexamined assumptions and criteria upon which the world has based the daily life of mankind.  It is by far the greatest and most profoundly unquestioned instrument of control ever perpetrated upon the people of Earth.\n\nThe use of this calendar is an artificial way of counting time; four months of 30 days, seven of 31 days, and one of 28 days.  On the Gregorian calendar the accrued quarter day is handled by inserting February 29th every four years.  There is no logical or scientific relation between the exact length of the year used by the Gregorian calendar to measure and divide a year.\n\nAlthough the calendars for the Mayan, Hindu, Judaic, Islamic and Chinese people remain today; the Gregorian calendar measures daily affairs.\n\nThe Gregorian calendar was codified after the &quot;Doctrine of Discovery,&quot; and assumes that the power of the Christian Church around the planet had the power to take any land owned by non-Christian peoples.  This doctrine led right into the codificiation of the calendar, allowing for a method to control people for economic and political measurement of time.  The historical context in which this calendar became a fixed standard could be the greatest manipulation of our time.\n\nBetween Two Worlds, thus is a statement that the Gregorian calendar can only lead humanity to the place where we find ourselves today; a world of illusion, which is the old world, where disaster, ignorance, and error perpetuate themselves in grinding mindlessness.  It is a statement that the world must understand that as long as people follow the Gregorian calendar, chaos, war and suffering will continue.\n\nBy comparison, this is not how the Maya intended the calendar, to be used.  Therefore, &quot;Between 2 Worlds&quot; helps to understand our calendar as we evolve and become the people that were intended to grow in time to realize our origin and spiritual path toward humanness, not to regulate commerce in accord with religion.\n\nThis film clearly will enlighten mankind about the history we were intended to follow.  Today, we all follow the calendar as if this were the only way to deal with time.\n\nIn the early 20th Century, B.F. Skinner wrote about the effect upon mankind due to pure technological change.  He said it would drive people to insanity.  Has anyone else every considered the effects of living by the Gregorian calendar?  Was it intended that this erroneous method of looking at time would have the effect it is having today.  What if we lived under a different standard of time; especially one that would indentify the elements of our evolution as the Mayan Calendar does?\n\nAll concepts of commerce and religious worship are based on this error.  The slavery of mankind is based upon this error of measuring time.  As long as we are living in the old materialistic world, we will never understand what we were intended to understand and integrate into our lives, because we are doomed to a materialistic world and biosphere of self-destruction.\n\nMankind has always stood between two worlds because we have been purposely enslaved as tax producing units.\n\nReintroducing the Mayan calendar thus is an emergency plan for the people of planet Earth.  It is a road map to salvation using the information that has been missing.  This is what the Mayans were trying to tell us in their prophecies.  For the Mayan, all the order in the Universe, from its most minute to its whole system itself is governed by a universal constant and this universal constant is a single timing frequency of the new world that keeps everything in order, balance and synchronized in harmony with the Universe.\n\nThe new world brings us now the 13:20 timing frequency that was codified as the sacred calendar of the Maya.  It is called Tzolkin or Cholq'ij.\n\nNow that we understand the nature of the problem ordered upon us by the old world, we can deduct those consequences of the 12:60 artificial frequency created by the Roman Catholic Church.  Our path out of this situation is to reject the inaccurate, non-scientific and non-universal method of the Gregorian calendar.  We have a solution and that is to return to the correct biological calendar, which describes the evolution of mankind toward consciousness; that is the Mayan calendar.\n\n &lt;a href=&quot;\nhttp://www.maya-portal.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.maya-portal.net/&lt;/a&gt;","torrent":{"xt":"urn:btih:06edf314687a6f371d10d08864e4ee9b5f2ba03d","amp;dn":"Between+2+Worlds+-+A+documentary+of+the+Mayan+Calendar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06edf314687a6f371d10d08864e4ee9b5f2ba03d","infoHashBuffer":{"type":"Buffer","data":[6,237,243,20,104,122,111,55,29,16,208,136,100,228,238,155,95,43,160,61]},"announce":[],"urlList":[]}}