{"title":"Grecia.El.esplendor.de.la.Grecia.Clasica.(civilizaciones perdida","uid":5779981,"size":233782174,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:087896459d1b62336a59f419fd136094ab9be2ec&amp;dn=Grecia.El.esplendor.de.la.Grecia.Clasica.%28civilizaciones+perdida&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1282383194,"description":"2. Grecia: El esplendor de la Grecia ClÃƒÂ¡sica\n500 aÃƒÂ±os antes del nacimiento de Cristo, las pequeÃƒÂ±as ciudades-estado de Grecia emergieron de la oscuridad del perÃƒÂ­odo Arcaico para iniciar una de las transformaciones culturales mÃƒÂ¡s espectaculares en la historia del mundo occidental. Entre quienes habitaban estos enclaves y regÃƒÂ­an sus destinos se encontraban fieros guerreros, grandes pensadores, agricultores, artesanos y comerciantes. Dos mil aÃƒÂ±os despuÃƒÂ©s, el mundo moderno contempla Atenas y se reconoce en su eterno legado cultural.\n\nVisitaremos la Atenas del ClÃƒÂ¡sico, polis en la que empieza a cobrar forma la democracia, para observar cÃƒÂ³mo con sus prohombres da comienzo la Edad de Oro de la Grecia Antigua. Aprenda cÃƒÂ³mo estas poderosas ciudades-estado se convirtieron en la cuna de las mÃƒÂ¡s importantes conquistas del conocimiento de la ÃƒÂ©poca. La FilosofÃƒÂ­a, el Arte y al Ciencia confluyen en el desarrollo de una incipiente civilizaciÃƒÂ³n cuya influencia marcarÃƒÂ¡ el desarrollo de la civilizaciÃƒÂ³n europea. Descubra el significado de los dioses en la sociedad clÃƒÂ¡sica griega, los secretos del templo de Apolo en Delfos a Dionisio, los misterios de los cultos de la ÃƒÂ©poca, el nacimiento del teatro y de la tragedia clÃƒÂ¡sica. Un mundo en el que la bÃƒÂºsqueda del conocimiento estaba combinada por la admiraciÃƒÂ³n a la gracia fÃƒÂ­sica y belleza, desde las bellas artes al desarrollo de los juegos olÃƒÂ­mpicos. Observe cÃƒÂ³mo, en menos de un siglo, desde la asombrosa ascensiÃƒÂ³n de Atenas, las tropas espartanas, las plagas mortales y un cambio radical en los paradigmas filosÃƒÂ³ficos de la ÃƒÂ©poca pusieron fin al breve pero glorioso cenit de la civilizaciÃƒÂ³n helÃƒÂ©nica.\n","torrent":{"xt":"urn:btih:087896459d1b62336a59f419fd136094ab9be2ec","amp;dn":"Grecia.El.esplendor.de.la.Grecia.Clasica.%28civilizaciones+perdida","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087896459d1b62336a59f419fd136094ab9be2ec","infoHashBuffer":{"type":"Buffer","data":[8,120,150,69,157,27,98,51,106,89,244,25,253,19,96,148,171,155,226,236]},"announce":[],"urlList":[]}}