{"title":"Smallville_S2_D1_(DVD5)_(Multisubs)_(2LIONS)-WaRlOrD","uid":4882956,"size":7947689046,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0ad0a4dfb4825f254a9ff03eab17eab0dcc9a115&amp;dn=Smallville_S2_D1_%28DVD5%29_%28Multisubs%29_%282LIONS%29-WaRlOrD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bitpirate","files":-1,"time":1241486354,"description":"WaRlOrD and 2Lions team presents: Smallville\n--------------------------------------------\n\nIn de serie is te zien hoe de tiener Clark langzaam zijn superkrachten krijgt. Ook introduceert de serie al vele bekende bijpersonages uit de Superman-franchise zoals Lex Luthor en Lois Lane. Dit is in tegenstrijd met de meeste Supermanstrips, waarin Clark deze personages pas ontmoet nadat hij als volwassene naar Metropolis is verhuisd. Gedurende de eerste vier seizoenen focust de serie zich op Clarks middelbare schooltijd. Vanaf seizoen 5 heeft de serie een meer volwassen ondertoon en achtergrond. Ook hebben veel andere personages van DC Comics gastrollen in de serie. Het lijkt alsof er meer uit het Superboy universum komt dan uit het Superman universum; Dit zijn de twee hoofdvormen van Superman uit de comics. Met name de meerdere soorten kryptoniet zijn alleen aanwezig in het Superboy universum. Het Superman universum kent slechts een soort kryptoniet. Daardoor is Superman ongevoelig voor alle soorten kryptoniet behalve groen kryptoniet, dat op hem dezelfde uitwerking heeft als op Superboy. Ook is het zo dat Superboy sneller (vliegt) dan Superman, wat blijkt uit een comic van Superman uit de 80'er jaren, waarin de twee samen in een comic verschijnen. Superboy sterft in een gevecht met Time Trapper (1987), wat uiteindelijk het einde van zijn serie inhoud. Superman, daarentegen strijd nog steeds. Het verhaal in Smallvile is eigenlijk meer een amalgamatie van de beide universa.\n\nSeizoen 2 disk 1\n----------------\n\n1: Vortex\n2: Heat\n3: Duplicity\n4: Red\n\n                            -----------------------\n\n\nThe concept for Smallville was derived after a potential series chronicling a young Bruce Wayne's journey toward becoming Batman failed to get off the ground. After meeting with the president of Warner Bros. Television division, Gough and Millar pitched their &quot;no tights, no flights&quot; rule, which would break Superman down to the bare essentials and look at what events lead Clark Kent to become Superman. After seven seasons with the show, series developers Gough and Millar departed without providing a specific reason. Smallville is predominantly filmed in and around Vancouver, with some of the local businesses and buildings substituting for Smallville locations. The music is primarily composed by Mark Snow, who even utilizes some of John Williams's musical score from the original Superman film series; some of the episodes also contain their own soundtracks, with songs compiled from various musical bands. The opening theme is not performed by Snow, but is the single &quot;Save Me&quot; by Remy Zero.\n\nSeason 2 disk 1\n----------------\n\n1: Vortex\n2: Heat\n3: Duplicity\n4: Red\n\nDisk Dvd5-&gt;Dvd-rip-&gt;PAL\n\nLanguages: English\n           Francais\n           Italiano\n\nSubtitles: -English\n           -Francais\n           -Italiano\n           -Nederlands\n           -Magyar\n           -TÃƒÂ¼rkce\n\n\n******************************************\n\nBrought to you by\n\nWaRlOrD\nAND\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\nhttp://www.2lions.ons-forum.nl\n\n******************************************\nYou need this reseed? send me a pm @ piratebay forum","torrent":{"xt":"urn:btih:0ad0a4dfb4825f254a9ff03eab17eab0dcc9a115","amp;dn":"Smallville_S2_D1_%28DVD5%29_%28Multisubs%29_%282LIONS%29-WaRlOrD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ad0a4dfb4825f254a9ff03eab17eab0dcc9a115","infoHashBuffer":{"type":"Buffer","data":[10,208,164,223,180,130,95,37,74,159,240,62,171,23,234,176,220,201,161,21]},"announce":[],"urlList":[]}}