{"title":"Dr.Caligari.1989.DVDRip","uid":5608716,"size":735460925,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0bf081ce1f1c935a32d68f7885d844c93bfd17ae&amp;dn=Dr.Caligari.1989.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thelad53","files":51,"time":1275734265,"description":"Okay, Most people might not have heard of this one as it's never seen a DVD release and the VHS has been discontinued for the last 15 years or so...\nThis Rip is a 2 pass Gordian Knot encode from a DVDR copied from the limited release Japanese Laserdisc. Any fan of strange subversive cinema will surely fall in love with this little flick. It's written and Directed by Steven Sayadian, the same guy that made &quot;Cafe Flesh&quot; under the screen name &quot;Rinse Dream&quot;.\nAs far as I know, this was his one attempt at making a non-pornographic film. I have no Idead how to explain this film other than to say it involves cannibals, nymphomaniacs, brain transplants, cross dressing, a door that turns into a giant tongue, and lots of nudity. I'm curious to see if anyone else will love this as much as I do...\n\nHere's what the IMDB has to say:\n\nMrs. Van Houten has shown signs of losing touch with reality, and her husband discusses possible treatment with Dr. Caligari, who says Mrs. Van Houten has a disease of the libido. The staff want Dr. Caligari removed from their facility due to her controversial experiments with electroshock and hypothalamus injections. As Dr. Caligari continues experimenting with her patients, her daughter and son-in-law attempt to stop her.","torrent":{"xt":"urn:btih:0bf081ce1f1c935a32d68f7885d844c93bfd17ae","amp;dn":"Dr.Caligari.1989.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bf081ce1f1c935a32d68f7885d844c93bfd17ae","infoHashBuffer":{"type":"Buffer","data":[11,240,129,206,31,28,147,90,50,214,143,120,133,216,68,201,59,253,23,174]},"announce":[],"urlList":[]}}