{"title":"Coast.to.Coast.AM.June.29.2009-komie","uid":4982285,"size":55700108,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0d791db3c1736be87d3bb7705bedc5de539f0c7a&amp;dn=Coast.to.Coast.AM.June.29.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":5,"time":1246395655,"description":"Return of Planet X\n\n\n\nDate:\n06-29-09\n\nHost:\nGeorge Noory\n\nGuests:\nGilbert Eriksen, Kevin Miller\n\n\nAuthor and researcher Gilbert Eriksen outlined both science and biblical prophecy regarding the return of Planet X (Wormwood) which he believes will have dire consequences for the Earth. Rather than a planet, he suggested that Wormwood is actually a brown dwarf star, a huge iron oxide ball on an elliptical orbit in our solar system, which has 60 times the mass of Jupiter. It transits toward us on an 1,800 year cycle and is currently quite close, he claimed.\n\nEriksen maintained that NASA is aware of Wormwood's presence through their satellite data, but is covering it up. The object can currently be seen by infrared telescopes in the Southern Hemisphere, and is inside the orbital radius of Neptune (Right Ascension: 18 h), he said. Prophecy in the Book of Revelation, such as the &quot;moon became like blood&quot; and &quot;the sky was split apart like a scroll&quot; refer to events brought about by Wormwood's passage and could take place as early as this summer, he warned.\n\nAmong the cataclysms we'll see are meteorites hitting Earth, volcanic eruptions, earthquakes with huge tectonic shifts, and powerful tsunamis, he detailed. Unfortunately, the following summer (2010) will be even worse, as the methane atmosphere of Wormwood causes fire to rain down from the sky, and 1/3 of the Earth will be incinerated, Eriksen continued. For more on his &quot;Wormwood Science&quot; see this excerpt from his book.\n\nOveruse of Pharmaceuticals\n\nFirst hour guest, writer/producer Kevin Miller talked about the overprescribing of medications, and how this may have played a role in Michael Jackson's death. Most doctors prefer to treat patients with pharmaceuticals rather than looking for holistic solutions, he said.\nWebsite(s):\n# millenniumprophecy.com\n# kevinmiller.com","torrent":{"xt":"urn:btih:0d791db3c1736be87d3bb7705bedc5de539f0c7a","amp;dn":"Coast.to.Coast.AM.June.29.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d791db3c1736be87d3bb7705bedc5de539f0c7a","infoHashBuffer":{"type":"Buffer","data":[13,121,29,179,193,115,107,232,125,59,183,112,91,237,197,222,83,159,12,122]},"announce":[],"urlList":[]}}