{"title":"Azogue [ebook].","uid":5998346,"size":8741673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0dd370eee0d053aef12cb5e927469493e83dc75f&amp;dn=Azogue+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1291109119,"description":"Si Lawrence Pritchard Waterhouse, protagonista de CriptonomicÃƒÂ³n, estuvo con el genioAlan Turing y conociÃƒÂ³ a su opositor germano Rudy von Hacklheber, su antepasado Daniel Waterhouse no ha de ser menos.\n\nCon el curioso y sorprendente enlance que proporciona el misterioso Enoch Root, Neal Stephenson nos lleva ahora a la segunda mitad del siglo XVII, justo cuando John Wilkins acaba de crear la Royal Societyque se esfuerza por racionalizar y profundizar el nuevo empirismo, enfrentarse a la alquimia y, en definitiva, inventar la nueva ciencia moderna.\n\n\n\nComo su descendiente Lawrence, el Waterhoust de Azogue, Daniel, es a la vez amigo delNewton y del germano Leibniz. Sus aventuras en esa segunda mitad del siglo XVII van siguiendo el nacimiento de la ciencia moderna con la intervenciÃƒÂ³n estelar de figuras histÃƒÂ³ricas de indiscutible importancia como Newton, Leibniz, Hooke, Boyle, Huygens, Pepys, Penn, Wilkins y tantos otros.\n\nTras el indiscutible tour de force que representÃƒÂ³ CriptonomicÃƒÂ³n, Stephenson se atreve a novelar cÃƒÂ³mo pudo ser el nacimiento del mundo moderno, la creaciÃƒÂ³n de la ciencia y el paso de la alquimia al empirismo y el racionalismo. Y lo hace con la misma facilidad y amenidad que sorprendieron a todos en CriptonomicÃƒÂ³n, con es mezcla inseparable de historia, aventura, ciencia, hechos verdaderos e invenciones, y enfrentando la locura al racionalismo, la alquimia al empirismo y sin olvidar, por si alguien pudiera echarlos de menos, conceder un papel a los mismÃƒÂ­simos piratas.\n\nAzogue es el primer volumen de las tres trilogÃƒÂ­as que han de formar el llamado Ciclo Barroco. La diversiÃƒÂ³n y la reflexiÃƒÂ³n estÃƒÂ¡n servidas. Y no ha hecho mÃƒÂ¡s que empezar...","torrent":{"xt":"urn:btih:0dd370eee0d053aef12cb5e927469493e83dc75f","amp;dn":"Azogue+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dd370eee0d053aef12cb5e927469493e83dc75f","infoHashBuffer":{"type":"Buffer","data":[13,211,112,238,224,208,83,174,241,44,181,233,39,70,148,147,232,61,199,95]},"announce":[],"urlList":[]}}