{"title":"Thunderheart [1992/MP3/VBR V0]","uid":4559884,"size":77292378,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0e76e285b9d15f7bd057a1846cea4c2e6ac8fcb7&amp;dn=Thunderheart+%5B1992%2FMP3%2FVBR+V0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neocon80","files":-1,"time":1228640305,"description":"From filmtracks.com\n\n\nA fictional representation of events that occurred on a South Dakota reservation in the 1970&amp;#039;s, director Michael Apted and writer John Rusco provide one of the most authentic depictions of reservation life in Hollywood&amp;#039;s history. In real life, a militant group called &amp;#039;American Indian Movement&amp;#039; defied the FBI with violent results, although in Thunderheart, the story has been twisted to include a conspiracy to steal land from the Native Americans. A murder mystery erupts from these actions, and it gives Val Kilmer the chance for one of his best performances to date. His conservative, clean-cut FBI agent attitude is challenged by his quarter Indian heritage, with the film showing his slowly-developing mystical visions of ghost dancers as he is eventually forced to choose between the law and the Indians. A fine film in all regards, the project would mark the third and final collaboration between Apted and composer James Horner. A superior piece than both Gorky Park in 1983 and Class Action in 1991, Thunderheart would be a strictly small-scale score from Horner, who was in the process of slowly phasing out his electronics-only ensembles in favor of more orchestrally robust recordings. Not only would Thunderheart be among the last synthetic Horner scores, it would exhibit a maturity of heart and substance that was often absent from his mundane synthetic scores of the past. From The Name of the Rose to Vibes, Field of Dreams, and Class Action, Horner&amp;#039;s electronic scores have bordered between disappointing boredom and fatal schizophrenia. While the instrumentation is even more singular than usual in Thunderheart, Horner fine-tunes his approach with superb subtly that spices up an otherwise basic atmospheric effort. The aforementioned moments during which Kilmer&amp;#039;s FBI character witnesses ghost dancing in the distance of the beautiful prairies inspired Horner to use Indian chanting as a distinct instrumental element in the score.\n\nWith these sounds of Indian chants mixed up front and throughout Thunderheart, you hear an authenticity that is a crucial and intriguing aspect of the film. Another integral element of the score is the shakuhachi flute, ranging in contribution from strikingly harsh to rhythmically enchanting. This would be one the first times Horner experimented with using the flute as a pace-setting rhythm tool in the kind of way that listeners would eventually hear in Legends of the Fall and numerous other efforts. Along with a powerful mixing of electric drums, this rhythm would explode in the finale &quot;Run for the Stronghold&quot; cue, a highlight of the score. Other elements in Thunderheart worth mentioning are an extension of the piano solos heard in much of Horner&amp;#039;s work at the time, as well as a deep synthetic bass that occasionally drones with the same impact as in Vibes. All of this is mixed together with a slightly wetter than usual mixing quality, meaning that the score echoes more than other purely atmospheric Horner scores. With the flute often trailing off in extended single blasts, this echoing nature heightens the mysticism of the Indian culture during their many magical moments in the film. There is almost no thematic material even hinted at until the FBI character finally embraces his roots at the end of the film. After the monumental &quot;Stronghold&quot; cue, Horner establishes a slow, elegant synthesizer theme with outstanding flute accents on key visual moments in the film. The finale of the score is without much of the Indian chanting, which is an integral part of the entire package, but the finale two cues nevertheless are the appealing duo on the album, with an alternation between the throaty pip-like rhythms and respectful theme. If you enjoy Horner&amp;#039;s more minimalistic efforts, then Thunderheart could very well be the champion of the lot. Even for those Horner collectors who typically enjoy the larger orchestral works, Thunderheart has enough interesting development to bridge that gap between the bombast and a purely intellectual environment. It also stands as one of Horner&amp;#039;s most surprisingly effective and important scores in its respective film. \n\nReleased in 1992\nComposed by James Horner\nGenre: Film Score\n\nAUDiO.........[ MP3 44000Hz 227 kb/s ABR (2 ch STEREO)\nSiZE..........[ 73 MB\nSOURCE........[ Transcoded from FLAC\nDURATiON......[ 43mins 33secs\n\nBROUGHT TO YOU BY NEOCON80 OF THE KINYAA&amp;#039;AANII CLAN\t","torrent":{"xt":"urn:btih:0e76e285b9d15f7bd057a1846cea4c2e6ac8fcb7","amp;dn":"Thunderheart+%5B1992%2FMP3%2FVBR+V0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e76e285b9d15f7bd057a1846cea4c2e6ac8fcb7","infoHashBuffer":{"type":"Buffer","data":[14,118,226,133,185,209,95,123,208,87,161,132,108,234,76,46,106,200,252,183]},"announce":[],"urlList":[]}}