{"title":"Da Ali G Show Da First Seazon (NLsub)","uid":6213387,"size":4509468672,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:10f25647568145bedc5b4f17b20f99e8b87e0019&amp;dn=Da+Ali+G+Show+Da+First+Seazon+%28NLsub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dontjootje","files":33,"time":1299027255,"description":"Da Ali G Show\n \nGenre Komedie \nSpeelduur 30 min. \nHoofdrollen Sacha Baron Cohen \nRegie James Bobin\nScott Preston \nLand Groot-BrittanniÃƒÂ«\nUitzendingen \nStart 2000 \nAfleveringen 6 \n\nDa Ali G Show was een televisieprogramma, met in de hoofdrol Sacha Baron Cohen als Ali G, een zwarte rapper. Ali G is min of meer een parodie op de hiphopcultuur. Andere typetjes van Cohen uit de televisieserie zijn Borat en Bruno. Van alle 3 de personages zijn ook al films gemaakt. In het programma gaan de drie personages op stap om mensen te interviewen. Ze proberen hierbij vreemde reacties los te krijgen.\nEr zijn twee seizoenen van het programma verschenen, waarvan het eerste seizoen in Groot-BrittanniÃƒÂ« werd gemaakt, en de tweede in de Verenigde Staten. In Nederland werd het programma op Nederland 3 en later op The Box uitgezonden. Nu is het weer te zien op Comedy Central.\n\nHet eerste seizoen van Da Ali G Show werd geproduceerd door Channel 4 in Groot-BrittanniÃƒÂ«. Vervolgens werd het tweede seizoen geproduceerd door HBO in de Verenigde Staten. Het tweede seizoen werd uitgezonden onder twee namen; in landen waar het eerste seizoen was uitgezonden met de naam Ali G in da USAii, in andere landen, waaronder de Verenigde Staten, onder de originele naam Da Ali G Show.\n\nOp 23 juli 2005 maakte de Amerikaanse zender HBO bekend dat er geen plannen zijn om een derde seizoen te maken. Dit zou komen omdat Sacha Baron Cohen inmiddels zo bekend is waardoor hij zich nog moeilijk kan voordoen als een vreemde journalist.\n\n","torrent":{"xt":"urn:btih:10f25647568145bedc5b4f17b20f99e8b87e0019","amp;dn":"Da+Ali+G+Show+Da+First+Seazon+%28NLsub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10f25647568145bedc5b4f17b20f99e8b87e0019","infoHashBuffer":{"type":"Buffer","data":[16,242,86,71,86,129,69,190,220,91,79,23,178,15,153,232,184,126,0,25]},"announce":[],"urlList":[]}}