{"title":"Halloween 2007 MULTISUB","uid":4559370,"size":748698117,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:129da2beba29733084fe97e4b19422ffd1cb9480&amp;dn=Halloween+2007+MULTISUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Daniel_Miccan","files":7,"time":1228613143,"description":"29 ÃƒÂ¥r efter premiÃƒÂ¤ren lÃƒÂ¥ter splat-pack-regissÃƒÂ¶ren Rob Zombie ÃƒÂ¥ter Michael Myers knacka pÃƒÂ¥. I den hÃƒÂ¤r remaken lÃƒÂ¤r vi kÃƒÂ¤nna Michael frÃƒÂ¥n grunden, och fÃƒÂ¥r en obehaglig och skarp inblick i hans uppvÃƒÂ¤xt.\n\n16 ÃƒÂ¥r efter att Myers dÃƒÂ¶dat sin styvfar, sin storasyster och hennes kille flyr han till den sÃƒÂ¶mniga smÃƒÂ¥staden Haddonfield i jakt efter den enda mÃƒÂ¤nniska han nÃƒÂ¥gonsin brytt sig om. Rob Zombie utvecklar historien ytterligare och konstruerar en betydligt blodigare version ÃƒÂ¤n den John Carpenter gav oss 1978 - vilket tog honom till biotoppen i USA 2007.\n\n\nINFO!\n\nThe residents of Haddonfield don&amp;#039;t know it yet... but death is coming to their small sleepy town. Sixteen years ago, a ten year old boy called Michael Myers brutally kills his step father, his elder sister and her boyfriend. Sixteen years later, he escapes from the mental institution and makes his way back to his hometown intent on a murderous rampage pursued by Dr Sam Loomis who is Michael&amp;#039;s doctor and the only one who knows Michael&amp;#039;s true evil. Elsewhere a shy teenager by the name of Laurie Strode is babysitting on the night Michael comes home... is it pure coincidence that she and her friends are being stalked by him?  Written by TheSteph\n\nOn Halloween 1963, Haddenfield, 10-year-old Michael Myers, estranged and mentally unstable, is imprisoned in Smith&amp;#039;s Grove Sanitarium under the care of Dr. Sam Loomis for the murders of his mother&amp;#039;s boyfriend, his older sister, and her boyfriend. Now, 16 years later, he escapes and now in search of his baby sister Laurie and Dr. Loomis must warn the residents of Haddenfield and get to Laurie before Michael does. Written by Corey Semple (aka Hairsprayer07)\n\nYoung Michael Myers is committed to Smith&amp;#039;s Grove after the brutal murder of his mom and sister&amp;#039;s boyfriends, and his sister Judith. After being there for roughly 17 years, he returns to his home town of Haddonfield in search of one of the only people he has ever cared about, his baby sister Laurie Strode. As he is tracked down by Dr. Sam Loomis he will kill anybody who gets in his path.","torrent":{"xt":"urn:btih:129da2beba29733084fe97e4b19422ffd1cb9480","amp;dn":"Halloween+2007+MULTISUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"129da2beba29733084fe97e4b19422ffd1cb9480","infoHashBuffer":{"type":"Buffer","data":[18,157,162,190,186,41,115,48,132,254,151,228,177,148,34,255,209,203,148,128]},"announce":[],"urlList":[]}}