{"title":"Dragon Ball GT (English)","uid":4450312,"size":2108787683,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:161ff85b85f71c7e6b96f9f6c5512601eab48c2b&amp;dn=Dragon+Ball+GT+%28English%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"krazzy42","files":64,"time":1224231855,"description":"10 years have passed since Goku and Uub left their friends and families to train in order to hone their skills to perfection. But Goku soon finds himself helpless against the mystical power of the Dragon balls and an accidental wish made by the devious Emperor Pilaf. His desire; that Goku once again become a child! Not daunted by this small setback, Goku, together with the new president of Capsule Corporation, Trunks, and his own granddaughter, Pan, blast off into the outer reaches of space in search of the mysterious Blackstar Dragon balls. But these Dragon balls have a fatal secret: if not collected within 1 year the planet on which the last wish was made will be destroyed. The current target: Mother Earth herself! With the Dragon balls scattered across the entire galaxy, the heroes stumble upon new friends, ferocious enemies, and extraordinary beings never encountered before. Dragon ball GT follows Goku?s search for the Dragon balls with the hope that he can be wished back into adulthood and that Earth might be spared. \n\n\n\n\n\nAll The Episodes are in .rm format........can be played in real player\n\nLanguage spoken is English\n\nHalf of the episodes are Blue water dubbed and another half are Funimation Dubbed","torrent":{"xt":"urn:btih:161ff85b85f71c7e6b96f9f6c5512601eab48c2b","amp;dn":"Dragon+Ball+GT+%28English%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"161ff85b85f71c7e6b96f9f6c5512601eab48c2b","infoHashBuffer":{"type":"Buffer","data":[22,31,248,91,133,247,28,126,107,150,249,246,197,81,38,1,234,180,140,43]},"announce":[],"urlList":[]}}