{"title":"LANGOLIERS.DVDRip.Xvid","uid":4399626,"size":988358175,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1b5b4d1e3fd4cbc9a0947271785849fa54501a90&amp;dn=LANGOLIERS.DVDRip.Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Brianinmd","files":1,"time":1221614320,"description":"On a cross-country red-eye flight aboard American Pride Flight 29 from Los Angeles a Lockheed L-1011, From LAX, California to Boston, Massachusetts, some passengers awaken to find that the crew and most of their fellow passengers have disappeared, leaving behind items such as belt buckles, watches, headphones, pacemakers, and surgical pins. The only people left were sleeping when the disappearance took place. They are unable to contact anyone outside the plane, where there are no signs of life. When they land, they discover that everyone else in the world had disappeared.\n\nThe environment is odd in several ways. Day and night only last a few hours each; there is no electricity; sounds do not echo; food has no taste, and stored chemical energy contained in matches and batteries cannot be used. This is worrying since they cannot refuel the plane.\n\nCraig begins to descend into madness. He thinks that the strange situation is caused by the &quot;Langoliers&quot;, small creatures with fast legs that chase and eat the lazy.\n\nDinah hears sounds in the distance resembling radio static and informs the survivors that whatever makes the sounds is coming for them. Eventually all the passengers can hear this noise.\n\nBob theorizes that they have flown through a rip in the fabric of time.\n\nCraig goes mad and fights with several passengers; he wounds Dinah and kills Don.\n\nSeveral passengers take food, drinks, and matches from the snack bar back to the plane. The matches light and the food and drink regain their flavor. They reason that this is because although the plane had traveled into the past, it still contains the present inside.\n\nThe passengers decide to try taking off and retracing their path to get back home. They refuel with the currently useless fuel from the airport, hoping it will become usable inside the plane. This works.\n\nAs the plane is ready to take off, they glimpse the source of the sound. These are strange, round creatures with large spinning mouths filled with razor-sharp teeth (resembling chainsaws.) They travel with great speed and literally everything in their path is devoured leaving only a void.\n\nDinah convinces Craig that his meeting is actually being held on the tarmac, using him to decoy the creatures away from the plane. He is eaten.\n\nThe plane takes off and the world is devoured beneath them. They retrace their original course hoping to find the theoretical rift again; they find it. Dinah dies of her wounds.\n\nNick sacrifices himself to control the plane while lowering the air pressure to put the others to sleep so they can traverse the rift. Awakening on the other side, they find another deserted world. When they land they find it seems different to the previous world; sounds echo, food tastes fresh, and there is no langolier sound but a peaceful hum, gradually growing louder. The rift has taken them into the future. Soon the present catches up with them, people and activity materialises around them and they rejoin it.\n\n","torrent":{"xt":"urn:btih:1b5b4d1e3fd4cbc9a0947271785849fa54501a90","amp;dn":"LANGOLIERS.DVDRip.Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b5b4d1e3fd4cbc9a0947271785849fa54501a90","infoHashBuffer":{"type":"Buffer","data":[27,91,77,30,63,212,203,201,160,148,114,113,120,88,73,250,84,80,26,144]},"announce":[],"urlList":[]}}