{"title":"On The Blog - Series 01 to 03 - Audio Comedy - Mp3 - Slimoo","uid":5374989,"size":454898870,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1c5081110334ce063aa5ffb29147b05f0cbaeaa1&amp;dn=On+The+Blog+-+Series+01+to+03+-+Audio+Comedy+-+Mp3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":17,"time":1266544272,"description":"On The Blog - Series 01 to 03 - Audio Comedy - BBC R2 via DVB-T \n17 x 30 Minute Episode - 128Kbps - Mp3 - Slimoo\n\n\n\nRadio sitcom following the life of Andrew Glasgow, a sad geeky internet blogger who lives at home with his terrifying mother.\n\nOn The Blog is a Radio 2 sitcom about geeky internet blogger Andrew Glasgow, the assiduous keeper of an internet blog.\n\nPart confessional and part performance, blogging has been heralded as the biggest revolution in journalism since the invention of radio but, as Andrew demonstrates, it's really just a jamboree for the kind of people who write round-robins at Christmas and also a massive repository of staircase wit.\n\nAndrew blogs obsessively about his life and loves. In his case, this is a collection of military war-gaming enthusiasts, some tiny painted pewter soldiers, his terrifying Czech mother and the mysterious Mr Demjanjuk.\n\nwww.comedy.co.uk Review: \n[quote]When On The Blog first made its debut on Radio 2 we must confess we didn't bother listening to it - as the premise made it sound like another middle-of-the-road boring and ill-informed comedy programme attacking the internet. We were wrong - it's actually a rather good sitcom, albeit with a poorly chosen title.\n\nOn The Blog is essentially just a funny sitcom about a rather sad middle-aged man, still living at home with his mother, who spends most of his time typing out his petty and insignificant thoughts on the internet.\n\nThe character of Andrew Glasgow is a fantastic creation by the writers, and has been brought to life brilliantly by actor Andy Taylor, so we're really glad it's now back on the radio for a third series.[/quote]\n\n\n\n\nCast:\nAndy Taylor\nCaroline Quentin\nSimon Greenall\nDenica Fairman\nKris Dyer\nDave Marks\n\nWriters:\nKris Dyer, Dave Marks, Andy Taylor\n\n\nOn The Blog - S01 - E01 - You Can't Hurry Love \nOn The Blog - S01 - E02 - The First Casualty Of War \nOn The Blog - S01 - E03 - An Englishman's Home \nOn The Blog - S01 - E04 - Wolfie And Beatie \nOn The Blog - S01 - E05 - Into The Valley Of Debt \nOn The Blog - S01 - E06 - The Long March Home \n\nOn The Blog - S02 - E01 - Virgins And Philistines \nOn The Blog - S02 - E02 - Operation Chastise \nOn The Blog - S02 - E03 - Love And Grenades \nOn The Blog - S02 - E04 - A Darned Close Run Thing \nOn The Blog - S02 - E05 - Del Du Jour \nOn The Blog - S02 - E06 - It's A PC World ( &lt;&lt;&lt; Never Aired )\n\nOn The Blog - S03 - E01 - Leaving Home\nOn The Blog - S03 - E02 - Local Economy \nOn The Blog - S03 - E03 - Off-Piste \nOn The Blog - S03 - E04 - Missionary Work \nOn The Blog - S03 - E05 - Mysterious Stranger \nOn The Blog - S03 - E06 - Returning Home\n\n\nAudio Format    : MP3\nDuration Approx : 28mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n[","torrent":{"xt":"urn:btih:1c5081110334ce063aa5ffb29147b05f0cbaeaa1","amp;dn":"On+The+Blog+-+Series+01+to+03+-+Audio+Comedy+-+Mp3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c5081110334ce063aa5ffb29147b05f0cbaeaa1","infoHashBuffer":{"type":"Buffer","data":[28,80,129,17,3,52,206,6,58,165,255,178,145,71,176,95,12,186,234,161]},"announce":[],"urlList":[]}}