{"title":"Jarte 3.3","uid":4735500,"size":2945520,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1d6efb494c51b81bf78eb9d83e5987f720428247&amp;dn=Jarte+3.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1235257786,"description":"Copied from Jarte Homepage:\n\n\nDoes Your Word Processor Handle Like an Ocean Liner?\n\nWhen word processors replaced typewriters they helped free the creative expressions innate in all of us. But somewhere along the way word processors evolved into enormous machines designed primarily to serve the needs of the corporate world. Office word processors have become huge, cumbersome vessels of software that remind us of ocean liners. The seeming goal of both is to become as large as possible by including every imaginable feature, whether anyone actually needs all those features or not. That's fine for an ocean liner since you are there to relax and marvel at its grandness.\nHowever, it is not so fine when the size and complexity of your word processor makes it as cumbersome to operate as an ocean liner in a yacht race. \n\nIt does not have to be like that. Jarte is a WordPad based, FREE word processor whose unique interface will make you feel like you are piloting a swift, nimble yacht by comparison. Although Jarte doesn't look anything like the office word processor you are used to, it can handle your word processing tasks with aplomb. If this sounds like the kind of word processor you are looking for then maybe you owe it to yourself to give Jarte a try.\n\n\n\nGeneral Features\n\n\nFully compatible with Windows Vista\n\nTabbed interface to provide easy access to open documents\n\nOpens files with file extension RTF, file extension DOC, and file extension DOCX (new default format in Word 2007)\n\nFast start up\n\nCompact screen size\n\nHot Connect lets you use Jarte with other programs\n\nOptional &quot;Clickless Operation&quot; feature greatly reduces clicking\n\nCan be run directly from a pluggable USB flash drive\n\nHigh quality spell checker with custom user dictionary\n\nIncluded spelling dictionaries: English (American, British, &amp; Canadian), Spanish, French, German, Italian, and Dutch\n\nLink to, or import, your existing custom Word spelling dictionaries\n\nSupport for templates\n\nExport to HTML or PDF\n\nSingle click bookmarking and bookmark navigation\n\nSend documents via e-mail\n\nFull drag and drop file support\n\nInstant access to recently opened documents and folders\n\nInstant access to documents and folders designated as favorites\n\nAdjustable document zoom\n\nDetailed Help documentation\n\n\nEditing Functions\n\n\nInsert pictures, hyperlinks, tables, page breaks, equations and other embeddable objects\n\nQuick Clips option provides easy copy, cut and paste capability using the mouse scroll wheel button\n\nStandard clipboard functions plus a Paste Plain function which strips HTML and RTF formatting from clipboard text before pasting\n\nMulti-level undo and redo functions\n\nSorting\n\n\nFont Formatting\n\n\nBold, italic, underline, strikeout, subscript, and superscript font styles\n\nChoice of text colors\n\nText highlight tool with choice of colors\n\nFont typeface selection box which displays each font choice in its own typeface\n\nChoose your own default font\n\nQuick access to your personally chosen favorite fonts and to recently used fonts\n\nFormat brush tool quickly applies font styling to text\n\n\nParagraph Formatting\n\n\nLeft, right, centered, and justified text alignment\n\nParagraph indentation including first line and hanging indent styles\n\nBulleted and numbered list styles\n\nSingle, one and a half, and double line spacing\n\nOptional paragraph spacing before and after paragraphs\n\nUser settable tab stops\n\nFormat brush tool quickly applies formatting to paragraphs\n\n\nPrinting\n\n\nPrint preview\n\nUser definable page margins\n\nReverse page order option and odd or even pages only options (useful for double sided printing) in addition to the standard print options\n\n\nVisual designer allows complete control of both headers and footers:\n\nDefine any combination of left side, right side, and center headers and footers\n\nHeaders and footers may contain any combination of page numbering, file date, current date (in choice of date formats), file name, and user definable text\n\nUser control of the font typeface, font size, font style, and font color used for headers and footers\n\nUser control of the positioning of the header and footer lines\n\nOptional suppression of the header and/or footer on the first page\n\n\nTools\n\n\nClip List allows you display and reuse the 25 most recent clipboard clips\n\nScreen capture tool for copying images from the screen\n\nSpecial Characters Keyboard allows single click insertion of any character including the extended characters not shown on your keyboard\n\nReference Bar provides instant word lookup to online dictionary, thesaurus, and encyclopedia\n\nThe Reference Bar also automatically integrates with the WordWeb dictionary and thesaurus if it is installed\n\nDocument word count tool\n\nSearch for files on your computer with direct access to the system file search tool","torrent":{"xt":"urn:btih:1d6efb494c51b81bf78eb9d83e5987f720428247","amp;dn":"Jarte+3.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d6efb494c51b81bf78eb9d83e5987f720428247","infoHashBuffer":{"type":"Buffer","data":[29,110,251,73,76,81,184,27,247,142,185,216,62,89,135,247,32,66,130,71]},"announce":[],"urlList":[]}}