{"title":"Womble MPEG Video Wizard v4.0.4.111","uid":4676875,"size":7889447,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1d9abf02503f7c07671c23e0493521459b2068a4&amp;dn=Womble+MPEG+Video+Wizard+v4.0.4.111&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"adollop","files":2,"time":1232928585,"description":"The Womble MPEG Video Wizard is the multi-dimensional MPEG editor. Whether you are a video professional or a new video enthusiast, we are confident that MVW will meet all of your MPEG editing needs.\n\nThe Womble MPEG Video Wizard contains all of the key features of its predecessor Womble MPEG-VCR: frame accurate editing, fastest scrubbing of any MPEG editor, fastest frame stepping, and no re-encoding when editing DVD-compliant MPEG captures from the latest hardware boxes.\n\nAdditionally, the following are some of the new features added to the Womble MPEG Video Wizard:\n\nVery intuitive and easy-to-use User Interface (UI), with a flexible yet powerful multi-track timeline based editing.\nComprehensive edit project and content management, batch job processing, and project package tool.\nFlexible title editor for both text and graphics generation. You can create attractive titles directly with MVW.\nAn extensive transition library with simple controls. Most common transitions can be added using only the mouse.\nMultiple editing windows, with flexible window configuration and layout, and many more features. ","torrent":{"xt":"urn:btih:1d9abf02503f7c07671c23e0493521459b2068a4","amp;dn":"Womble+MPEG+Video+Wizard+v4.0.4.111","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d9abf02503f7c07671c23e0493521459b2068a4","infoHashBuffer":{"type":"Buffer","data":[29,154,191,2,80,63,124,7,103,28,35,224,73,53,33,69,155,32,104,164]},"announce":[],"urlList":[]}}