{"title":"lost season 5 afl 12-13-14-15  dutch","uid":4889612,"size":1448979974,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f1f0c84f8f9dea95f955aae0b621fe26b1ac222&amp;dn=lost+season+5+afl+12-13-14-15++dutch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"brillant","files":1,"time":1241902852,"description":"4 afleveringen lost season 5 afl 12-13-14-15\n\n5-12 (98) \t&quot;Dead is Dead (en) &quot; \tBen \tStephen Williams \tBrian K. Vaughan &amp; Elizabeth Sarnoff \tVerenigde Staten 8 april 2009\nIn 2007 is Ben verbaasd als hij John Locke naast zijn bed ziet zitten als hij ontwaakt. John wil weten waarom Ben hem heeft vermoord. Ben vertelt dat hij dit moest doen- John had wat belangrijke informatie en eens hij die gedeeld had, moest John dood- want dat was de enige manier om de Oceanic 6 terug bij elkaar te brengen. Ben wil terugkeren naar het grote eiland om er voor het rookmonster te verschijnen en veroordeeld te worden omdat hij de regels gebroken heeft (hij is teruggekeerd naar het eiland) en voor zijn daden uit het verleden. Samen met Locke keert Ben terug naar het eiland. Locke wijst hem erop dat hij niet veroordeeld moet worden voor zijn daden of terugkeer, maar wel voor de dood van zijn dochter Alex. In Bens oude huis vinden ze Sun en piloot Frank Lapidus terug. Ben probeert het monster op te roepen, maar het verschijnt niet. John besluit daarop het monster op te zoeken in de tempel. Daar verschijnt Ben voor het monster en krijgt ook Alex te zien: die maant hem aan om vanaf nu te luisteren naar Locke, anders zal zij hem vermoorden- wat hij ook beloofd te doen. Lapidus wordt ondertussen gevangen genomen bij zijn terugkeer op het kleine eiland door Ilana en haar handlangers. \n\n5-13 (99) \t&quot;Some Like it Hoth (en) &quot; \tMiles \tJack Bender \tMelinda Hsu Taylor &amp; Greggory Nations \tVerenigde Staten 15 april 2009\nRoger (de vader van Ben) vermoedt dat Kate iets te maken heeft met de verdwijning van zijn zoon uit de ziekenzaal. Miles moet (tegen zijn zin) samenwerken met Hurley om een lijk af te leveren bij Dr. Chang, een hoge Dharma chef en zijn vader. We komen ook te weten hoe Miles zijn gave om met de doden te praten ontdekte en hoe hij aan boord van het fregat kwam. \n\n\n5-14 (100) \t&quot;The Variable (en) &quot; \tDaniel Faraday \tPaul Edwards \tEdward Kitsis &amp; Adam Horowitz \tVerenigde Staten 29 april 2009\nDaniel Faraday keert terug naar het eiland om de bewoners te waarschuwen over een ramp in The Swan. Jack, Kate en Daniel beginnen een vuurgevecht met The Dharma Initiative, waardoor zij op hun beurt achter Juliet en Sawyer aangaan. We zien ook meer over Daniel's verleden en zijn ouders: Eloise Hawking &amp; Charles Widmore. \n\n\n5-15 (101) \t&quot;Follow the Leader (en) &quot; \tVerschillende \tStephen Williams \tPaul Zbyszewski &amp; Elizabeth Sarnoff \tVerenigde Staten 6 mei 2009\nIn 1977 beslist Jack om het advies van Daniel te volgen en de waterstofbom te laten ontploffen. Kate is het daar niet mee eens en keert terug naar het dorp. Dr. Chang kan zijn collega's overtuigen het eiland te ontruimen. Sawyer, Juliet en Kate moeten ook aan boord van de duikboot. Ondertussen neemt Locke (in 2007) zijn plaats in als leider van 'The Others' en beslist om met zijn groep Jacob te gaan bezoeken (en te vermoorden) ... ","torrent":{"xt":"urn:btih:1f1f0c84f8f9dea95f955aae0b621fe26b1ac222","amp;dn":"lost+season+5+afl+12-13-14-15++dutch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f1f0c84f8f9dea95f955aae0b621fe26b1ac222","infoHashBuffer":{"type":"Buffer","data":[31,31,12,132,248,249,222,169,95,149,90,174,11,98,31,226,107,26,194,34]},"announce":[],"urlList":[]}}