{"title":"The Report on Unidentified Flying Objects - Ruppelt - 1956 (ePub","uid":9262350,"size":656372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20a899c930a8d6673ecfe52915e49f7454cfddfc&amp;dn=The+Report+on+Unidentified+Flying+Objects+-+Ruppelt+-+1956+%28ePub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ShitBomb","files":-1,"time":1385598951,"description":"The Report on Unidentified Flying Objects, written by Captain Edward Ruppelt in 1956, was the first serious, unbiased account written about UFOs by anyone connected with the official government investigations of UFO phenomena. Ruppelt, who coined the term &quot;unidentified flying objects&quot; and headed Project Blue Book from 1951 to 1953, includes his personal investigations and findings in his extensive research on UFOs. He discusses both well-publicized UFO sightings and lesser-known accounts, as well as the inner workings of Air Force UFO research. This edition is the original 1956 edition; in 1960 Ruppelt released a second edition which seemed to weaken his original views that some UFO reports could not be explained, and reinforce the Air Force's position that there was nothing mysterious about UFOs. EDWARD J. RUPPELT (1923-1960) was the head of Project Blue Book during the Korean War, from 1951-1953. He served at the Air Technical Intelligence Center, where he took over Project Grudge, a formal investigation by the U.S. military with the goal of debunking extraterrestrial and UFO activity. Under Ruppelt's supervision, the project, later named Blue Book, experienced its most fruitful years, when investigations were properly conducted without judgment or disdain. Many UFO researchers hail him as a pioneer of UFO research and hero in the fight to earn respectability for the field.","torrent":{"xt":"urn:btih:20a899c930a8d6673ecfe52915e49f7454cfddfc","amp;dn":"The+Report+on+Unidentified+Flying+Objects+-+Ruppelt+-+1956+%28ePub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20a899c930a8d6673ecfe52915e49f7454cfddfc","infoHashBuffer":{"type":"Buffer","data":[32,168,153,201,48,168,214,103,62,207,229,41,21,228,159,116,84,207,221,252]},"announce":[],"urlList":[]}}