{"title":"Keri Hilson Ft Kanye West &amp; Ne-Yo- Knock You Down(2009)(HQ)-Wush","uid":4854028,"size":54307192,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:20ce327afdf7fc99ed68fbbc71e9520cf442b3f2&amp;dn=Keri+Hilson+Ft+Kanye+West+%26+Ne-Yo-+Knock+You+Down%282009%29%28HQ%29-Wush&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wushan","files":5,"time":1239988159,"description":"\n                                    Knock You Down\n                                 \n               Single by Keri Hilson featuring Kanye West and Ne-Yo\n\n                          from the album In a Perfect World...\n\n\n         &quot;Knock You Down&quot; is the fourth U.S. single from Keri Hilson's debut album, In a Perfect World.... The song features rapper Kanye West and singer Ne-Yo. The music video for the song premiered on March 23, one day before the release of the album.\n\n         It was written by Nathaniel Hills, Marcella Araica, Kevin &quot;KC&quot; Cossom, Shaffer Smith, Keri Hilson and Kanye West. Like most of the songs on the album Keri Hilson made final ammendments to the song before it was recorded. Danja is executively produced the single. She said that she had always wanted to work with Ne-Yo and Kanye West, and West's vocals were a last minute addition to the single.\n\n   It was confirmed on Hilson's official video blog album countdown.\n\n   The single also features guest vocals from rapper Kanye West and pop/R&amp;B singer Ne-Yo.\n\n\n     The music video for &quot;Knock You Down&quot; was shot in Los Angeles with director Chris Robinson\n\n        In the video's first scene Hilson is filmed free-falling in the bedroom of her apartment. The next scene follows her life with Kanye West playing her love interest, after which Ne-Yo takes over playing another love interest during his verses. The final part of the video features a split screen which on the left shows what's happening in the present when West sees Hilson making out with Ne-Yo whilst the right side of the screen relays the first part of the video in black and white. The final scene is ....\n\n                             ***Knock You Down.***\n\n\n                                   Enjoy!!!\n","torrent":{"xt":"urn:btih:20ce327afdf7fc99ed68fbbc71e9520cf442b3f2","amp;dn":"Keri+Hilson+Ft+Kanye+West+%26+Ne-Yo-+Knock+You+Down%282009%29%28HQ%29-Wush","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ce327afdf7fc99ed68fbbc71e9520cf442b3f2","infoHashBuffer":{"type":"Buffer","data":[32,206,50,122,253,247,252,153,237,104,251,188,113,233,82,12,244,66,179,242]},"announce":[],"urlList":[]}}