{"title":"PENUMBRA","uid":4373004,"size":234705187,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:24eca2d32eed21e13fe25d7f1164503f68425147&amp;dn=PENUMBRA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fallos0","files":4,"time":1220266017,"description":"RELEASE DATE : 28-08-2008           PROTECTION : Nothing\nGAME TYPE    : Adventure            DISKS      : 1 CD\n\nRelease Notes:\n\nNote: This requires Penumbra Black Plague to be installed\nfirst!\n\nRequiem will tie up loose ends from previous installments and\nas Philip progresses he will encounter various characters from\nhis past. Penumbra: Requiem delves deeper into the world of\nthe Tuurngait infection and personalities from the previous\ntwo games, Overture and Black Plague. Long lost friends will\nreturn and aid Philip on his quest, but can they really be\ntrusted?\n\nIn the bizarre world of Penumbra: Requiem players will\nexperience another psychological thrill on a level unheard of\nbefore Penumbra: Black Plague. This time telling what is real\nand what is not will be even harder and not always trusting\nyour senses will be essential in order to survive.\n\nPenumbra Requiem includes many new levels to explore, old\nfriends from previous games, highly interactive physics\npuzzles and a scary and disturbing atmosphere unprecedented in\nany other game.\n\nThe expansion will tie together the previous Penumbra games\nand give the series its climactic resolution.  Requiem takes\nup where the last game ended and sees Philip, the game&amp;#039;s\nprotagonist, falling deeper into madness which forces him to\nfight some inner demons as well as outer ones.\n\nPlayers will be taken on a tense journey filled with\npsychological horror and the most unspeakable things lurking\nin the darkness.\n\nThis time telling what is real and what is not will be even\nharder and questioning your senses will be essential to\nsurvival. Your decisions could make the difference between\nlife and death.\n\nInstall Notes:\n\n1. Unpack Release\n2. Mount/Burn Image\n3. Install Penumbra Black Plague\n3. Install this expansion\n4. Check our cracktro out, it&amp;#039;s located in the SKIDROW dir on\nthe CD\n5. Play the game\n","torrent":{"xt":"urn:btih:24eca2d32eed21e13fe25d7f1164503f68425147","amp;dn":"PENUMBRA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24eca2d32eed21e13fe25d7f1164503f68425147","infoHashBuffer":{"type":"Buffer","data":[36,236,162,211,46,237,33,225,63,226,93,127,17,100,80,63,104,66,81,71]},"announce":[],"urlList":[]}}