{"title":"Onibaba (1964)","uid":4748042,"size":707261301,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2758c7293fd5ab7f22ed25aaa3c2c0c220240dc1&amp;dn=Onibaba+%281964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jgordon20904","files":2,"time":1235999322,"description":"My Japanese wife and I are not too excited about this movie &quot;Onibaba.&quot;\nOf course you all know that Oni in Japanese means ogre or monster and Baba means grandmother. My Japanese wife says it also implies the possible meaning of a very disagreeable person. Of course the person in &quot;Onibaba&quot; is not a grandmother nor is she particularly disagreeable. \n\nI guess our main complaint is explicit sex. My wife was amazed that such stuff was being shown in Japan that early. We're old fashioned and stodgy. I fought in World War II and the Korean War as a fighter pilot. She was a teenager learning to play the piano and sing, and she dodged American bombing raids while on her train rides commuting to high school some miles away from home. She recalls a fighter plane strafing attack on a train station she was in once. Her brother was training to be a Kamikaze pilot at war's end. \n\nBut I digress.\n\nShe and I generally avoid modern movies with their sex, violence and vulgar speech. Hopfully we'll learn to like this movie better later. We often change our opinion with repeated viewing.\n\n&quot;Why upload a movie you don't like?&quot; you might ask. And well you should.\n\n","torrent":{"xt":"urn:btih:2758c7293fd5ab7f22ed25aaa3c2c0c220240dc1","amp;dn":"Onibaba+%281964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2758c7293fd5ab7f22ed25aaa3c2c0c220240dc1","infoHashBuffer":{"type":"Buffer","data":[39,88,199,41,63,213,171,127,34,237,37,170,163,194,192,194,32,36,13,193]},"announce":[],"urlList":[]}}