{"title":"National Treasure 2. Book Of Secrets.DvDrip.Swesub","uid":4292105,"size":735549440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:27fd620164f36acb0cd621310159e5665a6e0ce1&amp;dn=National+Treasure+2.+Book+Of+Secrets.DvDrip.Swesub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wiseff","files":1,"time":1215946540,"description":"Treasure hunter Ben Gates (Nicolas Cage) embarks on a new adventure in director Jon Turtletaub&amp;#039;s sequel to NATIONAL TREASURE. Ben and his father, Patrick (Jon Voight), take great pride in their ancestors and their family&amp;#039;s devotion to the United States. When Mitch Wilkinson (Ed Harris) produces a page from the diary of Lincoln assassin John Wilkes Booth allegedly linking Ben&amp;#039;s great-great grandfather to the plot, Ben and Patrick set out on a path to clear their family&amp;#039;s name. Ben also believes that the diary page contains hints to the whereabouts of a treasure map leading to an ancient city made of gold, and soon the hunt is on. Tech expert Riley Poole (Justin Bartha) and Ben&amp;#039;s now ex-girlfriend Abigail Chase (Diane Kruger) join the Gates in their quest, which takes them from Washington, DC, to Paris, London and the Black Hills of South Dakota. It&amp;#039;s true that the storyline and the actions of Gates and his team--which include breaking into the Queen&amp;#039;s study at Buckingham Palace, sneaking into the Oval Office, and kidnapping the President of the United States--are completely unbelievable. But with a storyline built on true, interesting trivia and great locations, this film is an amusing, family-friendly romp. Cage has some great moments as Gates-- loyal, patriotic, fair to a fault, and very funny as he goads on Buckingham Palace security. Harris plays Wilkinson with just the right air of mystery and menace: is he after fortune, or does he just want to leave his own mark in history? Helen Mirren fits the bill as Ben&amp;#039;s mother and Patrick&amp;#039;s estranged ex-wife, Emily, a scholar and historian in her own right.\n\n","torrent":{"xt":"urn:btih:27fd620164f36acb0cd621310159e5665a6e0ce1","amp;dn":"National+Treasure+2.+Book+Of+Secrets.DvDrip.Swesub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27fd620164f36acb0cd621310159e5665a6e0ce1","infoHashBuffer":{"type":"Buffer","data":[39,253,98,1,100,243,106,203,12,214,33,49,1,89,229,102,90,110,12,225]},"announce":[],"urlList":[]}}