{"title":"Der Pakt mit dem Panda","uid":6493193,"size":238293248,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:28070fe0c8c1f4109fa040268bc3aacc32761cbd&amp;dn=Der+Pakt+mit+dem+Panda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1308962549,"description":"Die Dokumentation will die Geheimnisse des WWF ergruenden. Sie wird zur einer Reise ins Herz des gruenen Empire und sie erschuettert den Glauben an den Panda.\n\nDer WWF gilt als groesste Umweltschutzorganisation der Welt. Fast grenzenlos ist das Vertrauen in seine gruenen Projekte. Mit aufruettelnden Kampagnen zielt der WWF direkt aufÃ‚Â´s gute Gewissen der Spender - alle sollen sich beteiligen wenn aussterbende Arten geschuetzt und das Klima oder der Regenwald gerettet werden.\n\nVor 50 Jahren wurde der WWF gegruendet - am 11. September 1961. Heute ist der WWF die einflussreichste Lobbyorganisation fÃƒÂ¼r die Umwelt - weltweit. Dank bester Kontakte zur Politik und zur Industrie. Eine stÃƒÂ¤ndige Gratwanderung zwischen Engagement und Kaeuflichkeit. Ein ganzes Jahr arbeitete der Dokumentarfilmer Wilfried Huismann an einem Film, der das gruene Bild des WWF entzaubern wird. Hinter der Oeko-Fassade entdeckte der Autor waehrend seiner Dreharbeiten weltweit Geschichten voller Sprengkraft.\n\nEine CoProduktion von WDR und SWR Redaktion: Tibet Sinha und Martin Schneider\n\nDie in der urspruenglichen Pressemeldung vom 11.05.2011 enthaltene Aussage, wonach das ARD-Team auf Borneo (Indonesien) &quot;kein einziges Organ-Utan Schutzprojekt des WWF&quot; gefunden hat, halten wir nicht aufrecht. Gleiches gilt fÃƒÂ¼r die Formulierung: &quot;Der WWF nimmt Geld von den Unternehmen und verschafft ihm das Guetesiegel fÃƒÂ¼r nachhaltige Produktionen&quot;, soweit dadurch der Eindruck erweckt wird, das Unternehmen wuerde gegen Geldzahlung ein WWF-Guetesiegel fÃƒÂ¼r nachhaltige Produktionen erhalten. Hierzu haben wir uns auch gegenueber WWF Deutschland zur Unterlassung verpflichtet.\n\niOS-GerÃƒÂ¤te kompatibel","torrent":{"xt":"urn:btih:28070fe0c8c1f4109fa040268bc3aacc32761cbd","amp;dn":"Der+Pakt+mit+dem+Panda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28070fe0c8c1f4109fa040268bc3aacc32761cbd","infoHashBuffer":{"type":"Buffer","data":[40,7,15,224,200,193,244,16,159,160,64,38,139,195,170,204,50,118,28,189]},"announce":[],"urlList":[]}}