{"title":"Useful PC Software for the Cheapskates and Fraidy-Cats (unzipped","uid":4886286,"size":299544844,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:288cbf5de6162782d3631f3e28c7cee0c10470ba&amp;dn=Useful+PC+Software+for+the+Cheapskates+and+Fraidy-Cats+%28unzipped&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zenmunkey","files":21,"time":1241734586,"description":"Sorry about the old torrent and it being zipped. ~n00b m1st4k3~\n\nThis stuff is for full optimization of your Windows computer. It's all free, no illegal stuff. It's all tested 100% spyware/adware free.\n\nAnti-malware\n\n1) avast! professional edition: anti-malware. Very reliable yet annoying if you try to use a keygen.\n2) AVG: anti-malware. Another reliable one, but be careful about deleting files!\n3) Spybot S+D: anti-spyware. Pretty complete anti-spyware. Use in conjunction with avast! or AVG.\n4) Dr. Web Cure-It: virus cleaner. Just a scanner and it'll cure most viruses. Doesn't waste memory by always running :D However, it's slow and not good if you have &lt;512 MB ram. (shareware)\n5) MalwareBytes: anti-malware. Finds things that other anti-malware can't!\n\nNever install two anti-malware suites on one computer. A good game plan is to choose either avast! or AVG. Both are equally reliable and do pretty much the same thing. Spybot and TeaTimer are useful so download them in conjunction with avast! or AVG. Malwarebytes as well has no effect on avast! or AVG's performance.\n\nOffice programs\n\n1) OpenOffice.org: completely open-source software that does everything Microsoft office does. Want it all? It's got it all.\n\n\nPC Optimization\n\n1) CCleaner. Once called CrapCleaner. It cleans your crap. By that, I mean registry, log files, garbage that you don't need... It's much better than the DisK Cleanup that comes stock with Windows.\n2) UltraDefrag. A powerful defragger for Windows, and it's pretty damn good compared to the built-in one.\n3) Eusing Registry Cleaner. Does what it's supposed to: clean the registry! It's good to have when your computer feels sluggish.\n\nOther nice stuff to have\n\n1) IZArc. An open-source WinRAR. Don't bother with that silly 'WinRAR is not free' notice! Unfortunately, this CANNOT make .RAR archives, just extract them.\n2) GIMP: Mostly used for Linux operating systems, this is an open-source image editing program. It's good to say the least\n3) Skype: Can be used in the office, but more often used to talk to friends and plan your raids *cough* outings.\n4) Picasa from Google: Photo editing software. It removes red-eye and all that good stuff.\n5) CPU-Z. Shows how your CPU is doing, the amount of RAM you have, and the type of CPU you have. YOU NEED THIS UTILITY, especially if you are an avid overclocker.\n6) GPU-Z. Like CPU-Z, but checks your GPU. It shows you your video card stats, and what it can do and what it is doing.\n7) Foxit Reader. It's a PDF viewer and then some. I personally like it more than Adobe.\n8) Process Explorer. Like Task Manager, but it will show you many processes than you didn't even know existed! Good for finding bottlenecks in computer performance.\n9) VirtualCloneDrive. An ISO mounting device. Like DAEMON Tools, minus adware!\n10) Infra Recorder. Decent open-source image-burning software. ","torrent":{"xt":"urn:btih:288cbf5de6162782d3631f3e28c7cee0c10470ba","amp;dn":"Useful+PC+Software+for+the+Cheapskates+and+Fraidy-Cats+%28unzipped","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"288cbf5de6162782d3631f3e28c7cee0c10470ba","infoHashBuffer":{"type":"Buffer","data":[40,140,191,93,230,22,39,130,211,99,31,62,40,199,206,224,193,4,112,186]},"announce":[],"urlList":[]}}