{"title":"Mi dinosaurio favorito.(Documental).(TDTRip.Divx.Spanish).","uid":4489228,"size":416415744,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:29510189d7368f22d43c9d207bfddb3fd5a808d1&amp;dn=Mi+dinosaurio+favorito.%28Documental%29.%28TDTRip.Divx.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"cholo24","files":1,"time":1225905529,"description":"Mi dinosaurio favorito\n\nMi dinosaurio favorito recoge la opiniÃƒÂ³n de diferentes paleontÃƒÂ³logos sobre quÃƒÂ© hubiera pasado si los dinosaurios hubieran seguido viviendo y evolucionando hasta nuestros dÃƒÂ­as. Hace 65 millones de aÃƒÂ±os los dinosaurios desparecieron para siempre. Desde entonces han vivido intensamente en nuestras mentes. Pero, Ã‚Â¿que pasarÃƒÂ­a si no se hubieran extinguido? Los cientÃƒÂ­ficos creen que pueden emplear conocidas teorÃƒÂ­as evolutivas para responder a estas preguntas.\nSegÃƒÂºn el paleo-biÃƒÂ³logo britÃƒÂ¡nico Paul Upchurch, los humanos y los dinosaurios hubieran podido convivir perfectamente. Explica cÃƒÂ³mo hubieran podido sobrevivir al cambio climÃƒÂ¡tico; cÃƒÂ³mo hubieran permitido que los humanos evolucionÃƒÂ¡semos hasta lo que somos hoy en dÃƒÂ­a. Cuando los continentes comenzaron a moverse, los dinosaurios, con capacidad de adaptaciÃƒÂ³n, se hubieran extendido por todo el mundo para colonizar diversas condiciones medioambientales, desde las regiones polares hasta otras con rÃƒÂ­os y bosques, junglas o desiertos. Mi dinosaurio favorito cuenta cÃƒÂ³mo hubieran vivido en el hÃƒÂ¡bitat actual; desde la persecuciÃƒÂ³n de ÃƒÂ±ÃƒÂºs y guepardos en el Serengeti hasta las ciudades cosmopolitas donde probablemente buscarÃƒÂ­an comida con las palomas o vivirÃƒÂ­an en nuestras casas como mascotas. Pero no todos opinan lo mismo. De acuerdo con los que apoyan la teorÃƒÂ­a evolutiva del profesor Steven Jay Gould, si echamos la vista atrÃƒÂ¡s sobre la evoluciÃƒÂ³n e imaginamos el proceso desarrollÃƒÂ¡ndose de nuevo desde el principio, todo serÃƒÂ­a diferente. Dinosaurios y humanos no podrÃƒÂ­an convivir juntos en la actualidad porque no hubiÃƒÂ©ramos evolucionado a lo que somos. Algunos dinosaurios hubieran empezado a invadir nuevos espacios como lagos y mares pero probablemente las cosas hubieran permanecido igual y el mundo de hoy se parecerÃƒÂ­a mÃƒÂ¡s a una copia del mundo de los dinosaurios hace 65 millones de aÃƒÂ±os.\n","torrent":{"xt":"urn:btih:29510189d7368f22d43c9d207bfddb3fd5a808d1","amp;dn":"Mi+dinosaurio+favorito.%28Documental%29.%28TDTRip.Divx.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29510189d7368f22d43c9d207bfddb3fd5a808d1","infoHashBuffer":{"type":"Buffer","data":[41,81,1,137,215,54,143,34,212,60,157,32,123,253,219,63,213,168,8,209]},"announce":[],"urlList":[]}}