{"title":"The Age of Turbulence- (Greenspan) (5min chunks)","uid":4332043,"size":432942228,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:29e4f5b5cc948d282ecd2ff0944762d13cc74d01&amp;dn=The+Age+of+Turbulence-+%28Greenspan%29+%285min+chunks%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"plasmaview","files":244,"time":1218099216,"description":"Cut into ~5 minute chunks to accommodate the brain-dead Blackberry media player that does not support bookmarks.\n\nThe source material comes from http://thepiratebay.se/torrent/3916901/The_Age_of_Turbulence_-_Adventures_in_a_New_World_(Greenspan)_%5BN.  It's excellent quality but just formatted in a way that doesn't work well on my Blackberry, so I split it up.  Hopefully this torrent will save somebody else the work.\n\nTools used:\n\n - mp3splt to chunk up the original gigantic ~7 hour MP3 files.  I configured it for a nominal 5 minute split but to look for 3 seconds of silence and adjust the timing of the split accordingly.\n\n - EditTAG to fix the ID3 tags.\n\nIt is unfortunately formatted as 3 albums, since the original source material was in 3 files and I could not figure out how to reliably concatenate them first without doing a conversion to WAV and then reencoding and losing quality.\n\n242 files, 20 hours total\n\n----------------------------\n\nAlan Greenspan - The Age of Turbulence - Adventures in a New World\n\n\n\nBook Description\nIn the immediate aftermath of September 11, 2001, in his fourteenth year as Chairman of the Federal Reserve Board, Alan Greenspan took part in a very quiet collective effort to ensure that America didn't experience an economic meltdown, taking the rest of the world with it. There was good reason to fear the worst: the stock market crash of October 1987, his first major crisis as Federal Reserve Chairman, coming just weeks after he assumed control, had come much closer than is even today generally known to freezing the financial system and triggering a genuine financial panic. But the most remarkable thing that happened to the economy after 9/11 was...nothing. What in an earlier day would have meant a crippling shock to the system was absorbed astonishingly quickly. \n\nAfter 9/11 Alan Greenspan knew, if he needed any further reinforcement, that we're living in a new world - the world of a global capitalist economy that is vastly more flexible, resilient, open, self-directing, and fast-changing than it was even 20 years ago. It's a world that presents us with enormous new possibilities but also enormous new challenges. The Age of Turbulence is Alan Greenspan's incomparable reckoning with the nature of this new world - how we got here, what we're living through, and what lies over the horizon, for good and for ill-channeled through his own experiences working in the command room of the global economy for longer and with greater effect than any other single living figure. He begins his account on that September 11th morning, but then leaps back to his childhood, and follows the arc of his remarkable life's journey through to his more than 18-year tenure as Chairman of the Federal Reserve Board, from 1987 to 2006, during a time of transforming change. \n\nAlan Greenspan shares the story of his life first simply with an eye toward doing justice to the extraordinary amount of history he has experienced and shaped. But his other goal is to draw readers along the same learning curve he followed, so they accrue a grasp of his own understanding of the underlying dynamics that drive world events. In the second half of the book, having brought us to the present and armed us with the conceptual tools to follow him forward, Dr. Greenspan embarks on a magnificent tour de horizon of the global economy. He reveals the universals of economic growth, delves into the specific facts on the ground in each of the major countries and regions of the world, and explains what the trend-lines of globalization are from here. The distillation of a life's worth of wisdom and insight into an elegant expression of a coherent worldview, The Age of Turbulence will stand as Alan Greenspan's personal and intellectual legacy.\n &lt;a href=&quot;\nhttp://www.amazon.com/Age-Turbulence-Adventures-New-World/dp/1594201315/ref=pd_bbs_1?ie=UTF8&amp;s=books&amp;qid=1217867183&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Age-Turbulence-Adventures-New-World/dp/1594201315/ref=pd_bbs_1?ie=UTF8&amp;s=books&amp;qid=1217867183&amp;sr=8-1&lt;/a&gt;\n","torrent":{"xt":"urn:btih:29e4f5b5cc948d282ecd2ff0944762d13cc74d01","amp;dn":"The+Age+of+Turbulence-+%28Greenspan%29+%285min+chunks%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29e4f5b5cc948d282ecd2ff0944762d13cc74d01","infoHashBuffer":{"type":"Buffer","data":[41,228,245,181,204,148,141,40,46,205,47,240,148,71,98,209,60,199,77,1]},"announce":[],"urlList":[]}}