{"title":"Spectromancer Demo [Windows Game]","uid":4522251,"size":20396642,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2c06b2c95ef7460bb7587e354c6a38193f2bfe1a&amp;dn=Spectromancer+Demo+%5BWindows+Game%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vega0ne","files":2,"time":1227209238,"description":"In Spectromancer, an online fantasy card game, players participate in a magical duel against other mages by strategically summoning creatures and casting spells. Each mage uses five magical elements during a duel - Fire, Water, Air and Earth, plus a fifth related to the specific mage type. There are six mage types in the game: Clerics use Holy power; Mechanicians use Mechanics; Necromancers use Death; Chaosmasters use Chaos; Dominators uses Control and Illusionists use Illusions. Players are able to duel against the computer or against other online players live.\n\nThe team behind Spectromancer are Alexey Stankevich, creator of Astral Tournament and Astral Masters, along with game design luminaries Richard Garfield (Magic: The Gathering, Vampire: The Eternal Struggle, Star Wars Trading Card Game, RoboRally) and Skaff Elias (Magic: The Gathering Ice Age, Harry Potter Trading Card Game).\n\nThe popular Astral Tournament, a turn-based online strategy card game, released by Alexey Stankevich&amp;#039;s Apus Software in 2002, was embraced by players worldwide and received favorable reviews at game sites and game magazines. In April of 2006, Astral Tournament II went into preproduction and in June, Richard Garfield and Skaff Elias from Three Donkeys joined the project and the expanded game has evolved into Spectromancer. ","torrent":{"xt":"urn:btih:2c06b2c95ef7460bb7587e354c6a38193f2bfe1a","amp;dn":"Spectromancer+Demo+%5BWindows+Game%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c06b2c95ef7460bb7587e354c6a38193f2bfe1a","infoHashBuffer":{"type":"Buffer","data":[44,6,178,201,94,247,70,11,183,88,126,53,76,106,56,25,63,43,254,26]},"announce":[],"urlList":[]}}