{"title":"Lonesome.Dove.2 Disc.Dvdr. Nordic.PAL","uid":4855820,"size":9366369798,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2c5e39dbe3871a3fd777c84ee0a3fd99a3d7af4f&amp;dn=Lonesome.Dove.2+Disc.Dvdr.+Nordic.PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GreyEagleHawk","files":10,"time":1240060648,"description":"Robert Duvall and Tommy Lee Jones star as Gus McCrae and Woodrow Call, aging cowboys and former Texas rangers and who organize a 2,500 mile cattle drive for one last great adventure in this excellent 1989 miniseries adaptation of Larry McMurtry's novel. The best friends, who steal the herd from a gang of Mexican cattle rustlers, drive their herd from Texas to Montana, battling horse thieves, angry Indian tribes, and a renegade half-breed killer named Blue Duck (Frederic Forrest) on a mission of revenge. The excellent cast also includes Robert Urich as cardsharp and former Ranger Jake Spoon, Anjelica Huston as McCrae's old flame Clara Allen, Danny Glover, Ricky Schroder, Diane Lane, Chris Cooper, D.B. Sweeney, Steve Buscemi, and even a small role for author Larry McMurtry. Australian director Simon Wincer shows a tremendous capacity for balancing sweeping drama and intimacy against the gorgeous landscape of the American Southwest, giving a grandly epic feel to the film despite its small-screen target and limited budget, and for forging memorable characters of even the smallest supporting parts. The heart of the drama belongs to McCrae and Call, memorably etched by Duvall and Jones as the last of the range romantics. In the age of revisionist Westerns, this excellent cattle-drive drama nicely maintains an old-fashioned feeling while still showing the dark side of the American West.\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0096639/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0096639/&lt;/a&gt;","torrent":{"xt":"urn:btih:2c5e39dbe3871a3fd777c84ee0a3fd99a3d7af4f","amp;dn":"Lonesome.Dove.2+Disc.Dvdr.+Nordic.PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c5e39dbe3871a3fd777c84ee0a3fd99a3d7af4f","infoHashBuffer":{"type":"Buffer","data":[44,94,57,219,227,135,26,63,215,119,200,78,224,163,253,153,163,215,175,79]},"announce":[],"urlList":[]}}