{"title":"Democracy Now - 21 jun 2011","uid":6485000,"size":448963352,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2d84b2f2f73bcf98762b1794a60d6d0dbd42750a&amp;dn=Democracy+Now+-+21+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1308674943,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 21, 2011\n\n- Supreme Court Rules in Favor of Walmart in Sex-Discrimination Case\n- States' Emissions Lawsuit Against Major Power Companies Rejected By Supreme Court\n- Obama To Announce Plan For Troop Withdrawals from Afghanistan\n- Libya: NATO Air Strike Reportedly Kills 19 Civilians, Eight Children\n- Ex-Tunisian President, Wife Sentenced to 35 Years in Prison\n- Report: Number of World's Refugees Reaches 15-Year High\n- Ocean Experts Warn Of Unprecedented Mass Extinction Of Marine Life\n- Obama Breaks Promise to Reinstall Solar Panels on White House\n- Report: Majority of U.S. Nuclear Power Sites Leak Radioactive Materials Into Groundwater\n- Uninsured Man Robs Bank of $1 To Gain Prison Medical Coverage\n- Justice Clarence Thomas Under Fire For Ties to Real Estate Magnate\n- New Yorkers Camp Out To Protest Bloomberg Budget Cuts\n\n\nSpecial reports\n\n- 1.5 Million Female Walmart Employees Lose Historic Sex Discrimination Case Before Supreme Court\n\nThe U.S. Supreme Court has unanimously dismissed the largest class action lawsuit in history filed by 1.5 million current and former female employees of Walmart, who say they were allegedly paid less and promoted less often than their male counterparts. The Court found women who worked at Walmart did not have enough in common to constitute a &quot;class&quot; in a class-action lawsuit. It did not address whether Walmart had discriminated against women, but in writing for the minority in part of the court's ruling, Justice Ruth Bader Ginsburg wrote, that the &quot;plaintiffs' evidence, including class members' tales of their own experiences, suggests that gender bias suffused Walmart's company culture.&quot; We speak with former Walmart employee Stephanie Odle, one of the original plaintiffs in the case. We also discuss the &quot;limits of a courtroom remedy&quot; in this case, and Walmart's anti-union efforts with Liza Featherstone, author of &quot;Selling Women Short: The Landmark Battle for Worker's Rights at Wal-Mart.&quot;\n\n\n- &quot;If A Tree Falls&quot;: New Documentary On Daniel McGowan, Earth Liberation Front and Green Scare\n \nA new documentary, &quot;If a Tree Falls: The Story of the Earth Liberation Front,&quot; tells the story of environmental activist Daniel McGowan. Four years ago this month, McGowan was sentenced to a seven-year term for his role in two acts of politically motivated arson in 2001 to protest extensive logging in the Pacific Northwest-starting fires at a lumber company and an experimental tree farm in Oregon. The judge ruled he had committed an act of terrorism, even though no one was hurt in any of the actions. McGowan participated in the arsons as a member of the Earth Liberation Front, but left the group after the second fire led him to become disillusioned. He was arrested years later after a key member of the Earth Liberation Front-himself facing the threat of lengthy jail time-turned government informant. McGowan ultimately reached a plea deal, but refused to cooperate with the government's case. As a result, the government sought a &quot;terrorism enhancement&quot; to add extra time to his sentence. McGowan is currently jailed in a secretive prison unit known as Communication Management Units, or CMUs, in Marion, Illinois. We play an excerpt from the film and speak with director, Marshall Curry. We also speak with Andrew Stepanian, an animal rights activist who was imprisoned at the same CMU as McGowan, and by Will Potter, a freelance reporter who writes about how the so-called &quot;war on terror&quot; affects civil liberties.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2d84b2f2f73bcf98762b1794a60d6d0dbd42750a","amp;dn":"Democracy+Now+-+21+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d84b2f2f73bcf98762b1794a60d6d0dbd42750a","infoHashBuffer":{"type":"Buffer","data":[45,132,178,242,247,59,207,152,118,43,23,148,166,13,109,13,189,66,117,10]},"announce":[],"urlList":[]}}