{"title":"Micro_Maniacs_PAL_PSX","uid":5398795,"size":286190659,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:2f6ad4c59a8fc7e6599a59ae6784dff24c6b8783&amp;dn=Micro_Maniacs_PAL_PSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":3,"time":1267343204,"description":"Enjoying playing PSX games on my emulator thought I would upload this gem from 2000.\n\nFor those that don't know or don't remember the immense fun of this game:\n\n&quot;Micro Maniacs is the sequel to one of most popular multi-player arcade racing games ever created - Micro Machines V3. It follows the same general format as its predecessor in that each player controls a tiny little character that must race around various areas of the inside and outside of a huge house. The major difference is that vehicles have been replaced by weird little people that run rather than drive.\n\nAs I mentioned weapons now depend entirely on the character selected, so Twister has a whirling spin attack, MawMaw uses his tongue to grab and occasionally swallow his opponent, Beatbox a sonic boom and Mesme has a hypnotic grab. Each character also has a secondary special attack which is used for further on-track bullying such as plasma punches, lethal yo-yos and fireball farts.\n\nGame environments include kitchens, workshops, bathrooms, toyrooms, science labs, the greenhouse and out into the garden to race over the flowerbeds and into the ponds. You can even take part in a race over the bodywork of a motor car. Watch those windscreen wipers though!&quot;\n\nFrom absolute-playstation.com\n\nNote: I have used 7zip to compress it as this is the best compressor imho, it's free too!","torrent":{"xt":"urn:btih:2f6ad4c59a8fc7e6599a59ae6784dff24c6b8783","amp;dn":"Micro_Maniacs_PAL_PSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f6ad4c59a8fc7e6599a59ae6784dff24c6b8783","infoHashBuffer":{"type":"Buffer","data":[47,106,212,197,154,143,199,230,89,154,89,174,103,132,223,242,76,107,135,131]},"announce":[],"urlList":[]}}