{"title":"Alex Jones Show - 2014 June 27 FR [sebaygo1]","uid":10442766,"size":62673932,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3014b8c4d25d4bd6d9156e5b4c993a889d8c1ef3&amp;dn=Alex+Jones+Show+-+2014+June+27+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":10,"time":1403916417,"description":"\nThe Alex Jones Show \nFriday, 27 June 2014\n\n\n[sebaygo1]\n\n\nShow Description\n................\nFrom the Infowars web site :: On this Friday, June 27 edition of The Alex Jones Show, Infowars Nightly News anchor, David Knight, covers the ongoing police state assault on America, the prospect of U.S. combat troops sent to Iraq and the ISIS propaganda offensive designed to exaggerate the terror threat. \n\nPrison Planet.com editor and journalist, Paul Joseph Watson, joins David to break down the top news stories. \n\nInfowars Nightly News host Rob Dew and correspondent Staff Sergeant Joe Biggs report on the border situation from El Paso, Texas. \n\nDavid talks with Peter Breggin about the dangers of pharmaceutical drugs and their relationship to mass shootings. David and Breggin also talk about the Pentagon's effort to lobotomize U.S. soldiers and DARPA's research into brain implants. Mr. Breggin is psychiatrist and critic of biological psychiatry and psychiatric medication. His books include Toxic Psychiatry, Talking Back to Prozac, Talking Back to Ritalin and Brain-Disabling Treatments in Psychiatry. \n\nOn today's broadcast, Alex breaks down Prometheus 2, a film with messages about the elite attaining godhood and their professed destiny for the stars.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:3014b8c4d25d4bd6d9156e5b4c993a889d8c1ef3","amp;dn":"Alex+Jones+Show+-+2014+June+27+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3014b8c4d25d4bd6d9156e5b4c993a889d8c1ef3","infoHashBuffer":{"type":"Buffer","data":[48,20,184,196,210,93,75,214,217,21,110,91,76,153,58,136,157,140,30,243]},"announce":[],"urlList":[]}}