{"title":"Yakusa PS 2","uid":4588042,"size":4468178944,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:36a5e62c318a7c0f6d394f75018191ad3e118b12&amp;dn=Yakusa+PS+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"macf81","files":1,"time":1229712860,"description":"Released in Japan last year as Ryuu ga Gotoku, the game lets you loose on the streets of Tokyo in control of Kiryu Kazuma, a sharp suited Yakuza member recently released after spending 10 years inside for murder.\n\nUnfortunately Kiryu is only allowed to savour a few moments of freedom before he's embroiled in a mystery involving 10 billion missing Yen and the disappearance of a girl called Haruka. He must use his fists and wits while negotiating the murky Japanese underworld to solve the mystery and save the girl.\n\nDeveloped by in an in-house Sega team, Yakuza uses a specially designed combat system that allows gamers to chain combos together while also using the surrounding environment to inflict damage; Kiryu can smash opponents into walls, throw them into tables or pick up objects and wrap them round thugs' heads.\n\nThere's also a strong RPG element with Kiryu roaming the streets making contacts and gathering information, and he can constantly upgrade and develop his skills and attributes\n\n\nSegundo os produtores, &quot;Yakuza&quot; serÃƒÂ¡ um drama humano, com um enredo mais adulto. O protagonista ÃƒÂ© Kazuma Kiryu, um sangÃƒÂ¼inÃƒÂ¡rio membro de um grupo da mÃƒÂ¡fia japonesa, a yakuza. Ele farÃƒÂ¡ par com Haruka, uma misteriosa garota que possui o segredo de uma fortuna de dez bilhÃƒÂµes de ienes. Ainda segundo os criadores, serÃƒÂ¡ uma histÃƒÂ³ria de intrigas, traiÃƒÂ§ÃƒÂµes, ganÃƒÂ¢ncia e todo o tipo de sentimento humano, como um filme noir japonÃƒÂªs.\n\nO cenÃƒÂ¡rio serÃƒÂ¡ a cidade fictÃƒÂ­cia de Kamuro, um tÃƒÂ­pico bairro que &quot;nunca dorme&quot;. Ali, haverÃƒÂ¡ todo tipo de diversÃƒÂ£o e estabelecimentos, dos mais inocentes atÃƒÂ© os proibidos. Entre lojas de conveniÃƒÂªncia e restaurantes, terÃƒÂ¡ prostÃƒÂ­bulos e casas restritas, que sÃƒÂ³ entra quem tiver a senha.\n\nO produtor serÃƒÂ¡ Toshihiro Nagoshi, criador tambÃƒÂ©m de 'F-Zero GX&quot; para GameCube. &quot;Yakuza&quot; terÃƒÂ¡ participaÃƒÂ§ÃƒÂ£o de artistas famosos, que trabalharÃƒÂ£o no roteiro e nas dublagens. AtÃƒÂ© um tatuador foi contratado para criar artes corporais originais para cada personagens.\n\nComo um legÃƒÂ­timo malvadÃƒÂ£o, o protagonista serÃƒÂ¡ bom de briga. Mas a Sega declarou que qualquer jogador poderÃƒÂ¡ se divertir nos combates, que terÃƒÂ£o controles simples e variedade de golpes. Entre socos e chutes, o personagem ainda poderÃƒÂ¡ agarrar ou bater com armas improvisadas, como paus e engradados.\n\n&quot;Yakuza&quot; ÃƒÂ© um jogo exclusivo de PlayStation 2.","torrent":{"xt":"urn:btih:36a5e62c318a7c0f6d394f75018191ad3e118b12","amp;dn":"Yakusa+PS+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36a5e62c318a7c0f6d394f75018191ad3e118b12","infoHashBuffer":{"type":"Buffer","data":[54,165,230,44,49,138,124,15,109,57,79,117,1,129,145,173,62,17,139,18]},"announce":[],"urlList":[]}}