{"title":"The world of tattooing {Henk Schiffmacher} = 2Lions Team =","uid":4898317,"size":2635005387,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:36fd7ec0927fc111d6bbb59776aa0d1307b444df&amp;dn=The+world+of+tattooing+%7BHenk+Schiffmacher%7D+%3D+2Lions+Team+%3D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vermeulen","files":-1,"time":1242474484,"description":"The world of tattooing\n\n\n\n\n\nIn de wereld van de tatoeages is Henk Schiffmacher zeker geen onbekende. Henk is in 1952 in Harderwijk geboren hoewel je dat niet meer aan zijn accent zou kunnen zeggen. Hij klinkt als een rasechte Amsterdammer. Hij woont en werkt daar nu dan ook.\nHij werd bekend onder de naam Hanky Panky en zette de mooiste tatoeages waarvan sommige echte kunstwerken zijn. Vele beroemdheden heeft Henk dan ook al voorzien van tatoeages (Anouk, Patty Brard, Marilyn Manson, Herman Brood, Van Halen, Ozzy Osbourne etc.) Het is ook Henk die de kunst van de tatoeages uit het slop heeft gehaald.\nIn deze vrij korte documentaire neemt hij ons mee op een reis over de wereld: Borneo, Nieuw Zeeland, HawaÃƒÂ¯, Samoa en Japan zijn maar een paar van de landen die hij bezoekt. Hij laat de kunst van het oude tatoeÃƒÂ«ren zien waarbij de inkt door middel van een stokje met een scherp voorwerp (mesje, naaldje) in de huid getikt wordt.\nVan vele tatoeages krijgen we de betekenissen te zien. In Europa werden de tatoeages vooral aangebracht bij zeelui ter herkenning, na bijvoorbeeld verdrinking. Maar over deze vorm van tatoeages gaat het hier niet. Veelal werden/worden de tatoeages aangebracht om religieuze redenen of bescherming. \n\nIn vogelvlucht worden er diverse volkeren bezocht die de tatoeages op de originele manier toebrengt. Wat ik enorm jammer vind is dat alles in een razend tempo over het beeld dendert terwijl ik toch graag nog meer achtergrondinformatie zou willen hebben over deze volkeren. Wat ik wel heel knap vind is dat Henk bij elk volk een traditionele tatoeages neemt, hoe pijnlijk sommige ook zijn.\n\n\nEnglish\nIn the world of the tatoeages Henk Schiffmacher is not certain a foreigner. Henk is born in 1952 in Harderwijk although you can that no more on his accent say. He sounds like a breed real Amsterdammian. He lives and works there now then also.\nHe was known under The name Hanky Panky put and the nicest tatoeages from which certain real Piece of arts are. Many celebrities has Henk then even though provide with Tatoeages (Anouk, Patty Brard, Marilyn Manson, Herman Loaf, Of Get, Ozzy Osbourne etc.) It Henk is also that the art of the tatoeages from it Slum has got.\nIn this free short documentary he takes along our A trip over the world: Borneo, New Zealand, Hawai, Samoa and Japan His but a couple of of the countries visits that he. He allows the art of Call old man tatoeeren see whereby the ink by means of a wand with A sharp thing (knife, pin) in the skin is patted.\nFrom many tatoeages we receive to see the significances. In Europe the tatoeages were Especially reported to marine lazy to recognition, after for example Verdrinking. But this form of tatoeages do not passes it here. For the greater part Were/are introduced the tatoeages to religious reasons or Protection.\n\nIn bird flight various peoples are visited there that the tatoeages on the Original way gives. What I vastly regrettably find is that everything in A frantic speed over the picture dendert while I nevertheless with pleasure still more Background information would have over wanted these peoples. What I well Quite pretty found is that Henk in each people a traditional tatoeages takes, How painful certain also be.\n\n\n\nProducent  \t Video/Film Express\nSpeelduur \t46.56 minuten \nSoort DVD \tDVD-5\nAspect Ratio \tFullscreen 1.33:1 (4x3)\nAudiospoor \tEngels / Nederlands DD2.0 stereo\nOndertitels \tNederlands (optioneel)\nFeatures \tGeen\nHoofdrollen \tHenk Schiffmacher\nRegisseur \tOnbekend\nCover           Geen\nGenre \t        Documentaire\n\nDit is alleen de pal uitgave !!\n\n\n\n******************************************\n\nBrought to you by\nVermeulen.GmBh\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n     &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************","torrent":{"xt":"urn:btih:36fd7ec0927fc111d6bbb59776aa0d1307b444df","amp;dn":"The+world+of+tattooing+%7BHenk+Schiffmacher%7D+%3D+2Lions+Team+%3D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36fd7ec0927fc111d6bbb59776aa0d1307b444df","infoHashBuffer":{"type":"Buffer","data":[54,253,126,192,146,127,193,17,214,187,181,151,118,170,13,19,7,180,68,223]},"announce":[],"urlList":[]}}