{"title":"The Ed Schultz Show - March 30 2011","uid":6283529,"size":82344459,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3c01716904b07a25c052cada8c32109a3b7e6870&amp;dn=The+Ed+Schultz+Show+-+March+30+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DBaum23","files":3,"time":1301530385,"description":"Wednesday, March 30, 2011\n\nEd Schultz broadcasts the radio show from 30 Rock in New York City.\n\nLeo Gerard, President of United Steelworkers International joins the 1st hour of Wednesday's show to discuss his trip to London where 500,000 people were protesting in the streets against government cuts.\n\nJohn Nichols, Washington correspondent for The Nation, joins the 2nd hour of Wednesday's show to give us an update from Wisconsin.\n\nAdmiral Joe Sestak joins the 3rd hour of Wednesday's show to discuss the debate over whether to arm Libyan rebels.\n\nWisconsin State Senator Lena Taylor, D-WI, joins the 3rd hour of Wednesday's show to discuss Wisconsin State Majority Leader Scott Fitzgerald's, R-WI, attempts to fend off recall efforts.\n\nAn Ohio bill that would limit collective bargaining rights for 350,000 public workers will be voted on before the Republican-controlled House on Wednesday. We'll bring you the latest.\n\nThe Obama Administration is engaged in a fierce debate over whether to supply weapons to the rebels in Libya. We'll talk about it.\n\nRepublicans in the U.S. House of Representatives voted to kill President Barack Obama's signature program to help struggling homeowners avoid foreclosure. We'll give you the details.","torrent":{"xt":"urn:btih:3c01716904b07a25c052cada8c32109a3b7e6870","amp;dn":"The+Ed+Schultz+Show+-+March+30+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c01716904b07a25c052cada8c32109a3b7e6870","infoHashBuffer":{"type":"Buffer","data":[60,1,113,105,4,176,122,37,192,82,202,218,140,50,16,154,59,126,104,112]},"announce":[],"urlList":[]}}