{"title":"Red Hot Chili Peppers - Californication","uid":4571403,"size":186916868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3d1f46c9570a231ac27cd4e3d9c11770ebb0380f&amp;dn=Red+Hot+Chili+Peppers+-+Californication&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1229071131,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Californication&quot; is the Red Hot Chili Peppers' fourth single from their seventh studio album, Californication. Released in 2000, the song reached #69 on the Billboard Hot 100 in the USA, and #16 on the UK charts, and hit #1 on both US Modern Tracks and US Mainstream Rock Tracks. It is notable for its sparse combination of guitar and bass notes in the main riff which losely resembles the song &quot;Elevation&quot; off of &quot;Marquee Moon&quot; by Television. It is also remembered for its unique music video, and has become somewhat of an anthem at their live shows.\n\nCalifornication is a unique video in that it takes the form of a video game from the point of view of the player. The video itself bears resemblance to many games, including Tomb Raider, Grand Theft Auto, Crazy Taxi, Panzer Dragoon, SSX, Resident Evil, Tony Hawk's Pro Skater, and the railcar level of Donkey Kong 64.\n\nGuitarist John Frusciante starts off on the Hollywood Walk of Fame. He bumps into a celebrity, and jumps over three Religious Members (Hence the &quot;steal your mind's elation&quot; lyric) , then picks up an asterisk. The action pauses and cuts to a shot of the band playing on top of a hill for a few seconds. This happens each time a band member picks up an asterisk, which is the logo of the band.\n\nChad Smith, the Chili Peppers' drummer, is seen snowboarding down Mount Tahoe (although he has never ridden a snowboard in real life). He falls into a ravine, but lands on a train.\n\nLead singer Anthony Kiedis starts off swimming in an ocean off the Channel Islands, passing sharks and swimmers and picks up an asterisk. He gets out riding a shark and lands in his car. The registration plate on the car says &quot;GERMS&quot;, which is a reference to The Germs, the band that Kiedis listened to as he grew up.\n\nFlea, the bassist, is seen in Muir Woods, and is about to pick up an asterisk, but he can't get past a bear guarding it, although he helps it out by kicking down a hunter about to shoot it. He goes on a mine-cart ride, and goes to another asterisk, but it's guarded by a pregnant teen (Dani of Dani California and By the Way, also mentioned in this song as &quot;getting high on information&quot;). He then gets surrounded by a horde of lumberjacks, but he jumps on top of a tree and sees all the other trees fall.\n\nMeanwhile, John goes to a movie set, and ducks and weaves through a sci-fi film, a porno, and stops in a set apparently filming a biographical film about Leonardo da Vinci (John has an interest in da Vinci and his works). He sees a theorized flying machine being used.\n\nChad is meanwhile seen snowboarding on the Golden Gate Bridge, using it as a grind rail.\n\nAnthony is in the same scene, driving around San Francisco. He drives underwater, and then jumps through the hole of a giant doughnut (A reference to Randy's Donuts shop in LA) His car falls off a cliff and he lands on a giant dragonfly, being harnessed by Flea, who rides it to the sky, where John is riding the da Vinci flying machine, and Chad is doing snowboarding tricks. Anthony eventually falls off, and lands in a poppy field, and the flowers grow huge, but he finds an asterisk.\n\nMuch later, there is a big earthquake, and a city is falling apart. All the band members narrowly escape death from falling buildings and car crashes. Flea falls through an asterisk while falling to the center of the Earth. The video ends with all the band members falling into the center of the earth, finding a cube, touching it, and turning from computer graphics to real people. There is then a caption stating &quot;Game Over&quot; followed by a message, &quot;Next Game?&quot; with a &quot;Yes&quot; or &quot;No&quot; option.\n\nThe video is directed by the prolific husband-wife directorial team Jonathan Dayton and Valerie Faris.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3d1f46c9570a231ac27cd4e3d9c11770ebb0380f","amp;dn":"Red+Hot+Chili+Peppers+-+Californication","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d1f46c9570a231ac27cd4e3d9c11770ebb0380f","infoHashBuffer":{"type":"Buffer","data":[61,31,70,201,87,10,35,26,194,124,212,227,217,193,23,112,235,176,56,15]},"announce":[],"urlList":[]}}