{"title":"Heart of Darkness Disc 1 PSX-PSP EBOOT","uid":4518922,"size":397601265,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3de58dc56012063d25e8f3f53be76c4c136ae5a6&amp;dn=Heart+of+Darkness+Disc+1+PSX-PSP+EBOOT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"teargrants15","files":1,"time":1227086338,"description":"The game follows Andy, who is a regular child that hates his teacher, loves his dog Whiskey, and is afraid of the dark. One day, Andy and Whiskey head for the park. A solar eclipse occurs while they're there. During the eclipse, Whiskey is taken away by an unseen creature. Andy then rushes to his treehouse, where he keeps his inventions, and jumps inside a spaceship to find Whiskey. He takes off and finds himself in the Darklands, which is a portion of the Heart of Darkness. Inhabited by creatures of the night and ruled over by an evil sorcerer that's known as the Master of Darkness, the Darklands are extremely dangerous. Andy must find it in himself in order to rescue Whiskey and find a way home.\n\n------------------------------------------------------------------------------------\n\n\nHeart of Darkness took six years to develop. These years were spent creating the game's musical score, the graphics, and the FMV sequences. There was a bidding war to distribute the game which Interplay won. Other companies that bidded were Sega and Atari. Atari had plans to put the game on the Atari Jaguar CD instead of the Playstation.\n\nThe game was released to generally good reviews. The most common complaint was the short length of the game. However, the game managed to sell a million and a half copies.\n\n------------------------------------------------------------------------------------\n\nThis is Heart of Darkness, converted properly. This is an EBOOT file.\nWorking fine on my 3.90 m33-3. All I need are seeders. Please help me!\n\nEnjoy!\n\n-----------------------------------------------------------------------------------\n\nPlease take note that this is only DISC 1 of the game. Disc 2 will follow.\n\n","torrent":{"xt":"urn:btih:3de58dc56012063d25e8f3f53be76c4c136ae5a6","amp;dn":"Heart+of+Darkness+Disc+1+PSX-PSP+EBOOT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de58dc56012063d25e8f3f53be76c4c136ae5a6","infoHashBuffer":{"type":"Buffer","data":[61,229,141,197,96,18,6,61,37,232,243,245,59,231,108,76,19,106,229,166]},"announce":[],"urlList":[]}}