{"title":"Ok Go - Here It Goes Again  (2nafish)","uid":5367821,"size":113537028,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3edde94087e882c0749b590d8b51a0377fdfa221&amp;dn=Ok+Go+-+Here+It+Goes+Again++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1266325860,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Here It Goes Again&quot; is a alternative rock song by OK Go, and is the third released single (the fifth including radio-only singles) from the album Oh No. It also appears on the compilation album Now 23. It remains the band's only single to chart on the Billboard Hot 100, where it entered the Top 40 at #38, mostly due to the music video. Featuring the band dancing on treadmills, the video became a staple onit is one of the most watched videos, with over 49 million views. In addition, the single peaked at #36 in the UK Singles Chart on October 1, 2006, hence marking their second UK Top 40 single and their third UK Top 75 single.\n\nIts sole b-side, &quot;The Lovecats&quot;, a cover of The Cure's hit single was previously released on the band's Do What You Want EP and the single &quot;A Million Ways&quot;. An alternate version was nicknamed &quot;UK Surf&quot;.\n\nThe music video of the song - which was arguably responsible for the song's U.S. Top 40 success - is an elaborate performance of the band dancing on treadmills in a single continuous take. Choreographed by Trish Sie and directed by Sie and the band, it took a total of seventeen attempts to complete the video. As in the band's video for &quot;A Million Ways&quot;, Tim Nordwind lip-syncs the lead vocals instead of Damian Kulash, following the format from the dance choreographed for the song &quot;C-C-C-Cinnamon Lips&quot;, which Tim sings. The video debuted onon July 31, 2006 and, as of November, 2009, has been viewed over 48 million times. It premiered on VH1's Top 20 Countdown that same day. OK Go performed the dance routine live at the 2006 MTV Video Music Awards.\n\nThe music video won the 2007 Grammy Award for Best Short Form Music Video and the 2006awards for Most Creative Video.\n\nOh No is the second studio album by Chicago rock band OK Go. It was released 30 August 2005. The album was recorded in late 2004 with producer Tore Johansson in MalmÃƒÂ¶, Sweden. It is the final album to feature guitarist Andy Duncan, who left shortly after recording finished.\n\nAs of January 12, 2007, the album has sold 198,045 units.\n\nAfter the band's performance at the 2006 MTV Video Music Awards, their album moved up to #2 on the iTunes Music Store album sales charts (as of September 3, 2006). Their album sold 8,250 units in the following week, a 95% increase over the prior week, rocketing from #87 to #69 on the Billboard 200 album chart, the highest position ever achieved by any OK Go album to date.\n\nOn November 7, 2006, OK Go released a deluxe limited edition CD/DVD of the album. The DVD contains their videos (dancing and playing instruments), a video from 180 fans doing the &quot; A Million Ways&quot; dance for acontest, previously unseen footage, and a behind-the-scenes look of their treadmill rehearsals for the video and for the VMA's.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3edde94087e882c0749b590d8b51a0377fdfa221","amp;dn":"Ok+Go+-+Here+It+Goes+Again++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3edde94087e882c0749b590d8b51a0377fdfa221","infoHashBuffer":{"type":"Buffer","data":[62,221,233,64,135,232,130,192,116,155,89,13,139,81,160,55,127,223,162,33]},"announce":[],"urlList":[]}}