{"title":"(PSX-PSP) The Legend of Dragoon converted properly by KloWn","uid":4477963,"size":1485008718,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:43226fa2ce52448a40dc893989d9525476ba2e61&amp;dn=%28PSX-PSP%29+The+Legend+of+Dragoon+converted+properly+by+KloWn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"toxicjuggalo","files":6,"time":1225427616,"description":"The Legend of Dragoon starts out the same way as many other RPGs. The spiky-haired Dart already has one vendetta against the mysterious Black Devil, who killed his father, but it&amp;#039;s time he had another. For unknown reasons, the Sandora Empire burns down his village and imprisons his childhood friend, Shena. Infuriated, Dart impulsively storms out to rescue Shena. Shena&amp;#039;s kidnapping is merely the tip of the iceberg of a much grander, more sinister motive. During his globe-spanning quest, Dart is transformed into a Dragoon, a warrior cloaked with the power of the Dragon of Fire. To defeat the Sandora Empire, Dart will have to find the other six Dragon Spirits and people to use them so the Legend of Dragoon may be fulfilled. Along the way, the magical septet will learn about one another, accrue additional vendettas, and save the world.\n\n\nI have also included the latest popsplugin and ALL sony prx which are required to play psx-psp conversions on custom firmware&amp;#039;s... To install the pops simply copy the seplugins folder to the root of your memory stick, turn off your psp, hold down the right trigger button while turning the psp back on to go into recovery mode..Select the plugins option and enable the pops...Everytime you start a new psx game it will ask you which pops you wish to use I recommend using 3.40 pops as I have personally have had no problems with ANY psx game so far.....Drag and drop the folder of the game you wish to play to the PSP--&gt;GAME folder on your memory stick and away you go..ENJOY and don&amp;#039;t forget to say thanx..... KloWn\n\n\n","torrent":{"xt":"urn:btih:43226fa2ce52448a40dc893989d9525476ba2e61","amp;dn":"%28PSX-PSP%29+The+Legend+of+Dragoon+converted+properly+by+KloWn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43226fa2ce52448a40dc893989d9525476ba2e61","infoHashBuffer":{"type":"Buffer","data":[67,34,111,162,206,82,68,138,64,220,137,57,137,217,82,84,118,186,46,97]},"announce":[],"urlList":[]}}