{"title":"Stratovarius - Infinite (2000) WMA320","uid":6177547,"size":196151890,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:43f76cde80caf779b793f886daf85817e50d6945&amp;dn=Stratovarius+-+Infinite+%282000%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297823611,"description":"Infinite is Stratovarius' eight album and my prediction is that fans of their earlier works will not be disappointed, this album has all the classic elements and still manages to sound inspiring.\n\nThe catchy Hunting High And Low is a great opener, filled with fantastic rhythm guitar parts, harmonious vocals and a bright shining drive. Millennium is the fastest song on the album, intense drumming and a striking guitar solo being real treats.\nFreedom is another direct track with a wonderful and immensely captivating key melody, the chorus makes it easy to get in a good mood, and I think this song is a splendid example of how to combine heaviness with lighter and melodic elements. The fast guitar/key duelling solo spot being spellbinding as well.\n\nPhoenix is a mid-tempo creation with some intelligent rhythm changes, tight bass lines and heavy riffs, all packed into a quite complex structure.\n\nA Million Light Years Away comes forth with a hard hitting rhythm and a soaring key melody.\nA special tense refrain binds the different parts nicely together and the guitar solo has a cool innovative vibe.\n\nMy favourite track is the extensive title song, dealing with the important theme of greed, ignorance and lust for power, serving as a general warning for the future. \nThe dramatic and grand atmosphere is amazingly brought to life through marvellous orchestrations.\nThe drumming is over the top genius and highly technical and overall all things just melt together into a huge musical expression. In the league of best Stratovarius songs ever, that's for sure.\n\nCelestial Dream is a short but very interesting song; built upon a soaring symphonic and orchestral setting. It's an ingenious and very positive track where Kotipelto unfolds some impressive and illuminating vocal qualities.\n\nLyrically the album is dealing with typical Stratovarius topics like war, injustice and personal struggles but also brighter feelings of hope, love, happiness and a wish for a better world. All in all fitting and well done.\n\nHere's a broad summing up of the band performance:\nJÃƒÂ¶rg Michael's detailed and very powerful drumming is once again a pleasure to listen to, filled with a great powerful dynamic. \nThe vocals are very balanced and add lots of melody to the songs and the keyboard creates many atmospheric and captivating passages.\nThe bass is very powerful and interacts very well with the drums and the guitar work from Timo Tolkki is as always fast, detailed and with tons of great riffs.\n\nA couple of songs have elements that keep them in a lower league than the above mentioned ones. Mother Gaia becomes a bit too slow and monotone at times, at least for my taste. This is still a good song overall though, the mellow key atmosphere and catchy guitar solo are fantastic. \nGlory Of The World offers a more direct approach, the bombastic chorus is quite good and the key arrangements and solo skilfully played and highly interesting. Anyway the verse part lacks more excitement and overall I miss something highly memorable.\n\nI think that the production is brilliant and well suited the musical direction, having a crystal clear touch without losing depth and strength.\n\nThe band offers technical Power Metal on a high level of composition and execution, this one has a great bunch of fantastic and immensely melodic songs.\n\nby Tommy \n\nTRACKLIST:\n\n01 - Hunting High And Low.wma                                        \n02 - Millennium.wma                                                  \n03 - Mother Gaia.wma                                                 \n04 - Phoenix.wma                                                     \n05 - Glory Of The World.wma                                          \n06 - A Million Light Years Away.wma                                  \n07 - Freedom.wma                                                     \n08 - Infinity.wma                                                    \n09 - Celestial Dream.wma                                             \n10 - Hunting High And Low (Single Edit).wma                          \n11 - Neon Light Child.wma                                            \n12 - Hunting High And Low (Demo Version).wma                         \n13 - Millennium (Demo Version).wma \n\nWMA 320Kbps 44100Hz STEREO\n\nMARCELODRGZ","torrent":{"xt":"urn:btih:43f76cde80caf779b793f886daf85817e50d6945","amp;dn":"Stratovarius+-+Infinite+%282000%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f76cde80caf779b793f886daf85817e50d6945","infoHashBuffer":{"type":"Buffer","data":[67,247,108,222,128,202,247,121,183,147,248,134,218,248,88,23,229,13,105,69]},"announce":[],"urlList":[]}}