{"title":"STARGATE.SG-1.S07E19-22.SWESUB. -Lindoff.ISO","uid":5817865,"size":4452673536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4440890ec5fd375687b047911861da0052c64ebe&amp;dn=STARGATE.SG-1.S07E19-22.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1283933769,"description":"Season 7, Episode 19: Resurrection\n\n\nAgent Barrett of the NID calls SG-1 to Los Angeles for a consult on a mass \n\nmurdering of a rogue sleeper cell by a young woman. There they find many Goa'uld \n\nartifacts relating to Sekhmet, a subordinate of Ra. But how this operation is \n\nrelated to the Goa'uld eludes SG-1.\n\t\n\n\nSeason 7, Episode 20: Inauguration\n\nThe newly inaugurated President of the United States is briefed by the Head of the \n\nJoint Chiefs of Staff on the Stargate program. Former Senator, now Vice President, \n\nKinsey attempts to get his running mate to back his policies for the program, but \n\nthe president decides to look into the situation himself. Kinsey gets Richard \n\nWoolsey to convince the president of his agenda.\n\t\n\n\nSeason 7, Episode 21: Lost City: Part 1\n\nVice President Kinsey briefs Dr. Weir on the Stargate program before her meeting \n\nwith the president. SG teams 1, 3, and 5 go off-world to attempt the extraction of \n\na newly found Ancient repository device. Upon arriving at the location of the \n\ndevice, SG-1 comes under fire from Goa'uld ships. With no other way to disallow \n\nAnubis from claiming the knowledge for himself, Jack submits himself to the \n\ndangerous device.\n\t\n\n\nSeason 7, Episode 22: Lost City: Part 2\n\nWith Jack having the knowledge of the Ancient repository once again in his mind, \n\nhe and Daniel attempt to unearth the location of the lost city of the Ancients. \n\nBra'tac, bringing with him the news of an impending attack on the Tau'ri by \n\nAnubis, takes Teal'c to help him acquire ships and warriors for the defense of \n\nEarth. Dr. Weir attempts to cope with the overwhelming nature of her new job, \n\nwhile also dealing with the unrelenting ego of Vice President Kinsey.\n","torrent":{"xt":"urn:btih:4440890ec5fd375687b047911861da0052c64ebe","amp;dn":"STARGATE.SG-1.S07E19-22.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4440890ec5fd375687b047911861da0052c64ebe","infoHashBuffer":{"type":"Buffer","data":[68,64,137,14,197,253,55,86,135,176,71,145,24,97,218,0,82,198,78,190]},"announce":[],"urlList":[]}}