{"title":"ImTOO Video Converter Ultimate 6.5.2.0214 + Serial-[HB]","uid":6177806,"size":30785727,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4acc4cec5374dea6a2351523bbf495b5f24f7b42&amp;dn=ImTOO+Video+Converter+Ultimate+6.5.2.0214+%2B+Serial-%5BHB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"[HB]","files":-1,"time":1297834169,"description":"+-------------------------------------------------------+\n|ImTOO Video Converter Ultimate 6.5.2.0214 + Serial-[HB]|\n+-------------------------------------------------------+\n\nImTOO Video Converter Ultimate is best video converter program that can easily and quickly convert between HD videos like H.264/MPEG-4 AVC, AVCHD (*.m2ts, *.mts), MKV, HD WMV, MPEG2/MPEG-4 TS HD Video, convert videos from HD to SD, convert general video formats such as AVI, MPEG-4, WMV, DivX, H.264/AVC from one to another, extract audio file or pictures from video, and even create video from pictures.\n\n+------------+\n|Key Features|\n+------------+\n\n- Newly support iPad and Google Android phones: Nexus One, HTC Hero, HTC G2 Magic, HTC Tattoo, Motorola Droid, Motorola CLIQ, Samsung i7500\n- Allows you to transfer the converted files to iPod, iPhone or PSP directly after conversion.\n- Supports multi-core CPU processing to perform tasks with the highest speed possible; core number can be customized accordingly.\n- Add multiple audio tracks and subtitle files (ASS, SSA and SRT) to enrich your videos.\n- Crop the image frame of your video to retain what you want.\n- Adjust the brightness/saturation/contrast of your videos, and add artistic effects like &quot;Old Film&quot;, &quot;Gray&quot;, &quot;Line Drawing&quot;, etc.\n- Insert video/picture/text watermarks to your videos to mark them as your own.\n- Preview a video with different effects applied or compare the original video with the edited version in real-time. \n- Comes with optimized conversion profiles classified by device type so you can easily find the most suitable conversion solution for your device.\n- Split a large file into several smaller ones according to split duration or size. \n- Set different output formats for the same file and converted it into various formats in one go.\n- Specify the output file size and calculate the corresponding bit rate in an instant with the built-in Bitrate Calculator.\n- Offers a range of adjustable parameters: video, audio, picture, tag and expert.\n- Convert multiple files simultaneously with multithreading and batch processing.\n- Run the application in the background to free up CPU resources for running other applications.\n- Preset a post conversion action and the application will automatically perform the desired action after completing a task: shut down, hibernation, stand by; exit application\n- Rename files in batches; view file properties; automatic software update checking; multiple language interfaces and skins to choose from.\n\n+-------------------------+\n|Input File Format Support|\n+-------------------------+\n\nVideo: AVI, MPEG, WMV, MP4, FLV, MKV, H.264/MPEG-4, DivX, XviD, MOV, M4V, VOB, ASF, 3GP, 3G2, SWF, H.261, H.264, DV, DIF, MJPG, MJPEG, DVR-MS, NUT, QT, YUV, DAT, MPV, NSV\nAVCHD Video (*.mts, *.m2ts), H.264/MPEG-4 AVC (*.mp4), MPEG2 HD Video (*.mpg; *.mpeg), MPEG-4 TS HD Video (*.ts), MPEG-2 TS HD Video (*.ts), Quick Time HD Video (*.mov), WMV HD Video (*.xwmv), Audio-Video Interleaved HD Video (*.avi)\nAudio: MP3, WMA, AAC, WAV, CDA, OGG, FLAC, APE, CUE, M4A, RA, RAM, AC3, MP2, AIFF, AU, MPA, SUN AU Format\nImage: BMP, GIF, JPEG, PNG\n\n+--------------------------+\n|Output File Format Support|\n+--------------------------+\n\nVideo: AVI, MPEG, WMV, MP4, FLV, H.264/MPEG-4, DivX, XviD, MOV, RM, ASF, 3GP, 3G2, SWF, VOB, TS, DV H.264/MPEG-4 AVC (*.mp4), MPEG2 HD Video (*.mpg; *.mpeg), MPEG-4 TS HD Video (*.ts), MPEG-2 TS HD Video (*.ts), Quick Time HD Video (*.mov), WMV HD Video (*.wmv), Audio-Video Interleaved HD Video (*.avi)\nAudio: MP3, WMA, AAC, WAV, OGG, FLAC, APE, M4A, RA, AC3, MP2, AIFF, AMR, SUN AU Format\nImage: BMP, GIF, JPEG, PNG\n\n+---------------------+\n|Output Device Support|\n+---------------------+\n\n- iPod, iPod nano, iPod classic, iPod shuffle, iPod touch\n- iPhone, iPhone 3G, Apple TV\n- PSP, PS3\n- Xbox, Xbox 360\n- General 3GP mobile phone, BlackBerry, etc.\n- General MP4 players: Archos, Creative Zen, iRiver, etc.\n- Window Mobile device: Pocket PC, Dell Axim X51, HP iPaq hw6500 series, etc.\n","torrent":{"xt":"urn:btih:4acc4cec5374dea6a2351523bbf495b5f24f7b42","amp;dn":"ImTOO+Video+Converter+Ultimate+6.5.2.0214+%2B+Serial-%5BHB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4acc4cec5374dea6a2351523bbf495b5f24f7b42","infoHashBuffer":{"type":"Buffer","data":[74,204,76,236,83,116,222,166,162,53,21,35,187,244,149,181,242,79,123,66]},"announce":[],"urlList":[]}}