{"title":"Democracy Now - 18 nov 2010","uid":5965324,"size":454762939,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4ea62f2460159b97e11ee95aeb37bf5469f14384&amp;dn=Democracy+Now+-+18+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1290097540,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 18, 2010\n\n- Gitmo Prisoner Acquitted of All But One Charge in Embassy Bombings\n- Insurers Gave Chamber Over $86M to Defeat Healthcare Reform\n- Study: Lawmakers' Personal Wealth Increased 16% in 2008\n- FBI Meets With Google, Facebook in Wiretap Push\n- Senate to Vote on Repealing &quot;Don't Ask, Don't Tell&quot;\n- Murkowski Claims Victory in Alaska Senate Race\n- Antiwar Protesters Converge at NATO Summit in Portugal\n- Swedish Prosecutor Seeks Arrest of WikiLeaks Founder\n- FDIC Probes Former Bank Execs\n- Dems Elect Pelosi House Speaker\n- GOP Blocks Paycheck Fairness Act in Senate\n- Palin Hints at 2012 Presidential Bid\n- Patti Smith Wins National Book Award\n\n\nSpecial reports\n\n- Haitians Barricading Streets With Coffins as Protests Against U.N. Continue Over Cholera Outbreak\n\nProtests are continuing in Haiti over the cholera outbreak that has now killed more than 1,100 people and infected some 17,000. On Wednesday, residents in the city of Cap-Haitien clashed with U.N. troops for the third consecutive day. Crowds have taken to the streets expressing anger at the Haitian government and the United Nations for failing to contain the disease. We go to Cap-Haitien to speak with independent journalist Ansel Herz.\n\n\n- As New York Debates Secure Communities Program, Study Challenges Controversial Policy to Deport Immigrant Prisoners\n\nA battle is brewing in New York over the Secure Communities Program, a controversial federal immigration enforcement policy that requires local police to forward fingerprints of every person they arrest to the U.S. Department of Homeland Security. New York Gov. David Paterson has approved a Secure Communities agreement, but is facing heavy opposition. We speak to Aarti Shahani, author of a new study that challenges this policy. She found that for immigrant prisoners arrested on drug charges and detained at Riker's Island prison in New York City, suspects charged with lower-level crimes were selected for deportation more often than those charged with serious felonies. In other words, while the Homeland Security claims to be targeting dangerous criminals for deportation, the study found no correlation between the level of offense committed and being targeted for deportation.\n\n- Student, Prisoner Advocate Tam Phan Faces Deportation Order to Native Vietnam\n\nTam Phan came to the US from Vietnam when he was 6 years old. He later became involved with a gang and spent 17 years in prison. He turned his life around and is now pursuing a masters degree in urban policy and administration at Brooklyn College and is working at the Fortune Society, a nonprofit organization that helps ex-convicts re-enter society.\nBut Tam Phan has been given a final deportation order and his only recourse is a pardon from Governor Paterson.\n\n\n- Punk Rock Legend Patti Smith Wins National Book Award for Memoir &quot;Just Kids&quot;\n\nThe singer-songwriter, poet, artist and punk rock legend Patti Smith has won the National Book award in the non-fiction category for memoir, &quot;Just Kids.&quot; The book tells the story of Smith's coming of age in New York and her lifelong friendship and creative collaboration with the renowned photographer Robert Mapplethorpe.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4ea62f2460159b97e11ee95aeb37bf5469f14384","amp;dn":"Democracy+Now+-+18+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ea62f2460159b97e11ee95aeb37bf5469f14384","infoHashBuffer":{"type":"Buffer","data":[78,166,47,36,96,21,155,151,225,30,233,90,235,55,191,84,105,241,67,132]},"announce":[],"urlList":[]}}