{"title":"Coast.to.Coast.AM.June.23.2009-komie","uid":4975116,"size":56193054,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4fa28c61632488f9e1976b748342948f85ea70d4&amp;dn=Coast.to.Coast.AM.June.23.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":5,"time":1245960685,"description":"Secret Door IX\n\n\n\nDate:\n06-23-09\n\nHost:\nGeorge Noory\n\nGuests:\nMary-Ann Winkowski, William Henry, Catherine Austin Fitts\n\n\nThree surprise guests made their way through the &quot;Secret Door&quot; to speak with George Noory. First up was ghostbuster Mary-Ann Winkowski who talked about how she guides the deceased out of the earthly plane. Most people realize they're dead within 15 minutes of dying, yet if they don't enter the light within 72 hours of their death, the opportunity closes up for them, she explained, adding that her special gift is to re-open the light for these spirits. Interestingly, she noted that pets can become earthbound ghosts and occasionally cause problems. Her own deceased dog messes up pillows. &quot;He's still not allowed on the couch even if he's dead,&quot; she quipped.\n\nInvestigative mythologist William Henry discussed the transformative and symbolic aspects of the U.S. Capitol building. The Apotheosis of Washington, a painting in the rotunda, depicts the first President as a deified being along with five pagan gods who are symbols for alchemy, he detailed. The Capitol's dome, modeled after the one in the Vatican, can be thought of as a stargate or solar temple used to collect the energy of our sun, said Henry. Further, the building of the Capitol was referred to as the rebuilding of Solomon's Temple. Henry will be a presenter, along with such C2C regulars as Linda Moulton Howe, Whitley Streiber, and Jim Marrs, at the Dreamland Festival this coming weekend in Nashville.\n\nLast through the secret door was investment advisor Catherine Austin Fitts. The bailout has created a huge war chest for the banks and functioned as a financial coup d'etat, she declared. Now they're getting ready to &quot;come in for the kill,&quot; she said. July will be a telling month to see whether states such as California can solve their budget deficits, she commented, adding that stockpiling household goods is actually one of the better investments right now. Fitts suggested that a total crash of the economy wouldn't necessarily be a bad thing as it could lead to a change in leadership and the way we do things.\nEd McMahon Tribute\n\nThe first hour featured a tribute to the recently deceased Ed McMahon, with a replay of his 10/19/07 C2C interview.\nWebsite(s):\n# maryannwinkowski.com\n# williamhenry.net\n# financialpermaculture.com\n# solari.com\nVideo(s):\n# The American Rite\n# Morph: The Secret of Light Body Activation\nBook(s):\n# As Alive, So Dead\n# When Ghosts Speak","torrent":{"xt":"urn:btih:4fa28c61632488f9e1976b748342948f85ea70d4","amp;dn":"Coast.to.Coast.AM.June.23.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fa28c61632488f9e1976b748342948f85ea70d4","infoHashBuffer":{"type":"Buffer","data":[79,162,140,97,99,36,136,249,225,151,107,116,131,66,148,143,133,234,112,212]},"announce":[],"urlList":[]}}