{"title":"Death Rally","uid":3691790,"size":12327115,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:521d84924888a77d8f629c555126c1681abf3c59&amp;dn=Death+Rally&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Destinova","files":1,"time":1179614255,"description":"Visually awesome and with great playability, Death rally takes the top-down view racing game genre to a level never experienced before.\n\nYou start out from the bottom of the ranking list, Your objective: earn money in the blitzkrieg-battle races, and fight hard for each precious championship point. Each race can be lethal, and while taking the curves as hard as you can, your fellow competitors are showering you in a constant hail of bullets. While the losers repair their cars and cover those bullet holes, the winner spends his hard earned money on new engines, tires or stronger armor.\n\nShoot your way through screaming bystanders, pick up more ammo and turbo from the side of the track, and floor the pedal while performing some shady deals for The Dealer. No trick is too dirty when you&amp;#039;re preparing for The Final Confrontation; only the hardest armor, the most powerful engine and the biggest guns will see you through the ultimate battle against The Adversary.\n\nAnd when you feel you can&amp;#039;t take it anymore, you can check out the underground market: Spiked bumpers, landmines, rocket fuel or sabotage can provide a way to create some nasty accidents to the competition.\n\nUtilizing a hi-performance 3D-Engine with texture mapping, lighting effects and shadows, Death Rally creates a level of visual impact never seen before in the racing game genre. 100% rendered cars, animated hi-resolution menu system and a great playability make sure that you&amp;#039;ve never had this much fun before.\n\nPlay alone or with friends, Death Rally supports network multiplaying for up to 4 players and serial or modem connection for two players.\n\nA FEW OF THE AWESOME GAME FEATURES\n\n    * 19 different tracks\n    * 6 different cars\n    * Each car is equipped with different weapons\n    * Ugradeable Engines, Tires and Armor\n    * Up to 4 player multiplayer\n    * Over 20 megs of action packed animation\n\nOriginally released September 6, 1996.","torrent":{"xt":"urn:btih:521d84924888a77d8f629c555126c1681abf3c59","amp;dn":"Death+Rally","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"521d84924888a77d8f629c555126c1681abf3c59","infoHashBuffer":{"type":"Buffer","data":[82,29,132,146,72,136,167,125,143,98,156,85,81,38,193,104,26,191,60,89]},"announce":[],"urlList":[]}}