{"title":"Avalanche.Trapped.With.Killer.DVDR.NTSC.Kratos.Premiere.Seeders","uid":4551180,"size":4655540224,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:53c8c88da540b520d7d144c6709c42d2fb87eb4c&amp;dn=Avalanche.Trapped.With.Killer.DVDR.NTSC.Kratos.Premiere.Seeders&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kratos0785","files":1,"time":1228316958,"description":"A policial Leah Sanders (Claudia Michelsen) nunca perseguiu ninguÃƒÂ©m com tanta obsessÃƒÂ£o quanto a Martin Bose (Karl Fritz). Ela estÃƒÂ¡ convencida de que ele ÃƒÂ© o manÃƒÂ­aco que assassinou vÃƒÂ¡rias mulheres, incluindo sua irmÃƒÂ£, e agora conseguiu encontrÃƒÂ¡-lo perto de uma cabana no alto de uma montanha isolada. No momento em que aponta sua arma para ele, a porta da cabana se abre e surge Jan Meinert (Herbert Knaup), um mÃƒÂ©dico que planejou passar ali um fim de semana romÃƒÂ¢ntico com a jovem Maria Sebach (Eva Herzig). Mas antes que Jan consiga entender o que estÃƒÂ¡ acontecendo, um disparo provoca a avalanche. A enorme massa de neve que cai sobre eles aprisiona os quatro na cabana. Algemado, Martin alega que Jan ÃƒÂ© o verdadeiro assassino e que o havia seguido atÃƒÂ© lÃƒÂ¡ para impedir que matasse outra mulher. Leah, que nÃƒÂ£o acredita nele, cava uma saÃƒÂ­da com o mÃƒÂ©dico e saem juntos em busca de ajuda. Ao anoitecer, a oficial Sanders comeÃƒÂ§a a cogitar se nÃƒÂ£o escolheu a companhia do homem errado.\n\nThe police Leah Sanders (Claudia Michelsen) never pursued anyone with as much obsession as the Bose Martin (Fritz Karl). She is convinced that he is the maniac who murdered several women, including his sister, and now managed to find him near a hut on top of a mountain alone. At the time, pointing his weapon at him, the door is open and the cabin is Jan Meinert (Herbert Knaup), a doctor who planned to spend a week there with the young romantic Sebacher Maria (Eva Herzig). But before that Jan can understand what is happening, one shot causes the flood. The huge mass of snow that falls on them imprisons four in the cabin. Handcuffed, Martin argues that Jan is the real killer and that until then had followed to prevent that killed another woman. Leah, who does not believe it, a cava exit to the doctor and leaving together in search of help. By nightfall, the official start to think Sanders is not the company chose the wrong man.","torrent":{"xt":"urn:btih:53c8c88da540b520d7d144c6709c42d2fb87eb4c","amp;dn":"Avalanche.Trapped.With.Killer.DVDR.NTSC.Kratos.Premiere.Seeders","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53c8c88da540b520d7d144c6709c42d2fb87eb4c","infoHashBuffer":{"type":"Buffer","data":[83,200,200,141,165,64,181,32,215,209,68,198,112,156,66,210,251,135,235,76]},"announce":[],"urlList":[]}}