{"title":"Call Of Duty: Modern Warfare 2 PC Spanish Full","uid":5264137,"size":12015087761,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:594297cb607b4abdbf939061ced946c9352e676b&amp;dn=Call+Of+Duty%3A+Modern+Warfare+2+PC+Spanish+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Kratosboy","files":321,"time":1262833055,"description":"Descripcion:\n\nEl juego mÃƒÂ¡s esperado del aÃƒÂ±o y la secuela del juego de acciÃƒÂ³n en primera persona mÃƒÂ¡s vendido de todos los tiempos, Modern WarfareÃ‚Â® 2, continÃƒÂºa ofreciendo una acciÃƒÂ³n trepidante y apasionante en la que los jugadores se enfrentan a una nueva amenaza dedicada a llevar al mundo al borde del colapso. La ÃƒÂºltima entrega de la revolucionaria serie Call of DutyÃ‚Â®, Modern Warfare 2, incluye por primera vez en un videojuego, la mÃƒÂºsica de legendario compositor Hans Zimmer, galardonado con un Oscar, un Golden GlobeÃ‚Â®, un GrammyÃ‚Â® y un premio Tony. El juego se inicia justo despuÃƒÂ©s de los histÃƒÂ³ricos acontecimientos de Call of Duty 4: Modern Warfare, el superventas que se ganÃƒÂ³ el favor de la crÃƒÂ­tica mundial, con 14 millones de copias vendidas en todo el mundo, el reconocimiento como &quot;Videojuego online mÃƒÂ¡s jugado&quot; de la historia segÃƒÂºn el Libro Guinness de los RÃƒÂ©cords en 2009, y mÃƒÂ¡s de 50 premios de Juego del aÃƒÂ±o, incluido el Console Game of the Year (Juego del aÃƒÂ±o para consolas y el Overall Game of the Year (Juego general del aÃƒÂ±o) en 2007 de la Academy of Interactive Arts and SciencesÃ‚Â®.\n\nDescription:\n\nThe most anticipated game of the year and the sequel to the epic first-person shooter best selling of all time, Modern Warfare Ã‚Â® 2, continues to offer exciting and fast paced action in which the players face a new threat dedicated to bringing the world to the brink of collapse. The latest installment in the groundbreaking series Call of Duty Ã‚Â®: Modern Warfare 2, including for the first time in a game, the music of legendary composer Hans Zimmer won an Oscar, a Golden Globe Ã‚Â®, Grammy Ã‚Â® and Tony Award. The game starts just after the historic events of Call of Duty 4: Modern Warfare, the bestseller that won the favor of worldwide criticism, with 14 million copies sold worldwide recognition as a &quot;most played online game &quot;history according to the Guinness Book of Records in 2009, and over 50 Game of the Year awards, including Console Game of the Year (Game of the Year for consoles and the Overall Game of the Year (Overall Game of the Year) in 2007 from the Academy of Interactive Arts and Sciences Ã‚Â®.\n\n\nGenero: Disparo en Primera Persona\nImagen: ISO\nCalidad: DVD\nTamaÃƒÂ±o: 11.19 GB's (Comprimido)\nIdioma: EspaÃƒÂ±ol\nUploader: Kratosboy\n\nGender: First Person Shooter\nImage: ISO\nQuality: DVD\nSize: 11.19 GB's (Compressed)\nLanguage: Spanish\nUploader: Kratosboy\n\nEl Juego esta full en EspaÃƒÂ±ol y viene como todo incluido, de como Jugar el Singleplayer, Multiplayer y el Cooperativo Operaciones Especiales.\n\nThe game is in Spanish and comes full as all inclusive, of how to play the Singleplayer, Multiplayer and Cooperative Special Operations.\n\nCualquier problema, visitar www.GureTorrents.com/Foro y se dara soporte al Juego.\n\nAny problems, visit www.GureTorrents.com/ forum and give support to the Game.\n\n\nDisfrutar!!! \n\nEnjoy!","torrent":{"xt":"urn:btih:594297cb607b4abdbf939061ced946c9352e676b","amp;dn":"Call+Of+Duty%3A+Modern+Warfare+2+PC+Spanish+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594297cb607b4abdbf939061ced946c9352e676b","infoHashBuffer":{"type":"Buffer","data":[89,66,151,203,96,123,74,189,191,147,144,97,206,217,70,201,53,46,103,107]},"announce":[],"urlList":[]}}