{"title":"[ExploitedCollegeGirls] Izzy (11.14.2013)","uid":9236489,"size":653923849,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5a2e9cc40cd66cfa1d7b9a0452b7047a1d527047&amp;dn=%5BExploitedCollegeGirls%5D+Izzy+%2811.14.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1385184536,"description":"[ExploitedCollegeGirls] Izzy (11.14.2013)\n\nThis week I bring you Izzy, all the way from the UK via Montana. She's a self confessed sex fiend with a bangin' body. You'll notice right away as she tells me about her colorful sexual history her perky little titties sport progressively harder and harder pokies.\nThe next thing you'll notice about Izzy is her wacky accent, which she explains. But, I always like to delve deeper and it doesn't take long to find out both that Izzy is a genuinely nice girl-next-door type AND that she's got a fantastic ass. I really can't wait to give it a nice hard smack and watch it bounce.\nI get Izzy situated on the bed and we talk a bit more, she even shares the story of the first time she squirted, which gets her so turned on that I can tell her pussy is getting wet. She checks, and sure enough, it's time to get to the good stuff. I start right off with my fingers and Izzy quickly gets into my rhythm. Recalling that she likes to be penetrated, I grab a dildo and use it and my fingers to give her a couple of quick orgasms. She's so sensitive afterwards that she needs a break, which is always my cue that it's blowjob time.\nIzzy drops to her knees and starts sucking. Immediately I'm into it, this girl really, really, REALLY knows how to suck a cock. Her hand and mouth coordination is sublime. I'm really taken by surprise by this girl's oral skills. She swallows me to the base and back out to tease the tip - I could go on and on, you just need to watch. She's amazing. She's really into it and when I lay her back and start face fucking her, she loves every second of it.\nI'm sure by now her pussy has recovered so I get her on the bed, on her knees and finally get a chance to fuck that tight box. I also get a chance to slap that fine ass and I do, over and over. It doesn't take long for her cute behind to turn beet red. Her pussy feels great and she really responds, I bring her to orgasm again and again.\nAfter Izzy achieves yet another orgasm while riding me in cowgirl, I'm at the point of busting myself so I throw her on her back and hit that sopping wet pussy hard until I bust a huge load inside her. Then I put my cum covered cock back in her pussy and bring her to another orgasm before pulling out to film the cream pie. She says she's on the pill, but I dumped so much semen in her that she might be calling me back in 9 months. All in all, great girl. I loved spanking that tight little ass and Izzy's six orgasms were intense.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=1sjbb0fej5wkd6fc77zx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=1sjbb0fej5wkd6fc77zx.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=reepcrl50cfil9niude7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=reepcrl50cfil9niude7.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5a2e9cc40cd66cfa1d7b9a0452b7047a1d527047","amp;dn":"%5BExploitedCollegeGirls%5D+Izzy+%2811.14.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a2e9cc40cd66cfa1d7b9a0452b7047a1d527047","infoHashBuffer":{"type":"Buffer","data":[90,46,156,196,12,214,108,250,29,123,154,4,82,183,4,122,29,82,112,71]},"announce":[],"urlList":[]}}