{"title":"Gentoo 2006.1 x86 Live installer","uid":3565838,"size":715732992,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:5e52834b1d770a9841e9263c2936624d169f35c2&amp;dn=Gentoo+2006.1+x86+Live+installer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flushell","files":1,"time":1164621584,"description":"What is Gentoo?\n\nGentoo is a free operating system based on either Linux or FreeBSD that can be automatically optimized and customized for just about any application or need. Extreme configurability, performance and a top-notch user and developer community are all hallmarks of the Gentoo experience.\n\nThanks to a technology called Portage, Gentoo can become an ideal secure server, development workstation, professional desktop, gaming system, embedded solution or something else -- whatever you need it to be. Because of its near-unlimited adaptability, we call Gentoo a metadistribution.\n\nWhat is Portage?\n\nPortage is the heart of Gentoo, and performs many key functions. For one, Portage is the software distribution system for Gentoo. To get the latest software for Gentoo, you type one command: emerge --sync. This command tells Portage to update your local &quot;Portage tree&quot; over the Internet. Your local Portage tree contains a complete collection of scripts that can be used by Portage to create and install the latest Gentoo packages. Currently, we have more than 10000 packages in our Portage tree, with updates and new ones being added all the time.\n\nPortage is also a package building and installation system. When you want to install a package, you type emerge packagename, at which point Portage automatically builds a custom version of the package to your exact specifications, optimizing it for your hardware and ensuring that the optional features in the package that you want are enabled -- and those you don&amp;#039;t want aren&amp;#039;t.\n\nPortage also keeps your system up-to-date. Typing emerge -uD world -- one command -- will ensure that all the packages that you want on your system are updated automatically.","torrent":{"xt":"urn:btih:5e52834b1d770a9841e9263c2936624d169f35c2","amp;dn":"Gentoo+2006.1+x86+Live+installer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e52834b1d770a9841e9263c2936624d169f35c2","infoHashBuffer":{"type":"Buffer","data":[94,82,131,75,29,119,10,152,65,233,38,60,41,54,98,77,22,159,53,194]},"announce":[],"urlList":[]}}