{"title":"PhotoFiltre Studio X 10.3.2 [Portable]","uid":5787401,"size":23270585,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6933961e4a65546c23825cf1ec27788432942ec4&amp;dn=PhotoFiltre+Studio+X+10.3.2+%5BPortable%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chusca","files":3,"time":1282693923,"description":"Un programa completo para la ediciÃƒÂ³n de las imÃƒÂ¡genes. PhotoFiltre es un completo editor de imÃƒÂ¡genes y paquete con efectos para retocar tus imÃƒÂ¡genes. PhotoFiltre te permite hacer ajustes simples o avanzados a una imagen y aplicarle una amplia gama de filtros. PhotoFiltre es sencillo e intuitivo de utilizar, y se puede aprender rÃƒÂ¡pidamente. La barra de herramientas, que te da acceso a los filtros estÃƒÂ¡ndar, le proporciona a PhotoFiltre un aspecto robusto.\nPhotoFiltre viene con muchas caracterÃƒÂ­sticas que rivalizan con algunos paquetes comerciales, y tambiÃƒÂ©n tiene complementos adicionales que pueden descargarse desde la pÃƒÂ¡gina web.\nPhotoFiltre ofrece todas las funciones estÃƒÂ¡ndar para la ediciÃƒÂ³n (selecciÃƒÂ³n, clon del pÃƒÂ­ncel, pintar con pincel, etc.), asÃƒÂ­ como una gran selecciÃƒÂ³n de efectos para las imÃƒÂ¡genes, mÃƒÂ¡scaras de fotos, ajustes de imagen y un navegador en miniatura. PhotoFiltre tambiÃƒÂ©n admite el procesamiento por lotes al aplicar los filtros, establecer la dimensiÃƒÂ³n, y realizar ajustes y transformaciones a un gran nÃƒÂºmero de imÃƒÂ¡genes a la vez.\nSu amplia gama de filtros le permite a los principiantes familiarizarse con el mundo de los grÃƒÂ¡ficos. Puedes encontrar las funciones estÃƒÂ¡ndar de los ajustes (brillo, contraste, teÃƒÂ±ido, saturaciÃƒÂ³n, correcciÃƒÂ³n de la gamma) y tambiÃƒÂ©n filtros artÃƒÂ­sticos (acuarela, pasteles, tinta India, puntillismo, efecto rompecabezas, etc.).\nÃ‚Â¡Hay mÃƒÂ¡s de 100 filtros para ser descubiertos!\n-Incluye un keygen. Para registarlo abrir el programa e ir al menÃƒÂº donde pone &quot;?&quot; y ahÃƒÂ­ en registro, e introducir el nombre de usuario y la clave generadas. Idioma: EspaÃƒÂ±ol.\n\n\n","torrent":{"xt":"urn:btih:6933961e4a65546c23825cf1ec27788432942ec4","amp;dn":"PhotoFiltre+Studio+X+10.3.2+%5BPortable%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6933961e4a65546c23825cf1ec27788432942ec4","infoHashBuffer":{"type":"Buffer","data":[105,51,150,30,74,101,84,108,35,130,92,241,236,39,120,132,50,148,46,196]},"announce":[],"urlList":[]}}