{"title":"AceMoney Lite 3.16","uid":4809739,"size":2472247,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6f3c5a47b241e850405158722bb57ecd3b7b7c3c&amp;dn=AceMoney+Lite+3.16&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1238336394,"description":"Copied from AceMoney Lite Homepage:\n\n\nAceMoney Lite is a freeware personal finance manager. AceMoney Lite helps people organize and manage their personal finances quickly and easily. It supports all the features required for home or even small-business accounting needs:\n\nTrack your spending habits and see where the money goes\n\nGenerate any report by categories or payors/payees, including pie charts. Now you can see at a glance how much you spent on food last month. Find all your withdrawals and deposits by any parameter. \n \nCreate and manage budgets\n\nThe program has more than 100 predefined spending categories. Setup budget limits for every category and track the difference between actual and budgeted values. \n \nTrack performance of investments\n\nTrack 401k, Stock options, Employee Stock Purchase Plans or any other investment activities. You don't need to enter the stock quotes manually: AceMoney will download them from the net! \n \nDo your financial math in multiple currencies\n\nThe software supports more than 150 different currencies and automatically downloads their exchange rates from Internet. \n \nEnjoy the convenience of on-line banking\n\nDownload and import information from on-line banks in QIF and OFX formats. If you run a small business, export to HTML, Text, or CSV formats to generate statements or perform complex statistical analysis. \n \nDon't miss the next deadline for bills\n\nAceMoney takes control over your bills and shows you when they should be paid. \n \nDouble check\n\nEnjoy the security of password protection of every file, scheduled backups and many other features without having any experience in accounting! \n \nPlan debts and mortgage payments\n\nAceMoney provides a loan calculator to plan debt payments and a professional mortgage calculator to estimate future morgage payments if you are planning to purchase real estate. \n \nDo e-business with AceMoney\n\nAre you selling goods on eBay? Are you in a shareware business? Do it with AceMoney! AceMoney automates input of orders coming from PayPal, RegNow, RegSoft, SWReg and Plimus. Read more about this exciting feature here. \n \n\nOn top of that, AceMoney is available in English, Dutch, French, Galego, Italian, Lithuanian, Polish, Portuguese, Russian, Spanish, Swedish, Ukrainian, Slovak and Turkish! People all over the world use AceMoney for their personal needs. Read what people say about AceMoney. \n\nYou should have at least 8 Mb of RAM and any 32-bit Windows OS. AceMoney works well under Linux with Wine. AceMoney is small, but it has a lot of features that could be found in huge personal accounting software packages that are on the market.\n\n\nChangelog:\n\n\nAdded printing of portfolio and investment Transactions\n\nAdded printing of banks\n\nAdded printing of payees\n\nAdded printing of categories\n\nAdded printing of schedule\n\nUpdated PayPal order parser\n\nTransactions within the same day are now ordered by numbers\n\nExtended reconciled balance tooltip deactivation period\n\nFixed currency exchange rate download via proxy server","torrent":{"xt":"urn:btih:6f3c5a47b241e850405158722bb57ecd3b7b7c3c","amp;dn":"AceMoney+Lite+3.16","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3c5a47b241e850405158722bb57ecd3b7b7c3c","infoHashBuffer":{"type":"Buffer","data":[111,60,90,71,178,65,232,80,64,81,88,114,43,181,126,205,59,123,124,60]},"announce":[],"urlList":[]}}