{"title":"Kings Row - Classic Film Scores - Erich Wolfgang Korngold","uid":11499020,"size":235726328,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7157c874d3e92ae3e0718ff1c39e351238ac3fcd&amp;dn=Kings+Row+-+Classic+Film+Scores+-+Erich+Wolfgang+Korngold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"metro369","files":3,"time":1416318945,"description":"This is the ONLY extended recording of Korngold's remarkable &quot;Kings Row&quot;. And it is in knock down digital sound, to boot.\nThe existing original soundtrack snippets (which is being charitable) available from time to time were recorded well over 60 years ago, and sound every minute of it.\nWas Korngold's conducting better than Gerhardt's? Well, Korngold was, without doubt, a virtuoso conductor, but who can tell when it all sounds like it's coming out of a Campbell's soup can?\nAnd good, no great, as this present recording is, it does not present the full &quot;every-note-Korngold-wrote&quot; score. That will be left to someone else to do. However, at a total time of over 40 minutes, it presents every theme, most in multiple guises, and virtually every scene Korngold scored.\nHowever, I do have one caveat. Although this is a full digital stereo recording, it was originally sequenced for the LP release, which preceeded that of the CD. And it is sequenced as such, with just a single track break where the LP's side flip was.\nThis recording deserves to be retracked at the appropriate track markings, all of which, by the way, are provided in the booklet.\nOther than that, run, don't walk, to find this great CD. That is, if you can","torrent":{"xt":"urn:btih:7157c874d3e92ae3e0718ff1c39e351238ac3fcd","amp;dn":"Kings+Row+-+Classic+Film+Scores+-+Erich+Wolfgang+Korngold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7157c874d3e92ae3e0718ff1c39e351238ac3fcd","infoHashBuffer":{"type":"Buffer","data":[113,87,200,116,211,233,42,227,224,113,143,241,195,158,53,18,56,172,63,205]},"announce":[],"urlList":[]}}