{"title":"Henry.Hazlitt.-.From.Bretton.Woods.to.World.Inflation.[182pp.sca","uid":4442634,"size":5493946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75704f8a641f8c6e7d02d7c50c5c40e614df1d16&amp;dn=Henry.Hazlitt.-.From.Bretton.Woods.to.World.Inflation.%5B182pp.sca&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"softpilo","files":1,"time":1223896533,"description":"In 1944, representatives of the United Nations met at Bretton Woods, New Hampshire, to establish the International Monetary Fund and its bank, intended to promote international monetary growth, currency stability, and free trade. This is what the history books tell us. According to Henry Hazlitt, however, &quot;at that meeting, chiefly under the leadership of John Maynard Keynes of England, all the wrong decisions were made. Inflation was institutionalized.&quot;\n\nIn spite of the appalling record since then, few politicians and fewer economists have seriously questioned the agreements reached at Bretton Woods. Mr. Hazlitt here collects editorials he wrote for the New York Times against the IMF during the months of the conference, and several articles he wrote afterward on inflation. He notes: &quot;The supreme irony is that the Bretton Woods institutions that have failed so completely in their announced purpose, and led to only monetary chaos instead, are still there, still operating, still draining the countries with lower inflations to subsidize the higher inflations of others.&quot; With the IMF to fall back on, says Mr. Hazlitt, irresponsible and improvident governments are encouraged to prolong their unsound and inefficient economic policies, which more often than not feature capitalist-sponsored socialism and inflationary policies. One need look no farther than Latin American and its annual banking crises to appreciate Mr. Hazlitt&amp;#039;s wisdom. He prescribes radical surgery: Dismantle the IMF and encourage sound currencies by a return to the gold standard, balanced budgets, and truly free trade. With so few sound-money men around today, Mr. Hazlitt&amp;#039;s advice will probably be dismissed as that of a crank.","torrent":{"xt":"urn:btih:75704f8a641f8c6e7d02d7c50c5c40e614df1d16","amp;dn":"Henry.Hazlitt.-.From.Bretton.Woods.to.World.Inflation.%5B182pp.sca","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75704f8a641f8c6e7d02d7c50c5c40e614df1d16","infoHashBuffer":{"type":"Buffer","data":[117,112,79,138,100,31,140,110,125,2,215,197,12,92,64,230,20,223,29,22]},"announce":[],"urlList":[]}}