{"title":"Love And Theft - Runaway  (2nafish)","uid":5275657,"size":161966084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:75e3b402ad62625a36428279d8354746e4b081ff&amp;dn=Love+And+Theft+-+Runaway++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263371316,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThis video has a no CMT logo.\n\n\n&quot;Runaway&quot; is title of a song recorded by the country music group Love and Theft. It is the lead-off single to their debut album World Wide Open. The song debuted on the Hot Country Songs chart in March 2009.\n\n&quot;Runaway&quot; debuted at #60 on the Billboard Hot Country Songs chart for the week of March 14, 2009. It debuted at #65 on the Hot 100 for the chart dated September 12, 2009. \n\nWorld Wide Open is the debut album of the American country music group Love and Theft. It was released on August 25, 2009 via Carolwood Records, a sister label of Lyric Street Records. The album includes the single &quot;Runaway&quot;, which is a Top 10 hit on the Billboard Hot Country Songs charts.\n\nAt least one member of the band had a hand in co-writing every track on the album. Co-writers include former RCA Records artist Robert Ellis Orrall, as well as Roger Springer and The Warren Brothers. Lead-off single &quot;Runaway&quot;, which Stephen Barker Liles co-wrote, has reached Top 10 on the U.S. Billboard Hot Country Songs charts. Shortly after &quot;Runaway&quot; peaked, Carolwood was consolidated with Lyric Street Records. The second single is &quot;Dancing in Circles.&quot;\n\nLove and Theft is an American country music group formed in Nashville, Tennessee, in 2006. It is composed of Brian Bandas, Stephen Barker Liles and Eric Gunderson, all three of whom sing lead vocals and play guitar. Signed to Lyric Street Records subsidiary Carolwood Records in 2009, Love and Theft made its chart debut in early 2009 with the single &quot;Runaway&quot;, which has reached Top 10 on Billboard Hot Country Songs. The band's debut album, World Wide Open, was released on August 25, 2009.\n\nLove and Theft was founded in 2006 by Brian Bandas, Stephen Barker Liles and Eric Gunderson, all three of whom sing lead vocals. After performing before ASCAP executives, the band was recommended to an A&amp;R executive for Lyric Street Records, who signed the band to Lyric Street's sister label Carolwood Records in 2009. Shortly before being signed, the band was also signed as an opening act for Taylor Swift on her 2008 tour. Liles is the subject of the song &quot;Hey Stephen&quot; which appears on Swift's 2008 album Fearless. He also co-wrote the track &quot;Wrong Baby Wrong Baby Wrong&quot; on Martina McBride's 2009 album Shine.\n\nLove and Theft made its first Grand Ole Opry performance on March 28, 2009, shortly before the release of its debut single &quot;Runaway&quot;. This song is included on the band's debut album, World Wide Open. In addition, Love and Theft has recorded a video for &quot;Don't Wake Me&quot;, another cut from the album. &quot;Runaway&quot; peaked at #10 on the country charts in November 2009, shortly before Carolwood was consolidated with Lyric Street.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:75e3b402ad62625a36428279d8354746e4b081ff","amp;dn":"Love+And+Theft+-+Runaway++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75e3b402ad62625a36428279d8354746e4b081ff","infoHashBuffer":{"type":"Buffer","data":[117,227,180,2,173,98,98,90,54,66,130,121,216,53,71,70,228,176,129,255]},"announce":[],"urlList":[]}}