{"title":"CHIGLEY EPISODE 13","uid":4482572,"size":104249344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7881c0a6e03b4ba430927e0e2df1d440b35fec6f&amp;dn=CHIGLEY+EPISODE+13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mcfc_guvnors","files":1,"time":1225634464,"description":"Episode 13. A Present for Lord Belborough\n\n\n\nIN BRIEF - Lord Belborough&amp;#039;s gets a new steam engine as a gift from the people of Chigley for the 6 o&amp;#039;clock dances.And it&amp;#039;s put to very good use helping Mr.Bilton to keep the grounds looking nice.\n\n\n\nWe drop in on Mr.Antonio,the ice cream man,as he&amp;#039;s doing good business on a hot day in Trumpton Market Square.And we ride with him to Winkstead Hall where he gives Brackett a large tin of vanilla for the Hall&amp;#039;s tea room,and is accosted by Mr.Bilton who often gives him help and advice as Antonio&amp;#039;s &quot;a very keen gardener&quot;.There&amp;#039;s an exchange of some wallflower plants for a tub of peppermint ice cream and they pop off round to the greenhouse.But all is not well.Mr.Bilton explains that pushing his wheelbarrow around for miles is causing problems with his back (&quot;rheumatics&quot;) and he&amp;#039;s been trying to get his Lordship to get him a motorised one for ages.Mr.Antonio helps him out there and then by cutting the grass for him while he eats his ice cream.And back at his van he meets Lord B who explains that the long-awaited &quot;motor barrow&quot; is expensive and will have to wait.Although it would help if they had an added attraction or two to get visitor numbers up.\n\nNext stop is the Pottery,where Harry Farthing&amp;#039;s interested to hear about the problem because the people of Chigley are going to present his Lordship with a working model of &quot;a very early steam train&quot; found at an auction by Mr.Rumpling- as a &amp;#039;thankyou&amp;#039; for the 6 o&amp;#039;clock dances.When Mr.Antonio moves on to the Garage for petrol Mr.Crockett is aware of the impending gift but not Mr.Bilton&amp;#039;s rheumatics,and it&amp;#039;s duely noted.\n\nIt&amp;#039;s one week later and Mr.Swallow rings Brackett to inform him a crate has arrived for his Lordship marked &quot;not to be opened until the 6 o&amp;#039;clock whistle&quot;.And an intrigued Lord B steams off to the Wharf where it&amp;#039;s craned on board from Mr.Rumpling&amp;#039;s barge and we cut to the usual 6 o&amp;#039;clock exit of the biscuit Factory workers.But before the dance can begin there&amp;#039;s that package to open.Which proves to be the small steam engine gift as promised,and Lord B is just expressing his thanks when Mr.Crockett pulls up towing a small trailer.And once hooked up to the little engine it provides Mr.Bilton with his very own ride-on barrow to help keep the grounds looking nice.Cue some organ music !\n\nTRIVIA -1) How did Lord B manage to get the small steam engine off Bessie when back at the Hall  ?\n\n2) Just in case you&amp;#039;re wondering,the steam engine was the very small mobile type and with normal wheels rather than railway ones obviously.But that ride-on barrow scoops the Trumptonshire award in the category of &quot;theeee most impractical,over-engineered solution to a simple problem&quot; Although &quot;good intent&quot; conquers all of course and,as such,it&amp;#039;s probably a fitting way to end the 39th and last episode of the Trilogy.\n","torrent":{"xt":"urn:btih:7881c0a6e03b4ba430927e0e2df1d440b35fec6f","amp;dn":"CHIGLEY+EPISODE+13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7881c0a6e03b4ba430927e0e2df1d440b35fec6f","infoHashBuffer":{"type":"Buffer","data":[120,129,192,166,224,59,75,164,48,146,126,14,45,241,212,64,179,95,236,111]},"announce":[],"urlList":[]}}