{"title":"The Kid Stays in the Picture/The Fat Lady Sang Robert Evans (mul","uid":9361163,"size":154018052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79af9b08edd5fe193b1d77ef5b996e6806fa2428&amp;dn=The+Kid+Stays+in+the+Picture%2FThe+Fat+Lady+Sang+Robert+Evans+%28mul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"7","files":6,"time":1387321108,"description":"The Kid Stays in the Picture/The Fat Lady Sang (1994/2013) Robert Evans (multi) \n\n\n\nThe Kid Stays in the Picture/The Fat Lady Sang by Robert Evans\n\n\nFormat: mobi/epub/azw3\nLength: 528/240 pages\nGenre: Biography\nDate: 4 June 2013-new edition (first published 1994)/27 November 2013\n\nThe Kid Stays in the Picture is the 1994 autobiography of film producer and legendary Hollywood &quot;bad boy&quot; Robert Evans (also made into a 2002 film). The Fat Lady Sang is the long-awaited follow-up.\n\nThe Kid Stays in the Picture  \n\nRobert Evans's The Kid Stays in the Picture is universally recognized as the greatest, most outrageous, most unforgettable show business memoir ever written. The basis of a groundbreaking, award-winning documentary film, it remains the gold standard of Hollywood storytelling.\n\nChronicling his high-drama life, Evans paints a riveting, self-promoting picture of his 30-year career in the film industry, from his 1956 debut in Man of a Thousand Faces to his lengthy stint, beginning in 1967, as the head of Paramount Pictures, where he oversaw the production of such cinematic hits as Barefoot in the Park; The Odd Couple; Goodbye, Columbus; Harold and Maude; Rosemary's Baby; The Godfather; Love Story; and Chinatown.\n\nIn a predictably confident, often feisty tone, Evans describes his rise, fall and what he calls his recent return to the upper echelons of Tinseltown power, as he recalls personal encounters with, and memories of, such show-biz brand names as Errol Flynn, James Cagney, Jack Nicolson, Mia Farrow, Mike Todd, Francis Ford Coppola and two of his wives, Ali MacGraw and Phyllis George. Offering a real insider's view of Hollywood, Evans's memoir is easily worth the price of admission.\n\nThis new 'It Books' edition, the first in more than a decade, features an &quot;introduction to the new edition&quot; by the author.\n\nThe Fat Lady Sang\n\nTold with Bob's unmistakable voice and panache, The Fat Lady Sang is full of even more outrageous and unbelievable stories about one of the most turbulent times in Hollywood. Told in the same irresistible style that made The Kid Stays in the Picture one of the most acclaimed memoirs of our time, The Fat Lady Sang chronicles Evans' triumphant recovery from a devastating series of strokes, with the aid of neurologists, physical therapists and old friends like Warren Beatty, Jack Nicholson, Sumner Redstone, and Beverly D'Angelo.\n\nAlong the way, he shares new stories from throughout his career, with cameos by everyone from Jimmy Cagney, Tyrone Power, Darryl Zanuck, Ava Gardner, Errol Flynn, and Grace Kelly to President John F. Kennedy, Frank Sinatra, Brigitte Bardot, Catherine Deneuve, Ali MacGraw, John Wayne, Alain Delon, Henry Kissinger, President Reagan, and Pope John Paul II, to Dustin Hoffman, Roman Polanski, Helmut Newton, P. Diddy, Wes Craven, Slash, 50 Cent, Snoop Dogg, and more. The Fat Lady Sang finds The Kid as brazen as ever, refusing to slow down even as the fat lady opened her mouth to belt out those final notes.\n\nAuthor:\n\nRobert Evans was the chief of Paramount Studios in the 1960s and 1970s, and produced many of the most acclaimed and successful films of all time, including The Godfather, Chinatown, Marathon Man, and Urban Cowboy. He has been the inspiration for characters played by Robert Vaughn in S. O. B. and Dustin Hoffman in Wag the Dog. He lives in Beverly Hills, CA, in the estate known as Woodland, once owned by Greta Garbo. ","torrent":{"xt":"urn:btih:79af9b08edd5fe193b1d77ef5b996e6806fa2428","amp;dn":"The+Kid+Stays+in+the+Picture%2FThe+Fat+Lady+Sang+Robert+Evans+%28mul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79af9b08edd5fe193b1d77ef5b996e6806fa2428","infoHashBuffer":{"type":"Buffer","data":[121,175,155,8,237,213,254,25,59,29,119,239,91,153,110,104,6,250,36,40]},"announce":[],"urlList":[]}}