{"title":"Fly Me to the Moon-Fateful Attraction-CBC Doc Zone[HDTV]~Ekolb","uid":4676107,"size":366418872,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7ae658e9bc281223be5a34751e1067ba47600628&amp;dn=Fly+Me+to+the+Moon-Fateful+Attraction-CBC+Doc+Zone%5BHDTV%5D%7EEkolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Ekolb","files":2,"time":1232906081,"description":"A whimsical look at our intriguing relationship with the moon - our closest, and most romantic, neighbour in the sky.\n\nMore than four billion years ago, an interplanetary collision tore away part of the earth, which eventually became the moon. But gravity has kept us orbiting together - the moon around the earth - in an endless dance. And it's a fateful attraction that keeps bringing us back together. \n\n\nEarth and moon were reunited when astronauts walked on the moon on July 20, 1969. But it didn't last. Now, forty years later, the relationship is hot again. Private companies are building moon-bound rockets. NASA plans a permanent human settlement up there and suggests the moon, because of its lower gravity, would be the perfect launching pad for further exploration of the solar system. And scientists say we can harness solar power on the moon and beam it to earth to solve our own planet's energy crisis.\n\nThe moon has influenced us since the dawn of time, helping to create life on earth through gravitation and the tides. The moon also ensured the survival of the human race. When hunter-gatherers roamed the earth, women synched their menstrual cycles to the phases of the moon in a sex stratagem designed to get men to provide for their children. For astrologers, the moon is a symbol of femininity.\n\nFrom Shakespearean romance to Beethoven's famous Moonlight Sonata to the adventures of Jules Verne, the moon has loomed large in our culture and history. The absence of moonlight doomed the Titanic, while entire cities were destroyed in WWII under the &quot;bomber's moon&quot;.\n\nMore recently, an American entrepreneur laid claim to the celestial body, selling millions of moon acres to earthlings for $19.99 an acre (plus $1.51 lunar tax)! And the ancient, intriguing art of 'moon gardening' is making a comeback in the UK, while experts (and the Montreal police) debate whether a full moon induces all the loony, lunatic effects ascribed to it.\n\nIn the film, well-known Quebec pianist and singer Gregory Charles performs several moon-themed musical numbers, including Fly Me To The Moon, That's Amore, Aquarius, and excerpts from Beethoven's Moonlight Sonata. \n\nStarring the inconstant, ever-changing symbol of beauty, magic, danger, romance, power, and mystery, Fly Me to the Moon, in one entertaining hour, offers a fascinating short history of our close relationship, both scientific and cultural, with the moon.\n\nFly Me to the Moon: Fateful Attraction is written, directed, edited and produced by John Curtin for Kaos Productions Inc. in association with the Canadian Broadcasting Corporation.\n\nOrig Aired        : 01-22-09\n\nFormat            : AVI\nLength            : 349 MiB for 43mn 40s 787ms\ncodec             : XviD\nSource            : HDTV\n\nVideo #0          : MPEG-4 Visual at 993 Kbps\nAspect            : 528 x 304 (1.737) at 29.970 fps\n\nAudio #0          : MPEG Audio at 112 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:7ae658e9bc281223be5a34751e1067ba47600628","amp;dn":"Fly+Me+to+the+Moon-Fateful+Attraction-CBC+Doc+Zone%5BHDTV%5D%7EEkolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ae658e9bc281223be5a34751e1067ba47600628","infoHashBuffer":{"type":"Buffer","data":[122,230,88,233,188,40,18,35,190,90,52,117,30,16,103,186,71,96,6,40]},"announce":[],"urlList":[]}}