{"title":"Blondie - In The Flesh (Xvid-2nafish)","uid":6056204,"size":32854292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7d77c85ef136c2eebcfcb103d9de89daecefe71e&amp;dn=Blondie+-+In+The+Flesh+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292925426,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:02:26\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1670 Kbps\nQuality Factor : 0.33 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;In the Flesh&quot; is a song by American New Wave band Blondie. Originally from the band's self-titled debut album, Blondie, the song was Blondie's second and final single on the Private Stock label.\n\nThe song has a feel reminiscent of Phil Spector-produced pop from the early 60s, with prominent piano, female backing vocals, and a time signature of 12/8.\n\nIn Australia, after the song was played by mistake on the nationally broadcast music program Countdown, it was well received by the viewing audience. Chrysalis Records released the song as a single in Australia, with &quot;Man Overboard&quot; as the B-side. When it reached number two on the charts, Australia became the first territory in which Blondie achieved a hit single.\n\n&quot;In the Flesh&quot; was featured in the 1982 film, The Last American Virgin, and appears on its soundtrack.\n\nBlondie is the eponymous debut album by American New Wave band Blondie, released in 1976 on Private Stock Records. The first single &quot;X Offender&quot; was originally entitled &quot;Sex Offender&quot; but since radio stations would not play a song with such a controversial title, the band renamed the song. After disappointing sales and poor publicity, Blondie bought back its contract with Private Stock. Chrysalis Records then signed the band 1977 and re-released the album, along with the new second album Plastic Letters.\n\nThe album was first digitally remastered by Chrysalis Records UK in 1994. In 2001, the album was again remastered and reissued, this time along with five bonus tracks. &quot;Out in the Streets&quot;, &quot;The Thin Line&quot; and &quot;Platinum Blonde&quot; are three of five tracks from a 1975 demo recorded by Alan Betrock, all five were first issued on the 1994 compilation The Platinum Collection. &quot;X-Offender&quot; (Single Version) and &quot;In the Sun&quot; (Single Version) are the A and B side from Blondie's first single, issued on Private Stock, and are different mixes from the album versions. The two Private Stock versions are both remastered from vinyl.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7d77c85ef136c2eebcfcb103d9de89daecefe71e","amp;dn":"Blondie+-+In+The+Flesh+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d77c85ef136c2eebcfcb103d9de89daecefe71e","infoHashBuffer":{"type":"Buffer","data":[125,119,200,94,241,54,194,238,188,252,177,3,217,222,137,218,236,239,231,30]},"announce":[],"urlList":[]}}