{"title":"Going Straight - The Complete Series [1978] follow up from Porri","uid":4924939,"size":1765771635,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7f416cc01c72491d6590a028aa690f0567888c04&amp;dn=Going+Straight+-+The+Complete+Series+%5B1978%5D+follow+up+from+Porri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hifi2005","files":7,"time":1243807460,"description":"Going Home (Originally Transmitted 24 February 1978)\nFletch has now reached the end of his stay in Prison and says his goodbyes to McLaren. On the train journey home Fletch bumps into Mackay and an old friend. His old friend makes an early attempt to tempt him from the straight and narrow but it's Mackay who almost commits a crime.\n\nGoing To Be Alright (Originally Transmitted 3 March 1978)\nFletch visits his probation officer and reveals that his wife, Isobel, has left him for someone called Reg Jessop who owns a cardboard box factory. Fletch doesn't seem too concerned about getting a job and the reason is a legacy from a previous crime which he attempts to dig up by stealing Godber's lorry and driving off to the site where the loot was buried. He is out of luck, however, when he discovers a housing development has been built on the field.\n\nGoing Sour (Originally Transmitted 10 March 1978)\nFletch is diverted from his own problems when he comes across a young punk girl and tries to set her on the straight and narrow.\n\nGoing to Work (Originally Transmitted 17 March 1978)\nFletch's probation officer sets him up with a job as a night porter. Fletch is nervous about his first ever job and can't face it but Godber and Ingrid make sure he turns up.\n\nGoing, Going, Gone (Originally Transmitted 31 March 1978)\nStill working as a night porter in a small hotel, Fletch recognises an old fellow inmate and suspects fowl play and does his best to prevent a crime occurring.\n\nGoing Off the Rails (Originally Transmitted 7 April 1978)\nFletch is almost tempted off the straight and narrow on the day Ingrid is to marry Godber. He has a change of heart before it's too late but almost gets into trouble with a walkie talkie. Godber married Ingrid with Fletch giving away the bride and acting as best man\n\nvideo format mpeg4\nvideo bitrate 1200\n720x576 .25.00fps\naudio mp3\n48000hz,stereo,128kb/s ","torrent":{"xt":"urn:btih:7f416cc01c72491d6590a028aa690f0567888c04","amp;dn":"Going+Straight+-+The+Complete+Series+%5B1978%5D+follow+up+from+Porri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f416cc01c72491d6590a028aa690f0567888c04","infoHashBuffer":{"type":"Buffer","data":[127,65,108,192,28,114,73,29,101,144,160,40,170,105,15,5,103,136,140,4]},"announce":[],"urlList":[]}}