{"title":"R4Deluxe_YSMENU_JDog.rar","uid":5238285,"size":7398511,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:85272653ee6512a27554605f1bac669e95d232d7&amp;dn=R4Deluxe_YSMENU_JDog.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jeffand123","files":1,"time":1261634098,"description":"OK All this is for everyone having trouble using YSMENU. This is not for the original r4ds this is for the r4deluxe I dont know if it works on anything but the r4deluxe but if it does let me know and I will update the readme. I am not great at programming but I did manage to figure out how to code my r4deluxe to use YSMENU if anyone would like me to try to fix their cloned r4 let me know and Ill give it a go!!!!!\n\n \n\n\n\nInstall: Do a backup of your current r4deluxe put it some where safe and install everything to the root of your card. Thats all. Easy Right!!!!!\n\n\n\n\n\nYou will also have to create a Games directory and place you .nds games in there and a Media folder for any homebrew If you want to run. \nMovies you can use Moonshell if dont know what it is use Google! \n\n\n\n\n\nLeave a comment, where you found this torrent and I will do my best to help you out.\n\nBe specific about what card you are using and what your trouble is.\n\nAnd If this file helped you out all I ask for is just a thanks I dont ask for money or anything in return.\n\nBy the way this is my first upload so be nice if you have a problem just write it in the comments but dont bash, like I said im new to this and will do my best. ;)\n\nThanks to the creator of ysmenu Yasu\n\n\nThis was released by Jdog\n\nPLEASE SEED at least to a 1:1 ratio!!!!! :0","torrent":{"xt":"urn:btih:85272653ee6512a27554605f1bac669e95d232d7","amp;dn":"R4Deluxe_YSMENU_JDog.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85272653ee6512a27554605f1bac669e95d232d7","infoHashBuffer":{"type":"Buffer","data":[133,39,38,83,238,101,18,162,117,84,96,95,27,172,102,158,149,210,50,215]},"announce":[],"urlList":[]}}