{"title":"winx","uid":9642249,"size":1604040318,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:86239300b4491a0daace75796e907a2e6a52ff82&amp;dn=winx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"saradaddy","files":-1,"time":1392942592,"description":"Genre : Adventure\nDeveloper : Konami\nPublisher : Atari\nNumber of Players : 1 Player\nSize : 1,5 Gb\n\n\nWinx Club are a series of video games published by Konami.\nThe games are based loosely on the first season of the animated series.\nThe PC and version of the game feature voiced dialogue by the actors from the cartoon, unlockable alternate outfits for Bloom, and certain parts with elements similar to a dating simulation game.\nFocusing on friendship, love, fantasy, fashion and music, the game is sure to capture the imaginations of female gamers everywhere. Bloom, an earth girl who discovers she has fairy powers, finds herself attending Alfea, an enchanted school that teaches gifted individuals to become fairies. Set in the mystical world of Magix, players take on the role of this energetic dreamer who is also the leader of the Winx Club. While exploring the Winx Club universe, players will solve challenging puzzles, play mini-games and engage in magic-based battles. As they guide Bloom throughout the game, players will make lasting friendships, discover Bloom's true origin and thwart the plans of evil witches from a rival school.\nFilled with a cast of extraordinary characters, fans will fall easily into the game's storyline, which like the series emphasizes communication and relationships. Taking on the role of Bloom, players will experience the engaging gameplay filled with communitybased activities and collectibles as well as a wide range of magical moves and spectacular spells that will provide hours of entertainment. Designed especially with young gamers in mind, the title includes accessible controls and a seamless help system that aids players on this exciting journey.  \n\n\nDirectX Version : v9.0c\nOperating System : Windows 98/2000/ME/XP\n\nMinimum System Requirements\n\nSystem :Pentium III 1GHz or equivalent\nRAM : 128 MB\nVideo Memory : 64 0\nHard Drive Space : 1750 MB","torrent":{"xt":"urn:btih:86239300b4491a0daace75796e907a2e6a52ff82","amp;dn":"winx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86239300b4491a0daace75796e907a2e6a52ff82","infoHashBuffer":{"type":"Buffer","data":[134,35,147,0,180,73,26,13,170,206,117,121,110,144,122,46,106,82,255,130]},"announce":[],"urlList":[]}}