{"title":"Paparazzi.msi","uid":4493322,"size":25364716,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8d04226d26176005e55cd1269d3b667d0bad6a5f&amp;dn=Paparazzi.msi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jacksdad2007","files":1,"time":1226076739,"description":"Paparazzi PC Arcade Game  is a &quot;find the clues&quot; and a &quot;spot the differences&quot; puzzle game with an additional challenge. You need to take quick shot photos. Paparazzi requires good hand/eye coordination and some reviewers say that the objects are very well hidden, indeed.\n\nGet a glimpse into the bizarre world of the tabloids with Paparazzi!\n\nAs a fledgling paparazzi you travel the country to build your reputation as a hotshot, dirt-digging photojournalist.\n\nPaparazzi, the PC arcade gane, has 10 diverse and humorous Photo Assignments!\n\nThe goal of Paparazzi is to become an Ace Photographer. Being a paparazzi is your first step. To increase your paparazzi rank you must use your eyes and your reflexes to capture photos of strange subjects to sell for cash!\n\nSearch for and photograph challenging, hidden clues in a variety of interesting and bizarre locations presented by Paparazzi!\n\nAs a paparazzi, you have informants. They give you the lead. First you must sneak around in paparazzi style to find items that confirm the lead.\n\nThen you use your keen paparazzi eye to discover the differences in the the cover up photos that the celebrity submits to the tabloid.\n\nFinally, your quick snap paparazzi skills are put to the test, as you try to catch the special photo as the celebrity hurries past the photo scrum.\n\nSucceed and you&amp;#039;ll rise through the ranks of the newspaper staff to become an Ace Photographe...........PLEASE SEED!!!!!!!","torrent":{"xt":"urn:btih:8d04226d26176005e55cd1269d3b667d0bad6a5f","amp;dn":"Paparazzi.msi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d04226d26176005e55cd1269d3b667d0bad6a5f","infoHashBuffer":{"type":"Buffer","data":[141,4,34,109,38,23,96,5,229,92,209,38,157,59,102,125,11,173,106,95]},"announce":[],"urlList":[]}}