{"title":"Circle Dock 0.9.2 Alpha 8.2 Portable MultiLang","uid":4477709,"size":12169598,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8d525e97aa7241f5c3e32e1ef01af0c726b54044&amp;dn=Circle+Dock+0.9.2+Alpha+8.2+Portable+MultiLang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nordem","files":-1,"time":1225415925,"description":"***********************************************\n\nCircle Dock 0.9.2 Alpha 8.2 Portable MultiLang\n\n***********************************************\n\nTutorial: http://circledock.wikidot.com/\n\n***********************************************\n\nBahasa Indonesia, Chinese Simplified , Chinese Traditional, Croatian, Danish, Dutch, English, Espanol (Latinoamerica), French, German, Hungarian, Italian, Japanese, Polish, Portuguese, Portuguese BR, Russian, Serbian, Spanish\n\n***********************************************\n\n\nWhat Circle Dock 0.9.2 Alpha 8 Allows You to Do:\n* Launch your programs from a circular dock. \n* Drag and drop your files, folders, and shortcuts onto a circular dock that you can resize. \n* Rotate the dock with either your mouse wheel or the keyboard arrow keys. \n* Change the image shown for the icons and change the skins (compatible with icons and skins for Rocket Dock, Object Dock, etc.) \n* The dock appears where your mouse is by pressing a hotkey (default is F1) or your middle mouse button. \n* Tested on computers with multiple monitors, Windows XP/Vista, 32-bit &amp; 64-bit, and requires only .Net Framework 2.0. \n* Automatically works on all Windows Vista computers and most Windows XP computers. \n* A new settings panel that allows you to customize many options. It updates your dock as you make changes. See it change in real time! No need to press an OK button. \n* Multi-language capable. Just translate the English.ini file to the language of your choice. \n* Change the image used for the dock icons with the easiest method out there: Just set the program to \\\\\\\\\\\\\\&quot;Icon Replacement Mode\\\\\\\\\\\\\\&quot; in the right-click menu of the centre icon and you can change all the icon images by just dragging and dropping new PNG images onto them! Huge time saver when you are customizing your dock! \n* You can now toggle the visibility of the dock by moving your mouse to any edge of your screen. By default, the left and right edges are used for toggling. No need to press a button! \n* Rotate the dock with your mouse wheel or arrow keys (customizable). \n* Click sensitivity adjustment for tablet users. \n* Reorder the dock items by draging and dropping them over each other. \n* Organize the dock items using dock folders. \n* By default, clicking on the centre button does not open the start menu. You can enable this in the settings panel. \n* Uses the default high resolution icons in Windows Vista.\n* New easy method of upgrading from older versions.\n\n* New Kiosk Version of the Circle Dock exe file. \n* Many bug fixes and some new features have been added for Alpha 8. See the Change Log \n* Added the ability to run multiple docks at the same time by allowing multiple Circle Dock instances to run from separate folders. \n* Has the ability to run from a USB key on computers with the .Net Framework 2.0 or above. \n* Includes French, English, Portuguese, Polish, Russian, Italian, Dutch, Hungarian, Indonesian, Serbian, Croatian, Chinese, Spanish, German, and Danish language files. (Note: Alpha 8.2 is released and now has an up to date language file for each of the languages.) \n* More animation and smoother performance are being looked at for Alpha 9. \n* Ability to run docklets, live synchronization of the dock icons, and more will be added later on.","torrent":{"xt":"urn:btih:8d525e97aa7241f5c3e32e1ef01af0c726b54044","amp;dn":"Circle+Dock+0.9.2+Alpha+8.2+Portable+MultiLang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d525e97aa7241f5c3e32e1ef01af0c726b54044","infoHashBuffer":{"type":"Buffer","data":[141,82,94,151,170,114,65,245,195,227,46,30,240,26,240,199,38,181,64,68]},"announce":[],"urlList":[]}}