{"title":"24 - Season 1 [ENG / JPN] [TVrip] [2001]","uid":6087436,"size":8746577966,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8f72f89a29ef0d3feb2b73dfe22e48881dfef4b7&amp;dn=24+-+Season+1+%5BENG+%2F+JPN%5D+%5BTVrip%5D+%5B2001%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Camel-Toe","files":-1,"time":1294394415,"description":"24 - Season 1 (Japanese Hard-Subs)\n\n\nThe groundbreaking thriller, starring Kiefer Sutherland as Special Agent Jack Bauer, 24 is filmed in real-time. Combined with split-screen scenes of simultaneous action, 24 takes place hour-by-hour over 24 hours on the day of the Californian Presidential elections. The action starts at midnight as Jack Bauer of the Counter Terrorist Unit (CTU) faces the longest day of his life. He is about to take on his toughest missions to date - to foil the assassination attempt on presidential candidate Senator David Palmer (Dennis Haysbert), and to rebuild his marriage with his wife Terri (Leslie Hope). When their daughter Kimberly (Elisha Cuthbert) sneaks out with her best friend Janet, Terri sets out to find her with the help of the Janet's father.\n\nIn the meantime, Jack has been framed for the assassination attempt and flees the CIA agents to find the real perpetrators led by Ira Gaines (Michael Massee). The plot thickens as revelations about Senator Palmer's family arise and Terri's hunt for Kimberly gets more and more dangerous. Jack becomes incapacitated and only has his mobile phone and the help of his trusted colleague at CTU Nina Myers (Sarah Clarke) to help him. Nina works undercover to provide Jack with information about Gaines and the wherabouts of his family. This ontains all 24 episodes from the series.\nFollow 24 hours in the life of federal agent Jack Bauer (Kiefer Sutherland) in this innovative television series. Consisting of 24 hour-long episodes, the show uses split screens and a &quot;real-time&quot; clock to tell a tense interweaving story that involves Bauer, his wife (Leslie Hope) and daughter (Elisha Cuthbert), a presidential candidate (Dennis Haysbert) targeted for assassination, and many others. This set includes every episode of the thrilling first season.\n\nActors: Kiefer Sutherland\nAudio: Dolby Digital 2.0 Stereo\nAspect Ratio: 16:9 Enhanced\nTransfer Format: Widescreen\nCategory: TV Series Action / Crime/ Mystery / Thriller\nYear:\t2001\nLanguages: English\nSubtitles: Japanese (Hard Subs)\n\n\nThis is the first of 8 seasons","torrent":{"xt":"urn:btih:8f72f89a29ef0d3feb2b73dfe22e48881dfef4b7","amp;dn":"24+-+Season+1+%5BENG+%2F+JPN%5D+%5BTVrip%5D+%5B2001%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f72f89a29ef0d3feb2b73dfe22e48881dfef4b7","infoHashBuffer":{"type":"Buffer","data":[143,114,248,154,41,239,13,63,235,43,115,223,226,46,72,136,29,254,244,183]},"announce":[],"urlList":[]}}