{"title":"GARFIELD DOUBLE BOXSET IN XVIDS BY JOCKTHERIPPER@KIDZCORNER","uid":5611020,"size":1896821638,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f8cd80e2739e4ed084e972999af97cbbce70b52&amp;dn=GARFIELD+DOUBLE+BOXSET+IN+XVIDS+BY+JOCKTHERIPPER%40KIDZCORNER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alanwatson","files":4,"time":1275866181,"description":"enjoy\n\nGarfield: The Movie (Dir Peter Hewitt, 2004): Fat feline Garfield (voiced by ever excellent Bill Murray) enjoys his endless days of restful relaxation, lasagne dinners and the undivided attention of his owner Jon (Meyer). However, when Jon attempts to impress the ice-cold vet Liz (Love Hewitt) he takes in the hyperactive abandoned dog Odie. Turning Garfield's world upside down, Odie is promptly dog-napped by evil TV celebrity Happy Chapman (Tobolowsky) and the corpulent cat must brave the outside world to bring him back!\n\nGarfield: A Tale Of Two Kitties (Dir. Tim Hill, 2006): Garfield, America's favorite cat, is going continental. He's traveling across the pond (with canine sidekick Odie) to surprise his master, Jon Arbuckle (Meyer), who is in London to propose to his girlfriend, veterinarian Liz Wilson (Hewitt).\n\nIn the land of Big Ben, Buckingham Palace, Scotland Yard and fish and chips, Garfield's British invasion takes on a Prince and the Paw-per dimension. He inadvertently swicthes places with the Prince, a royal cat (and by luck his exact look-a-like), who has just inherited Castle Carlyle from his deceased owner, Lady Eleanor, this is a huge disappointment to her dastardly nephew Lord Dargis (Billy Connelly).\n\nNow living it up as the Cat of Carlyle, Garfield has a butler, and an international array of servants and subjects, including Winston, a very English bulldog; McBunny, a Scottish hare; Nigel, a Punjab ferret; Bolere, a Sapnish bull; I Claudius, a Shakepeare quoting mouse and Christophe, a French goose.\n\nMeanwhile Prince is living the simple life of a commoner, hitting the pubs with Jon and Oldie, getting his first taste of lasagne...and loving all of it!\n\nUneasy is the head, however, that wears the crown. Lord Bargis, who is next in line to the estate, wants Prince/Garfield out of the picture. Garfield's bigger, better, more pur-fect world is soon turned upside down in the tale of two kitties!","torrent":{"xt":"urn:btih:8f8cd80e2739e4ed084e972999af97cbbce70b52","amp;dn":"GARFIELD+DOUBLE+BOXSET+IN+XVIDS+BY+JOCKTHERIPPER%40KIDZCORNER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f8cd80e2739e4ed084e972999af97cbbce70b52","infoHashBuffer":{"type":"Buffer","data":[143,140,216,14,39,57,228,237,8,78,151,41,153,175,151,203,188,231,11,82]},"announce":[],"urlList":[]}}