{"title":"BN+ Converter Pro 1.0.6","uid":5233676,"size":707627,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:987eed598381d15d7a7e1a6941a91a67ad14c956&amp;dn=BN%2B+Converter+Pro+1.0.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rtsbnvs","files":1,"time":1261435047,"description":"This program is developed as an easy-to-use, small, but powerful converter. It features a wide variety of tools, including text based conversions from and to binary, ASCII and hex, text hashing and cryptography.\n\n---\n\n\n\n\nVersion 1.0.6 release notes:\n\nToday, may 20th 2009, the new version of BN+ Converter Pro was released. It features a load of new functionality and a few bug fixes. The menu also had an overhaul and should now be more clear for less experienced users. Here you have a list of both the new features in this version and the bugs fixed.\n\nNew features\n* Multi language functionality: You can now view the main interface in both English, Dutch, German and leet. The application will automatically detect your computer language and use it at start-up. You can disable the auto detect option via the options menu, and then choose the start-up language.\n* Advanced cryptography options: Via the options menu you can change the DES and TrippleDES keys and initialization vectors, and configure the AES (Rijndael) salt, password phrase, initialization vector and iterations.\n* An automated update platform: The application will automatically check for updates when an internet connection is present. When there is an update, the application will show you some information about it and provide you with the option to download and install it. You can also manually check for updates via menu -&gt; Help -&gt; Check for updates.\n* Bug report creator: When you find a bug (typo, wrong behaviour, application crash, ect...), you can now easily report it via the build in bug report creator. You can find it in the menu, under Help: Report a bug...\n* Password protection: This feature enables you to protect the application, and the settings (like RSA keys) stored in it, from other people. You can turn it on via the options, in the section utilities.\n\nFixed bugs\n* Hashing of an empty string (This caused the application to crash in v1.0.4, and was therefore disabled in v1.0.5, but now fixed and re-enabled)\n* Auto saving of text (Even when enabled in the options, this would not be done in the previous version)\n\nFurther development\nThese are features that are on the roadmap for future versions of BN+ Converter Pro. Every feature might or might not be implemented, varying on the demand.\n* Create a plug-in system for BN+ Brute Force Hash Attacker and other relevant applications\n* Add build-in help contents\n* Recode the codec system to work text file based (so users can create their own codec's and share them)\n* Redesign the options menu and add live validation to it \n\n---\n\n\n\nRelease date: 2009-05-20\nKnown issues:\n* Setting invalid data in the cryptography options can cause the application to malfunction or to crash\n\nProgram version: 1.0.6\nFront end language: English\nSystem requirements: Win 2000 + .Net Framework 2.0, Win Xp + .Net Framework 2.0, Win Vista\n\nDeveloper: Jeroen De Dauw aka De Dauw Jeroen aka [RTS]BN+VS*\nWritten in: Visual Basic.Net and Visual C#.Net, using Visual Studio 2005 and Visual Studio 2008\nBased upon: BN+ Framework 2.0.3.x\n\n---\n\n\n\n\nThis torrent contains 3 directories, each containing BN+ Converter Pro 1.0.6, but in a different format.\n* Direct run: The exe file and required dll's, you can directly run the exe.\n* Setup: Windows installer file, when run it will provide you with the ability to choose the place of installation and create a shortcut on your desktop.\n* U3: Installation file for U3's. Visit www.u3.com for more information.\n\nFor more information about BN+ Converter Pro, check out the following resources:\n* Official site: http://www.binary-converter.com\n* Manual: http://code.bn2vs.com/viewtopic.php?t=65\n* Release notes: http://code.bn2vs.com/viewtopic.php?p=500#500\n* Blog posts: http://blog.bn2vs.com/tag/binary-converter\n* Dutch support: http://www.helpmij.nl/forum/showthread.php?t=363153\n\n---\n\n\n\nKeywords: Binary, Text, ASCII, conversion, decryption, encryption, Hex, MD5, SHA1, SHA2, SHA256, SHA384, SHA512,  crypt, codec, converter, encrypter, decrypter, Binary translator, Binary converter, Binary encrypter, Binary decrypter, Hex converter, MD5 converter, SHA1 converter, ASCII converter, codec converter, BN Converter, BN converter pro, pro converter, instant decryption, instant decryption, Binary to text, text to Binary, DES, AES, RSA, base64, public key encryption, obfuscation, block ciphers, rijndael, trippleDES.","torrent":{"xt":"urn:btih:987eed598381d15d7a7e1a6941a91a67ad14c956","amp;dn":"BN%2B+Converter+Pro+1.0.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987eed598381d15d7a7e1a6941a91a67ad14c956","infoHashBuffer":{"type":"Buffer","data":[152,126,237,89,131,129,209,93,122,126,26,105,65,169,26,103,173,20,201,86]},"announce":[],"urlList":[]}}