{"title":"Earls Of The Court - S01 - Audio Comedy - MP3 - Slimoo","uid":5475337,"size":76060017,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:99f2b46929a7335e4ac03e312c67060b94fcf792&amp;dn=Earls+Of+The+Court+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":6,"time":1270112652,"description":"Earls Of The Court - Series 01 - Audio Comedy - BBC Radio 4 via DVB-T\n6 x 15 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nEarls Of The Court follows the misadventures of Lloydie and Johnno - two hapless, likeable Australians who came over to London on the great Aussie Pilgrimage.\n\nThe pair met and bonded in the mid-Nineties while living in a crowded house-share in Earl's Court. They spent their time as professional layabouts but, after a couple of years, something rather spoilt the party. They split and hadn't seen each other since - until now. \n\nWhile Johnno is fired from his dead-end office job, the prodigal traveller Lloydie returns from an ill-conceived adventure in the French Alps. The rest of &quot;the gang&quot; have moved on - got proper jobs, started families and headed back home - just these two remain in London. And it's not long before they find each other. \n\nTo Lloydie's delight, Johnno is still living in their old Shepherd's Bush house-share. Johnno lets him stay on the sofa &quot;for a couple of nights&quot; but this stretches into weeks, and it's not long before the rest of the flat-mates conspire to kick out the pair of them. Now seemingly inseparable, they move in with Johnno's Scandinavian girlfriend.\n\nCast:\n\nStewart Wright\nWill Adamsdale\n\n\n\nEarls Of The Court - S01 - E01 - Earls Reunited\nEarls Of The Court - S01 - E02 - The Eklov Experience\nEarls Of The Court - S01 - E03 - Crisis Management \nEarls Of The Court - S01 - E04 - Downward Inflection \nEarls Of The Court - S01 - E05 - The Ides Of March\nEarls Of The Court - S01 - E06 - The Hangover\n.\n\nAudio Format    : MP3\nDuration        : 14mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[b]A number of people are posting my torrents on other trackers.\nI have no problem with that - (Not much need as I already do this) - But a name check would be nice\nI was the one who spent weeks,months,years recording them[/b]\n\n.","torrent":{"xt":"urn:btih:99f2b46929a7335e4ac03e312c67060b94fcf792","amp;dn":"Earls+Of+The+Court+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f2b46929a7335e4ac03e312c67060b94fcf792","infoHashBuffer":{"type":"Buffer","data":[153,242,180,105,41,167,51,94,74,192,62,49,44,103,6,11,148,252,247,146]},"announce":[],"urlList":[]}}