{"title":"(PSX-PSP) Cool Boarders 3,4, &amp; 2001 converted properly (Kingdom-","uid":4641549,"size":441321199,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:9ae1f26d2c096cfab88a91b70ea41be58757661d&amp;dn=%28PSX-PSP%29+Cool+Boarders+3%2C4%2C+%26+2001+converted+properly+%28Kingdom-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"toxicjuggalo","files":4,"time":1231731688,"description":"Will be releasing 1 &amp; 2 as soon as I can get the compatability issue fixed.. Tested and working on CFW 5.00 M33-4 combined with the 500 popsloader and 3.72 POPS.... KloWn\n\nCOOL BOARDERS 3:\n\nCOOL BOARDERS 3 brings the actions and excitement of snowboarding to the PlayStation. Choose from over 13 different riders and 22 boards, and then hit one of the 34 courses. Race through the course as fast as possible in the boarder-cross and slalom events, or concentrate on pulling off big tricks in the halfpipe, slope style, and big air events. For those who want test all of their skills, try the tournament mode and compete in all five events. When competition gets to be too much, try to perfect all of your moves in the practice mode. If your friends think they get down the mountain better than you do, make them put their money where their mouth is with the two-player mode. No matter how you play, the analog control makes taking charge of the action easier than ever. All of the action in COOL BOARDERS 3 will keep boarding bums busy for days.\n\nCOOL BOARDERS 4:\n\nCOOL BOARDERS 4 brings the actions and excitement of professional snowboarding to the PlayStation. Choose from 16 pro riders and 34 boards or create your own rider and board. Then pick one of the 30 courses and race through the course as fast as possible in the downhill and CBX, or concentrate on pulling off big tricks in the halfpipe, slope style, and big air events. For those who want test all of their skills, try the tournament mode and compete in all five events. If your friends think they get down the mountain better than you do, make them put their money where their mouth is with the two-player mode. No matter how you play, the analog control makes taking charge of the action easier than ever. All of the action in COOL BOARDERS 4 will keep boarding bums busy for days.\n\nCOOL BOARDERS 2001:\n\nThe fifth installment of the COOL BOARDERS series, COOL BOARDERS 2001, brings all of the snowboarding action you could ever want to the PlayStation. Choose from one of 10 real boarders: Todd Richards, Barrett Christy, Tara Dakides, Michele Taggart, Nate Cole, Scotty Wittlake, Jeremy Jones, Kevin Jones, Jussi Oksanen, and Travis Parker. If you don't like any of these guys, create your own rider, and then hit the slopes in seven events. CBX, downhill gates, and downhill checkpoint are speed events that require you to be the fastest one down the hill. Halfpipe, big air, board park, and trickmaster are finesse events with lots of big tricks. Have your best buds join in the action with the Two-Player mode. With COOL BOARDERS 2001, you will be pulling off 1080 Japan airs in no time.","torrent":{"xt":"urn:btih:9ae1f26d2c096cfab88a91b70ea41be58757661d","amp;dn":"%28PSX-PSP%29+Cool+Boarders+3%2C4%2C+%26+2001+converted+properly+%28Kingdom-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae1f26d2c096cfab88a91b70ea41be58757661d","infoHashBuffer":{"type":"Buffer","data":[154,225,242,109,44,9,108,250,184,138,145,183,14,164,27,229,135,87,102,29]},"announce":[],"urlList":[]}}