{"title":"Lassie's Christmas Stories - The Timmy Years  DVDRip  DivX","uid":4550155,"size":629622831,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9c92eab0c47542ccd97b1d2469f3418d6d684870&amp;dn=Lassie%5C%27s+Christmas+Stories+-+The+Timmy+Years++DVDRip++DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lee.ka","files":4,"time":1228274320,"description":"Lassie&amp;#039;s Christmas Stories\nNearly everyone knows of Lassie, from the 1938 Saturday Evening Post story, the 1940 novel and the 1943 movie, to the radio shows of 1946-1949, the TV series 1954-1999, and the latest 2006 movie.\n\nDuring Lassie&amp;#039;s run on CBS television from 1954-1971, three episodes were produced for the holidays during the Timmy years (1957-1964), each with the title &quot;A Christmas Story.&quot;  These classics have been digitally remastered.\n\n\nA Christmas Story 1958\nIn saving the life of a three-year-old girl while the Martins are finishing their Christmas shopping in Capitol City, Lassie is seriously injured.  Timmy&amp;#039;s mother discovers the way to find the veterinarian who alone is able to perform the delicate operation to save her life.  With Lassie on the road to recovery and all the neighbors so deeply concerned with her welfare, Christmas takes on even deeper meaning to Timmy and the Martins.\nDVD&gt;DivX/512x384/967kbps/23.976fps/mp3/48KHz/stereo/104Kbps/25min/200Mb\n\nA Christmas Story 1960\nAs Christmas time nears, Timmy and Lassie meet up with a boy and girl new to the neighborhood, and they become friendly.  The boy and girl take Timmy and Lassie to their home, which turns out to be an abandoned shack, with little or no food, and an abandoned car in the yard.  The children&amp;#039;s father rebuffs Timmy and Lassie, telling them the family doesn&amp;#039;t like strangers.  Timmy goes home and tells of the children&amp;#039;s plight.  Ruth makes a food basket, but she too is rebuffed by the father.  Timmy and Lassie, however, manage to smuggle the food to the children, and then they set out to raise money for them for Christmas presents.\nDVD&gt;DivX/512x384/960kbps/23.976fps/mp3/48KHz/stereo/110Kbps/25min/200Mb\n\nA Christmas Story 1961\nLassie and Timmy rescue an old sculptor whose sled overturns and pins him beneath it.  When they see the sculptor&amp;#039;s models spilled out of his bag, they believe him to be Santa Claus, and on Christmas Day he turns out to be one indeed!\nDVD&gt;DivX/512x384/974kbps/23.976fps/mp3/48KHz/stereo/108Kbps/25min/200Mb","torrent":{"xt":"urn:btih:9c92eab0c47542ccd97b1d2469f3418d6d684870","amp;dn":"Lassie%5C%27s+Christmas+Stories+-+The+Timmy+Years++DVDRip++DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c92eab0c47542ccd97b1d2469f3418d6d684870","infoHashBuffer":{"type":"Buffer","data":[156,146,234,176,196,117,66,204,217,123,29,36,105,243,65,141,109,104,72,112]},"announce":[],"urlList":[]}}