{"title":"Cdroller.v8.0.0.0.Incl.Patch.rar","uid":4644618,"size":6280898,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d0feac56bf1ccd2cafc9de8217a86622bc96428&amp;dn=Cdroller.v8.0.0.0.Incl.Patch.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jsph69","files":1,"time":1231839145,"description":"CDRoller is a powerful, easy-to-use and low-cost toolset for CD/DVD data recovery. CDRoller supports industry-standard ISO 9660 file system, including Microsoft's extensions for long file names support, so-called Joliet extensions. CDRoller also supports the discs formatted in UDF file system, including versions 1.02, 1.50, 2.0, 2.01 and also so-called UDF Bridge format. Support of wide set of CD, CD-R, CD-RW and DVD formats such as: CD-DA, CD-ROM, CD-WO, CD-ROM XA and Mixed-Mode CD, Stamped multisession CD, CD-MRW (&quot;Mt. Rainier&quot; CD-RW), DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+RW, DVD-RAM.\n\nFeatures:\nÃ‚Â· Effectively retrieves the data off the discs created by &quot;drag and drop&quot; CD/DVD writing software, such as well-known Roxio (Adaptec) and Ahead Nero software packages, CeQuadrat's PacketCD, Instant Write, B's CLiP and others.\nÃ‚Â· Recovers CD and DVD data created by standalone devices that record directly onto disks, including: Sony digital cameras, DVD camcorders, personal DVD recorders, etc.\nÃ‚Â· &quot;On-the-fly&quot; unpacks the files initially compressed by Roxio (Adaptec) DirectCD.\nÃ‚Â· Retrieves back up files from the discs recorded in several stages (multisession discs).\nÃ‚Â· Includes a built-in UDF Reader. There is no need to install a third-party software, for example Roxio (Adaptec) UDF Reader driver.\nÃ‚Â· Finds and retrieves the lost files on UDF discs, including: accidently deleted files, files on quick-formatted disc, files on incorrectly closed disc, etc.\nÃ‚Â· Rescues the data from scratched, damaged or defective discs.\nÃ‚Â· Provides direct access to the hardware, bypassing the Windows File System. Looks for the lost tracks (sessions) every time when you insert a new disc into the drive\nÃ‚Â· Digitally extracts audio tracks into a wide set of wave formats.\nÃ‚Â· Tests CD readability.\nÃ‚Â· Extracts ISO Image file.\nÃ‚Â· Catalogs files and folders into CD library.\nÃ‚Â· All features are integrated into a common and easy-to-use intuitive shell. User Interface is similar to well-known Windows 95 File Manager (Windows Explorer), with file property pages, pop-up (context) menus and drag-and-drop support.\n\nSupport of wide set of CD, CD-R, CD-RW and DVD formats such as:\n* CD/DVD format CD-DA,\n* CD/DVD format CD-ROM,\n* CD/DVD format CD-WO,\n* CD/DVD format CD-ROM XA and Mixed-Mode CD,\n* CD/DVD format Stamped multisession CD,\n* CD/DVD format CD-MRW (&quot;Mt. Rainier&quot; CD-RW),\n* CD/DVD format DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+RW, DVD-RAM.\n\nChanges in Version 8.00 :\n* Current version of CDRoller.\n* Added support of Blu-ray discs (BDs) and HD DVD. A new media formats are now supported by all program features, including:\n- UDF Reader,\n- Disc Analysis tools,\n- Scan UDF Disc,\n- Data Recovery options,\n- Raw ISO Data Identifier,\n- Data Burner and Eraser,\n- Drive Capabilities Inspector,\n- ISO Image File Extractor\n* A list of supported file systems expanded. Added support of FAT32 for BD-RE and DVD-RAM discs. Includes a recovery of accidently deleted files. This can be useful if you selected FAT32 file system when formatting BD-RE or DVD-RAM discs under Windows XP or Vista.\n* Added support of SPTD (SCSI Pass Through Direct) layer as alternative method for hardware access under Windows 2000/XP/2003/Vista. The key feature of SPTD is an ability to avoid a conflict with 'malicious' filter drivers that can be installed by 3-rd party software.\n* Recover DVD Video option is significantly updated. Added support of mini DVD-R, DVD-RW, DVD+RW and DVD+R DL, created by ACVHD camcorders.\n* Forced scan updated. Added quick identification of M2TS files, recorded by ACVHD camcorders.\n* DVD authoring engine updated. Better DVD-Video compatibility.\n* CD/DVD/BD burner and eraser updated. Serious improvements and fixes in the data burning engine.\n* A new Select Destination Folder dialog released. Now, it offers a different ways to choose the destination folder, where your recovered data will be saved. In addition to a simple navigation through the folders tree, it allows you to:\n- paste the selected path from the Address bar of your Windows Explorer,\n- select the destination path from the Recently Used List,\n- type a new path manually.\n* Fixed a bug while getting vendor info for SATA and USB computer drives.\n\nHomepage: &lt;a href=&quot;\nhttp://www.cdroller.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cdroller.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:9d0feac56bf1ccd2cafc9de8217a86622bc96428","amp;dn":"Cdroller.v8.0.0.0.Incl.Patch.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0feac56bf1ccd2cafc9de8217a86622bc96428","infoHashBuffer":{"type":"Buffer","data":[157,15,234,197,107,241,204,210,202,252,157,232,33,122,134,98,43,201,100,40]},"announce":[],"urlList":[]}}