{"title":"Robie Robertson Contact From The Underworld Of Red Boy","uid":5521930,"size":87357265,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d393d7bc8f68e7f41907827ff02aae121dbb008&amp;dn=Robie+Robertson+Contact+From+The+Underworld+Of+Red+Boy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"granby342","files":11,"time":1272639249,"description":"Genres: Rock, Music, Singer/Songwriter \nReleased: Feb 26, 1998 \n\nContact from the Underworld of Redboy is an album by Robbie Robertson, published in 1998 by Capitol Records. The album is composed of music inspired by Native American music (including traditional Native American songs and chants) as well as modern rock, often integrated together, and features many guest artists.\n\n[edit] Track listing\nH. Bernstein and Robertson, &quot;The Sound is Fading&quot; (5:00) Traditional: Leah Hicks-Manning \n&quot;The Code of Handsome Lake&quot; (6:11) \n&quot;Making A Noise&quot; (5:11) \nTim Gordine and Robertson, &quot;Unbound&quot; (4:35) \nLeonard Peltier, Marius de Vries and Robertson, &quot;Sacrifice&quot; (6:18) \nMarius de Vries and Robertson, &quot;Rattlebone&quot; (4:26) \nVirdell Primeaux and Johnny Mike, &quot;Peyote Healing&quot; (6:10) \nTim Gordine and Robertson, &quot;In The Blood&quot; (4:35) \nJim Wilson and Robertson, &quot;Stomp Dance (Unity)&quot; (4:49) Traditional: The Six Nations Women Singers \nHoward Bernstein and Robertson, &quot;The Lights&quot; (5:54) \nHoward Bernstein and Robertson, Bonus Track &quot;Take Your Partner By The Hand (Red Alert Mix)&quot; (6:43) (Produced by DJ Premier)\n\nReleased 1998 \nLength 59:52 \n\nThroughout his solo career, Robbie Robertson has been as fascinated with sonics as he was with songwriting, so perhaps it wasn't entirely surprising that he collaborated with techno DJ/producer Howie B and remixer Marius de Vries on his fourth album, Contact From the Underworld of Redboy. Anyone familiar with his moody, atmospheric solo efforts will realize that there's a bigger jump between Music From Big Pink and Robbie Robertson than there is between the Daniel Lanois-produced Robbie Robertson and the ambient-flavored Contact, but the electronic textures and dance beats still may come as a shock to some. The electronics are interwoven with blues, folk, country, and rock, as well as American Indian music. And, as on Music for the Native Americans, Robertson is primarily concerned with American Indians throughout Contact, whether it's through the chants of &quot;Peyote Healing&quot; or the protest of &quot;Sacrifice,&quot; which features Leonard Peltier -- a Native American who has been imprisoned since 1976 on charges of murder many believe are fabricated -- on a telephone call. Both his lyrical and musical concerns can get bogged down in their own pretensions, but often, the results are provocative and unique.\n\nPlease Seed...Seed...Seed","torrent":{"xt":"urn:btih:9d393d7bc8f68e7f41907827ff02aae121dbb008","amp;dn":"Robie+Robertson+Contact+From+The+Underworld+Of+Red+Boy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d393d7bc8f68e7f41907827ff02aae121dbb008","infoHashBuffer":{"type":"Buffer","data":[157,57,61,123,200,246,142,127,65,144,120,39,255,2,170,225,33,219,176,8]},"announce":[],"urlList":[]}}