{"title":"Controversies between Leibniz and his Contemporaries.PDF","uid":4942861,"size":3082964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e65aba5e2d317df9da1cc6a8f910ec01cf57cab&amp;dn=Controversies+between+Leibniz+and+his+Contemporaries.PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Gorra09","files":1,"time":1244529679,"description":"Infinitesimal Differences: Controversies between Leibniz and his Contemporaries \n\nby Ursula Goldenbaum | Publisher: Walter de Gruyter; illustrated edition edition (August 19, 2008) | 329 pages | ISBN: 3110202166 | PDF |\n\nThe essays offer a unified and comprehensive view of 17th century mathematical and metaphysical disputes over the status of infinitesimals, particularly the question whether they were real or mere fictions. Leibnizs development of the calculus and his understanding of its metaphysical foundation are taken as both a point of departure and a frame of reference for the 17th century discussions of infinitesimals, that involved Hobbes, Wallis, Newton, Bernoulli, Hermann, and Nieuwentijt. Although the calculus was undoubtedly successful in mathematical practice, it remained controversial because its procedures seemed to lack an adequate metaphysical or methodological justification. The topic is also of philosophical interest, because Leibniz freely employed the language of infinitesimal quantities in the foundations of his dynamics and theory of forces. Thus, philosophical disputes over the Leibnizian science of bodies naturally involve questions about the nature of infinitesimals. The volume also includes newly discovered Leibnizian marginalia in the mathematical writings of Hobbes.\n\n","torrent":{"xt":"urn:btih:9e65aba5e2d317df9da1cc6a8f910ec01cf57cab","amp;dn":"Controversies+between+Leibniz+and+his+Contemporaries.PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e65aba5e2d317df9da1cc6a8f910ec01cf57cab","infoHashBuffer":{"type":"Buffer","data":[158,101,171,165,226,211,23,223,157,161,204,106,143,145,14,192,28,245,124,171]},"announce":[],"urlList":[]}}