{"title":"Bad Santa(2003)DVDRip.AC3(ENG)-DROCK","uid":6095630,"size":734478336,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e80205da28322138e32d3be4c5519512fdd21a8&amp;dn=Bad+Santa%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1294761645,"description":"The Christmas season just got a lot less joyous in this very dark comedy. Willie T. Stokes (Billy Bob Thornton) is a con man and a thief who teams up with his friend Marcus (Tony Cox), a midget, for a very special scam each year during the holiday season. Willie gets a job as Santa Claus at a shopping mall, his pal tags along as an elf, and they use their employee status to crack mall security and rob stores blind just before Christmas. However, there's one flaw to this plan -- Willie is a bitter, foul-mouthed and perpetually grouchy alcoholic who doesn't care for kids, and it's all he can do to keep himself from getting fired while on the job. The mall's manager (John Ritter, in his last film appearance) is certain something's wrong with the Santa he's hired, so he asks the mall's chief of security (Bernie Mac) to do some research on Willie. Meanwhile, one of the kids Willie is forced to talk to becomes a regular customer; overweight, awkward, and the frequent target of bullies, the boy manages to arouse something like sympathy from Willie, who tries to give him some advice and develops something vaguely resembling Christmas sprit along the way. Bad Santa was directed by Terry Zwigoff, who enjoyed previous success with Crumb and Ghost World.\n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:9e80205da28322138e32d3be4c5519512fdd21a8","amp;dn":"Bad+Santa%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e80205da28322138e32d3be4c5519512fdd21a8","infoHashBuffer":{"type":"Buffer","data":[158,128,32,93,162,131,34,19,142,50,211,190,76,85,25,81,47,221,33,168]},"announce":[],"urlList":[]}}