{"title":"IDM UltraEdit 17.0.0.1041 Portable [ak]","uid":6380301,"size":19660638,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9fe616403def06e1de1ccd05e31c0d08b1c5c199&amp;dn=IDM+UltraEdit+17.0.0.1041+Portable+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1305007702,"description":"IDM UltraEdit 17.0.0.1041 Portable\n\nUltraEdit is used across a diverse range of industries, from professional writers, researchers and journalists to advanced programmers, database managers and web developers.UltraEdit is what you're looking for. UltraEdit is the ideal text, HEX, HTML, PHP, Java, javascript, Perl, and Programmer's editor. It's versatile and easy to use. UltraEdit is specially designed for inputting and editing text and code, UltraEdit supports configurable syntax highlighting and code structuring for most any programming languages.With its clear layout and powerful project and workspace features, it can handle complex and sophisticated software-development projects. Despite UltraEdit's vast range of features, UltraEdit never feels overwhelming. It's flexible and easy to customize, handles files in excess of 4GB, and the polished user interface provides easy access to the most important options.\n\n\n\n\nKey features:\nÃ‚Â» Code folding\nÃ‚Â» Supports 64-bit file handling (standard) on 32-bit Windows platforms (Windows 2000 and later)\nÃ‚Â» Unicode support\nÃ‚Â» Disk based text editing and large file handling - supports files in excess of 4GB, minimum RAM used even for multi-megabyte files\nÃ‚Â» Mulitline find and replace dialogs for all searches (Find, Replace, Find in Files, Replace in Files)\nÃ‚Â» 100,000 word spell checker, with foreign languages support\nÃ‚Â» Syntax highlighting - configurable, pre-configured for C/C++, VB, HTML, Java, and Perl, with special options for FORTRAN and LaTex\nÃ‚Â» FTP client built in to give access to FTP servers with multiple account settings and automatic logon and save\nÃ‚Â» SSH/Telnet window\nÃ‚Â» Project / workspace support\nÃ‚Â» Environment Selector\nÃ‚Â» Integrated scripting language to automate tasks\nÃ‚Â» Configurable keyboard mapping\nÃ‚Â» Column / block mode editing\nÃ‚Â» Hexadecimal editor allows editing of any binary file, shows binary and ASCII view\nÃ‚Â» Named templates\nÃ‚Â» HTML toolbar preconfigured for popular HTML functions\n\nHome Page - http://www.ultraedit.com/products/ultraedit.html\n\n","torrent":{"xt":"urn:btih:9fe616403def06e1de1ccd05e31c0d08b1c5c199","amp;dn":"IDM+UltraEdit+17.0.0.1041+Portable+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fe616403def06e1de1ccd05e31c0d08b1c5c199","infoHashBuffer":{"type":"Buffer","data":[159,230,22,64,61,239,6,225,222,28,205,5,227,28,13,8,177,197,193,153]},"announce":[],"urlList":[]}}