{"title":"Outlaws - Phil Daniels","uid":4512780,"size":3247164790,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a0a8b61cfe580070184ca24168f493e63f2ef0cd&amp;dn=Outlaws+-+Phil+Daniels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesBolivardiGriz","files":13,"time":1226851405,"description":"Drama set in a criminal law firm, where trainee Theodore Gulliver discovers he has a lot to learn from hardened pro Bruce Dunbar. Phil Daniels and Ray Emmet Brown star\n\nCast:Phil Daniels as Bruce Dunbar, Ray Emmet Brown as Theodore Gulliver, Georgia Mackenzie as Sarah, Annabelle Apsion as CS Ross, Danny Cunningham as DC Simons, Craig Parkinson as Spinky Sutherland\n\n\n\nSeason 1 Episode 12: The Decline of English Murder (2004) \nAn old friend of Dunbar tries to convince him to come and work for a different company, where the money is better but the cases aren&amp;#039;t so cutting-edge. Meanwhile, Gulliver offers his colleague a juicy murder case - but the accused is someone he&amp;#039;d rather not be defending a second time. Last in series, starring Phil Daniels and Ray Emmet Brown.\n \nSeason 1 Episode 11: A Dying Breed (2004) \nDunbar tries to secure a potentially lucrative client despite Gulliver&amp;#039;s objections that the firm in question is run by crooks. Meanwhile, Sarah uses unconventional tactics in court to help a single mother with financial problems. Phil Daniels, Georgia MacKenzie and Ray Emmet Brown star.\n \nSeason 1 Episode 10: Damaged Goods (2005) \nDunbar voices his concerns when Sarah gets the chance to train as a district judge. He also takes on the case of a teenage hooligan, and wins him a reprieve by agreeing to act as his mentor. Phil Daniels, Georgia MacKenzie and Louis Dower star.\n \nSeason 1 Episode 9: A Life of Grime (2004) \nGulliver receives a visit from his father, just as he&amp;#039;s starting to feel weighed down by the pressures of work. Meanwhile, Dunbar appears in court for not making sufficient maintenance payments to his ex-wife. Phil Daniels and Ray Emmet Brown star.\n \nSeason 1 Episode 8: The Power and the Glory (2004) \nGulliver is assigned to the case of a Moroccan businessman brought in on terrorism charges, and uncharacteristically goes out of his way to prove the man innocent. Meanwhile, Dunbar takes an altogether less rewarding brief involving a frozen steak and an alleged assault. Phil Daniels and Ray Emmet Brown star.\n \nSeason 1 Episode 7: Three Monkeys (2004) \nGulliver takes on the case of a blind woman charged with distributing racist propaganda, while Dunbar meets a woman whose husband habitually beats her - but she loves him so much, she always refuses to press charges against him. Phil Daniels and Ray Emmet Brown star.\n \nSeason 1 Episode 6: Sins of the Father (2004) \nDunbar gets behind on the maintenance payments for his self-harming daughter and is forced to face up to his responsibilities when she takes a minor overdose. Meanwhile, a teenage client goes on a crack-fuelled rampage and demands his presence before he will talk to the police, and Gulliver tries to elicit sympathy for a drug dealer with Aids. Drama, starring Phil Daniels and Ray Emmet Brown.\n \nSeason 1 Episode 5: The Soft Spot (2004) \nDunbar takes on the case of a prostitute accused of assaulting her client after an unusual accident. Meanwhile, Gulliver is called out to help an elderly man charged with perverting the course of justice - but his patience is wearing thin. Phil Daniels and Ray Emmet Brown star.\n \nSeason 1 Episode 4: The Value of Nothing (2004) \nDunbar&amp;#039;s office is burgled, leaving him furious and determined to track down the perpetrator, while a smart female lawyer suggests Gulliver switch sides and join the Crown Prosecution Service. Phil Daniels and Ray Emmet Brown star.\n \nSeason 1 Episode 3: Little Criminals (2004) \nGulliver angers Dunbar by trying to help a pimp&amp;#039;s under-age girlfriend and Sarah makes herself unpopular by upholding the law. Ray Emmet Brown and Georgia MacKenzie star.\n \nSeason 1 Episode 2: TIC in the Box (2004) \nDunbar gives fledgling lawyer Gulliver a dressing down for his guileless dealings with the police, but finds his own attempts at bargaining, by turning one of his clients into an informer, backfire disastrously. Drama, starring Phil Daniels and Ray Emmet Brown.\n \nSeason 1 Episode 1: The Good, the Bad and the Ugly (2004) \nNew drama series set in a criminal law firm, where trainee Theodore Gulliver discovers he has a lot to learn from hardened pro Bruce Dunbar, a man well-versed in the worldy wise ways of the Magistrates&amp;#039; Court. Phil Daniels, Ray Emmet Brown, Georgia MacKenzie and Annabelle Apsion star.\n","torrent":{"xt":"urn:btih:a0a8b61cfe580070184ca24168f493e63f2ef0cd","amp;dn":"Outlaws+-+Phil+Daniels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0a8b61cfe580070184ca24168f493e63f2ef0cd","infoHashBuffer":{"type":"Buffer","data":[160,168,182,28,254,88,0,112,24,76,162,65,104,244,147,230,63,46,240,205]},"announce":[],"urlList":[]}}