{"title":"NEXUS - Nowe Czasy. Numer 56 i 57 [POLISH EDITION]","uid":5963529,"size":446831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a106bdfd85c0609beefd7be1bac86796fe289383&amp;dn=NEXUS+-+Nowe+Czasy.+Numer+56+i+57+%5BPOLISH+EDITION%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1290031336,"description":"NEXUS - Nowe Czasy. Numer 56 i 57\nStron 60\nFormat A4\nISSN 1506-0284\nStrona www: http://www.nexus.media.pl/\n\nMagazyn prezentujacy kontrowersyjne teorie i poglady zwalczane przez glowny nurt nauki i media. Porusza tematy dotyczace zdrowia, teorii spiskowych, ufo, ukrywanych technologi (free energy).\n\nNEXUS - Nowe Czasy numer 56\nRAPORTY\nPrzezywajaca od poczatku XX wieku wzrost zainteresowania po kilku wiekach jej deprecjonowania dywinacja (wrozbiarstwo) znajduje coraz wiecej zastosowan i obecnie coraz czesciej z duzym powodzeniem wykorzystywana jest do prognozowania dzialan w biznesie.\n\nAmy Goodman, John Perkins\nWYZNANIA EKONOMISTY OD BRUDNEJ ROBOTY\nWywiad z ekonomista Johnem Perkinsem, ktory przez wiele lat dzialal w roznych krajach promujac interesy wielkich amerykanskich korporacji, po czym przewartosciowal swoje zycie i obecnie ujawnia kulisy ich przestepczych dzialan, ktorych celem jest nieustanna ekspansja i maksymalizacja zyskow kosztem interesow lokalnych spolecznosci i srodowisk.\n\nDr Tullio Simoncini\nCZY POSPOLITY GRZYB MOZE BYC PRZYCZYNA RAKA?\nProwadzone przez wiele lat badania naukowe i kliniczne, nie tylko przez autora artykulu, ale i innych badaczy onkologow, dowodza, ze jedna z glownych przyczyn raka jest infekcja pospolicie wystepujacymi grzybami, w tym Candida albicans, ktora mozna skutecznie leczyc wodoroweglanem sodu, ktorego nie mozna opatentowac.\n\nNAUKA: przeglad interesujacych nowinek z pogranicza nauki\nOmowienie podstaw teoretycznych i budowy skonstruowanego przez Williama Lyne'a bardzo prostego w konstrukcji i dzialaniu pieca wodorowego, ktory wykorzystujac proces rozdzielania i laczenia czasteczki wodoru pozwala uzyskiwac na wyjsciu ponad tysiac razy wiecej energii niz jej potrzeba do przeprowadzenia tego procesu.\n\nWalter Last\nENERGIA SEKSUALNA A ZDROWIE I DUCHOWOSC, cz. 2 (dokonczenie)\nWywodzace sie jeszcze ze starozytnosci tradycje duchowe oraz nowe sposoby odbywania stosunkow seksualnych z naszymi partnerami oferuja rozwiazania, ktore umozliwiaja pokonywanie licznych problemow ze zdrowiem, jak rowniez zwiekszenie witalnosci i wydluzenie zycia.\n\nDr Bjorn J. Overbye\nWZGLEDNOSC EINSTEINA - FIZYKA ILUZJI, cz. 1\nRosnaca liczba odkryc naukowych dowodzi, ze interpretacja fizycznej rzeczywistosci oraz zachodzacych w niej zjawisk w oparciu o powszechnie akceptowana teorie wzglednosci Einsteina, przysparza wiecej problemow, niz ich rozwiazuje, co stawia jej prawdziwosc pod znakiem zapytania.\n\nDr Steven M. Greer\nPOWODY UKRYWANIA PRAWDY O UFO\nGlownym powodem, dla ktorego wciaz nie ujawnia sie oficjalnie informacji na temat UFO, jest dazenie wtajemniczonych elit do zachowania wladzy oraz niechec kompleksu militarno-przemyslowego do dzielenia sie z kimkolwiek zwiazanymi z tymi pojazdami technologiami.\n\nWaldemar Witkowski\nTAJEMNICE ISTNIENIA - DOBRO I ZLO, cz. 27\nAby moc doswiadczac zycia, konieczne jest istnienie przeciwienstw, bowiem gdyby wszystko bylo takie samo, nie byloby tworzenia i doswiadczania jego efektow. Pojecia dobra i zla sa jednym z wielu dualizmow, ktore maja doniosly wplyw na nasze zycie i stanowia podstawe licznych religii i filozofii.\n\nSTREFA MROKU: dziwne opowiesci z nie tego swiata\nW tym numerze przedstawiamy dwie wiadomosci, z ktorych jedna poswiecona jest niezwyklym wyczynom hinduskich sztukmistrzow, a druga rozwazaniom na temat mitycznego ladu zwanego Hyperborea.\n\n\nNexus Nr 57 (1/2008)\n\nWIESCI Z GLOBALNEJ WIOSKI\nPrzeglad wiadomosci, ktorych prawdopodobnie nie czytaliscie.\n\nDaniel Estulin\nPLANY GRUPY BILDERBERG WOBEC SWIATA - 2007\nUnikajaca rozglosu grupa Bilderberg, ktora spotyka sie co roku w roznych miejscach na swiecie, konferowala w roku 2007 w Turcji. To spotkanie poswiecone bylo glownie prezydencji Banku Swiatowego, stanowisku Rosji w sprawie energii, przyszlosci demokracji, fiasku kierowanej przez USA misji sil NATO w Afganistanie oraz innym waznym problemom wspolczesnego swiata.\n\nSherrill Sellman\nELEKTROSKAZENIE, HORMONY I RAK\nGenerowane przez telefony komorkowe, wieze przekaznikowe oraz urzadzenia elektryczne promieniowanie elektromagnetyczne wplywa szkodliwie na nasze zdrowie, zaklocajac dzialanie hormonow oraz przebieg procesow biochemicznych, co objawia sie roznymi dolegliwosciami, z nowotworami wlacznie.\n\nJoseph G. Hattersley\nLECZENIE CHOROBY ALZHEIMERA WITAMINA B12\nTylko niewielu lekarzy wie, ze wysokie dawki witaminy B12 moga zapobiegac a nawet odwracac symptomy choroby Alzheimera oraz innych zaburzen umyslowych. Te sytuacje jeszcze bardziej pogarszaja postanowienia Codexu Alimentarius, ktore ograniczaja dostep do stosowanych w terapii witaminowej jej wysokich dawek.\n\nNAUKA: przeglad interesujacych nowinek z pogranicza nauki\nPrezentacja sylwetek dwoch wybitnych postaci, ktore polozyly fundamenty pod rozwoj bioenergoterapii, genialnego szesnastowiecznego alchemika i lekarza Theophratusa Bombastusa von Hohenheima zwanego Paracelsusem oraz dziewietnastowiecznego niemieckiego doktora nauk przyrodniczych i teologii barona Karla von Reichenbacha.\n\nEdward F. Malkowski\nTOPNIENIE TAJEMNICY WIELKIEJ EPOKI LODOWCOWEJ\nRozpoczete w jeszcze XIX wieku badanie okresow zlodowacen zaowocowalo wieloma niezwyklymi odkryciami oraz teoriami, jednak uczeni do dzisiaj nie sa zgodni w sprawie tego, co je powoduje i kiedy rozpocznie sie kolejna epoka lodowcowa.\n\nDr Bjorn J. Overbye\nWZGLEDNOSC EINSTEINA - FIZYKA ILUZJI, cz. 2 (dokonczenie)\nTworzac swoje teorie wzglednosci, Einstein staral sie zrealizowac dawne marzenie w postaci opisania sil natury w formie rownan geometrycznych, jednak nie udalo mu sie nawet wyjasnic natury fizycznego wszechswiata, tak jak potrafi to zrobic nierelatywistyczna fizyka Newtona.\n\nWaldemar Witkowski\nTAJEMNICE ISTNIENIA - ZBIOROWY UMYSL, cz. 28\nPodczas naszego zycia dolaczamy sie do roznych egregorycznych struktur, ktore wspieraja nas w tym, co robimy, gdy dzialamy zgodnie z ich schematami i programami, ale gdy chcemy sie od nich uwolnic, rzucaja nam &quot;klody po nogi&quot;, nie chcac stracic tak cennego dla siebie zywiciela.\n\nSTREFA MROKU: dziwne opowiesci z nie tego swiata\nW tym numerze przedstawiamy dodatkowe informacje przekazane autorom strony internetowej Project Camelot przez enigmatycznego demaskatora ukrywajacego sie pod pseudonimem &quot;Henry Deacon&quot; dotyczace alternatywnych linii czasu, nadchodzacej globalnej katastrofy i innych kontrowersyjnych zagadnien.","torrent":{"xt":"urn:btih:a106bdfd85c0609beefd7be1bac86796fe289383","amp;dn":"NEXUS+-+Nowe+Czasy.+Numer+56+i+57+%5BPOLISH+EDITION%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a106bdfd85c0609beefd7be1bac86796fe289383","infoHashBuffer":{"type":"Buffer","data":[161,6,189,253,133,192,96,155,238,253,123,225,186,200,103,150,254,40,147,131]},"announce":[],"urlList":[]}}