{"title":"Late of the Pier - Space and the Woods","uid":4879885,"size":100939780,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a179250e3650a07fbc3e39166dc63a16f30fb4e5&amp;dn=Late+of+the+Pier+-+Space+and+the+Woods&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1241326663,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Space and the Woods&quot; is a song released by UK band Late of the Pier on 5 March 2007. It was released on 500 limited edition 7&quot; records.\n\nThe single and b-side are different recordings to those that appeared on the Zarcorp Demo. Notably, &quot;Heartbeat, Flicker, Line&quot; was given a definite name, previously known to fans as &quot;7Beat&quot; or &quot;Heartbeat&quot;. The b-side was later re-recorded and became the lead single for their debut album, Fantasy Black Channel.\n\nThe song is currently available as a free download via the band's MySpace page and Last.fm.\n\nFantasy Black Channel is the debut album by Castle Donington fourpiece Late of the Pier, released on Parlophone Records.\n\nIn May 2008 the band announced the album's title via a Myspace bulletin; it was released on August 11, 2008.\n\nIt reached 28 on the UK Album Chart.\n\nThe album was released on January 13, 2009 in the United States.\n\nThe album was very well received by critics, receiving an 81/100 on Metacritic.\n\nLate of the Pier are a four-piece indie electronic band from Castle Donington, England, currently signed to Parlophone Records. They have released five singles to date. Their album Fantasy Black Channel was released on 11 August 2008.\n\nThey have garnered a large teenage fanbase from night clubs such as All Ages club, Filthy Few, Pat and Trevor, Death Disco and Transparent. They played the first ever Underage Festival, in August 2007.\n\nLead singer Samuel Eastgate also has a side-project La Priest, often written incorrectly as LA Priest. He has numerous productions and has made several remixes, as well as having the song &quot;Engine&quot; remixed by Erol Alkan and released via Alkan's Phantasy Sound label.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a179250e3650a07fbc3e39166dc63a16f30fb4e5","amp;dn":"Late+of+the+Pier+-+Space+and+the+Woods","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a179250e3650a07fbc3e39166dc63a16f30fb4e5","infoHashBuffer":{"type":"Buffer","data":[161,121,37,14,54,80,160,127,188,62,57,22,109,198,58,22,243,15,180,229]},"announce":[],"urlList":[]}}