{"title":"U2 - The Joshua Tree (Classic Albums) [DVDRip]","uid":5760010,"size":523845674,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a18cfb976b9e7fd7ff31fcd1701bb49604647c49&amp;dn=U2+-+The+Joshua+Tree+%28Classic+Albums%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xylolz","files":2,"time":1281696751,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0268226/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0268226/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Classic-Albums-U2-Joshua-Tree/dp/6305772665&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Classic-Albums-U2-Joshua-Tree/dp/6305772665&lt;/a&gt;\n\nXVID, 528x384, Qf=0.21, 128 kbs (AC3), 60 minutes\n\nAmazon.com\nAn outstanding entry in the Classic Albums video series, this hourlong documentary, produced in 1999, assembles the creators of U2's The Joshua Tree to comment about the musical magic that occurred a dozen years earlier in a home studio in Dublin. Merging past and present, coproducers Daniel Lanois and Brian Eno, mixer Steve Lillywhite, and guitarist The Edge isolate separate tracks on the album's master tapes to illustrate how some of U2's greatest songs were layered with each individual's crucial contributions. Bono listens in while Lanois deconstructs the masters, appearing genuinely shy about his vocal tracks but eloquent in describing the album as &quot;not Irish at all&quot; in its innovative sound, but &quot;very Irish&quot; in terms of the emotions that inspired it. Later, The Edge describes the &quot;cinematic&quot; sound of the album, intended to transport the listener to a specific physical location based on each song's mood and atmosphere.\nBassist Adam Clayton and drummer Larry Mullen weigh in with illuminating comments, and the hour offers an abundance of video excerpts, concert footage, and memorable anecdotes. Eno sets the record straight on the torturous process of recording &quot;Where the Streets Have No Name&quot; (he almost &quot;accidentally&quot; erased the master tape in hopes of starting from scratch), and Bono admits to a heavy Led Zeppelin influence on &quot;Bullet the Blue Sky.&quot; Archival footage shows the recording in progress (one wishes there were more of it), and what emerges from this collective reminiscence is an enlightening study of mutual chemistry and fruitful collaboration. Upon viewing this video, another listening to The Joshua Tree will be more rewarding than ever. --Jeff Shannon\n\nProduct Description\nAfter toiling for years as an underground cult favorite with a rabidly devoted fan base, Irish rock band U2 finally broke through to mainstream success on the strength of their 1987 opus THE JOSHUA TREE. Released in March of that year, THE JOSHUA TREE became U2's first number-one album and won a Grammy Award for Album of the Year. The record's crossover appeal stems from its emotional exploration of universal topics such as love (&quot;With or Without You&quot;), death (&quot;One Tree Hill&quot;), and spiritual longing (&quot;I Still Haven't Found What I'm Looking For&quot;) without sacrificing any of the trademark social consciousness of the band's earlier albums (&quot;Bullet the Blue Sky,&quot; &quot;Mothers of the Disappeared&quot;). This episode of the CLASSIC ALBUMS series details the making of U2's chart-topping album through interviews with band members, archival film footage, and live performances. Rating: Not Rated Content: n/a Runtime: 60 minutes DVD Code: Region 1 US, CA Genre: Musical &amp; Performing Arts Color: Color Extra Info: DVD Features: Keep Case Full Frame - 1.33 Audio: Dolby Digital 2.0 Stereo - English EDITORIAL REVIEWS: ADDITIONAL PRODUCTION NOTES: Director: Producer:","torrent":{"xt":"urn:btih:a18cfb976b9e7fd7ff31fcd1701bb49604647c49","amp;dn":"U2+-+The+Joshua+Tree+%28Classic+Albums%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a18cfb976b9e7fd7ff31fcd1701bb49604647c49","infoHashBuffer":{"type":"Buffer","data":[161,140,251,151,107,158,127,215,255,49,252,209,112,27,180,150,4,100,124,73]},"announce":[],"urlList":[]}}