{"title":"Boys from the blackstuff","uid":6369289,"size":7442945055,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a4fc6a000aeeab642c4c0f5274110257b006e5ee&amp;dn=Boys+from+the+blackstuff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Spoonity","files":-1,"time":1304620546,"description":"The television play The Black Stuff was originally written by Bleasdale for BBC1's Play for Today anthology series in 1978. After filming however, the play languished untransmitted until being screened on 2 January 1980. It concerned a group of Liverpudlian tarmac layers (hence slang: 'the black stuff') on a job near Middlesbrough.\n\nThe acclaim that The Black Stuff received on its eventual transmission led to the commissioning of the sequel serial, of which Bleasdale had already written a considerable amount.\n\nThe series Boys from the Blackstuff follows the stories of the five now unemployed men who lost their jobs due to the events of the original play The Blackstuff. Set in Bleasdale's home city of Liverpool, and reflecting many of his own experiences of life in the city, each episode focuses on a different member of the group. The series was highly acclaimed for its powerful and emotional depiction of the desperation wreaked by high unemployment and a subsequent lack of social support. Although the series is and was noted by many reviewers as a critique of the Margaret Thatcher era, which was seen as being responsible for the fate of many of the unemployed lower and working classes, particularly in the North of England (and in fact fuelling the North-South divide), most of the series had actually been written in 1978 during Labour's James Callaghan's prime ministership, therefore preceding Thatcher's Britain by a year.\n\nHope everyone enjoys it!  Please seed!\n\nP.S  I grew up in the Dingle where this is filmed.","torrent":{"xt":"urn:btih:a4fc6a000aeeab642c4c0f5274110257b006e5ee","amp;dn":"Boys+from+the+blackstuff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4fc6a000aeeab642c4c0f5274110257b006e5ee","infoHashBuffer":{"type":"Buffer","data":[164,252,106,0,10,238,171,100,44,76,15,82,116,17,2,87,176,6,229,238]},"announce":[],"urlList":[]}}