{"title":"P3D FSFlyingSchool_Pro_2014_P3D 2.2 UPDATE","uid":10236941,"size":81929004,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a5898b9a462a0758c00a7f2f15e6cd2ff58df5f9&amp;dn=P3D+FSFlyingSchool_Pro_2014_P3D+2.2+UPDATE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kandoit","files":-1,"time":1401151363,"description":"THIS IS UPDATE TO 2013 P3D PR0\n\nNew features in FSFlying School Pro\n \nOn Approach feature\n\nWe all know we need to practice, practice, practice, our approaches and landings.\nIt's never been easier with this unique new feature for Prepar3D!\nJust get into your airplane and then have FSFlyingSchool Pro put you on approach to any airport of your choice.\nYou can even have FSFlyingSchool Pro choose a random airport anywhere in the world.\nReady to be challenged?! \n\nFSFS Pro Flight Mapping feature\n\nWouldn't it be nice to be able to review your flight paths over real world satellite terrain using Google Maps?\nAnd... wouldn't it be just great to be able to store them and look back over them at your leisure?\nHow about sharing them with friends?\nOh - and how about tracking taxi routes too?\nNow you can do all of this with FSFlyingSchool Pro's new Flight Mapping feature! \n\nCessna 172 Detail Pack Included\n\nWant to fly a detailed flight in the ever popular Cessna 172? FSFlyingSchool Pro offers extra detailed treatment when flying this marvelous airplane.\nYour team of instructors know the details of this machine and will expect the same from you!\nGet ready to fly the c172 like you've never done before!\n\nTRAFFIC! TRAFFIC!\nInstructor optionally comments on the position, type and activity of both air and ground traffic and issues warnings if aircraft are getting too close. Things can get hectic at busy airports so your instructor will help keep you out of trouble.\n \nWaypoint Advice\nInstructor optionally advises when the next waypoint in a flight plan is approaching and reports its ID and type and advises the turn which must be made when it is reached. This gives you a hand setting up for that next important stage of the flight plan.\n \nNavigation Aid Advice\nInstructor optionally advises which radio to tune for the next NAVAID (Navigation Aid) in the flight plan (VOR or NDB) and reports the ID and type of the NAVAID, how to use its signal, and the course which can be tracked with it. It all helps the pilot stay on track and is a gentle way of introducing the pilot to the basics of VOR and NDB navigation.\n \nInstant Customization of FSFlyingSchool Runway Data\nPowerful new feature means that with a single key-press the pilot can optionally indicate what exact touchdown point on any runway in the world the pilot wants a landing to be evaluated on. You can aim for any point on the runway you like with this handy new tool.\n \nAutomatic Setting of OBS\nInstructor will automatically set NAV1OBS to the runway heading during landing. One less thing for the pilot to worry about during a very busy time.\n \nRunway Details\nInstructor reports runway length, altitude and surface type when on approach. It all helps in planning that perfect landing.\n\nILS Advice\nInstructor advises frequency of ILS (Instrument Landing System) at destination airport. If you want to do an ILS approach and need that frequency, your instructor has it for you.\n \nATIS Advice\nInstructor advises frequency of ATIS (Automatic Terminal Information Service) at destination airport. Use this to tune a radio and get vital information on the current conditions at the airport.\n \nAutomatic ILS Tuning\nInstructor optionally tunes NAV1 (Navigation Radio One) to ILS (Instrument Landing System) at destination airport. Things can get busy so you can have your instructor take care of this for you if you wish.\n \nAutomatic ATIS Tuning\nInstructor optionally tunes COM2 (Communications Radio Two) to ATIS (Automatic Terminal Information Service) at destination airport. Handy to save time and COM2 will not interfere with ATC communications.\n \nDME Reporting\nInstructor reports distance from DME (Distance Measuring Equipment) navigation aid.\n \nHandy Hints\nEven more helpful cues and suggestions from your instructors.\n \nAnnounces Selected Runway\nInstructor reminds pilot which runway has been chosen for landing at destination airport. Helps keep the pilot on the right track and off the wrong runway.\n \nAnnounces Flight Plan Length\nInstructor reports total distance of flight plan. Make sure you can get there safely and with plenty of fuel to spare.","torrent":{"xt":"urn:btih:a5898b9a462a0758c00a7f2f15e6cd2ff58df5f9","amp;dn":"P3D+FSFlyingSchool_Pro_2014_P3D+2.2+UPDATE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5898b9a462a0758c00a7f2f15e6cd2ff58df5f9","infoHashBuffer":{"type":"Buffer","data":[165,137,139,154,70,42,7,88,192,10,127,47,21,230,205,47,245,141,245,249]},"announce":[],"urlList":[]}}