{"title":"Bum! Demo Tape","uid":5204489,"size":14226590,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a85db42aac6338536ba7d2a7fd8944814f8e0ca6&amp;dn=Bum%21+Demo+Tape&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pantomime-Reject","files":5,"time":1260309397,"description":"Bum! were a 1980's Punk / early Britpop band. As far as I know they never had a recording contract and just played gigs around the south of England in the mid to late 80's / early 90's. I saw them a few times at 'The Castle' - an alternative pub in Brentwood, Essex.\n\nThey sound a bit like a rawer version of 'Boys Wonder' who also had a bit of a cult following at the time and if you liked them, you'll probably like Bum! There are only 4 songs on the demo, however, I've never been able to find anything else on the net for this band so hopefully it will be of use to somebody.\n\nThis .mp3 was recorded from a 20-odd year old cassette tape Demo so the quality isn't the best. I've cleaned it up as best I can but there are a few dropouts etc. My audio cleanup software isn't particularly sophisticated so if anyone wants to have a go themselves, post a comment and I'll put up a torrent for the original plain recording direct from the tape (.wav file)\n\nI don't have my computer on 24hrs so downloading may be a little on/off until there are others to seed but I try to have my computer switched on for at least a few hours each day so please persevere - thanks.\n\nI do keep an eye on my torrents, so if it's not working properly, please do leave a comment and I will try to fix it.\n\nSong Listing\n\n1 Rhubarb\n2 I Can Assure You\n3 Little Johnny\n4 Dear Cigarette\n\nAll files accurately tagged with Artist, Album Artist, Album, Track Number, Genre, Title &amp; Source(in 'comments')","torrent":{"xt":"urn:btih:a85db42aac6338536ba7d2a7fd8944814f8e0ca6","amp;dn":"Bum%21+Demo+Tape","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a85db42aac6338536ba7d2a7fd8944814f8e0ca6","infoHashBuffer":{"type":"Buffer","data":[168,93,180,42,172,99,56,83,107,167,210,167,253,137,68,129,79,142,12,166]},"announce":[],"urlList":[]}}