{"title":"UK - 20070511 Unreported World - 5 of 10 - Chongqing-Invisible C","uid":3687179,"size":368443392,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a9a65b24d4efb48f7df49a6cb104cf0478c1527d&amp;dn=UK+-+20070511+Unreported+World+-+5+of+10+-+Chongqing-Invisible+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grimerking","files":1,"time":1179017456,"description":"Unreported World - 5 of 10\n\nChongqing: Invisible City\n\nUK Channel 4\nFriday 11 May 7.35pm\n\nUnreported World reveals that China&amp;#039;s economic boom comes at the expense of tens of millions of workers and dispossessed farmers.\n\nLittle known outside China, Chongqing is the world&amp;#039;s fastest growing city. Set to become a super city and home to 20 million by 2020, the government is spending billions building its infrastructure. But, as this edition of Unreported World reveals, China&amp;#039;s economic boom comes at the expense of tens of millions of workers and dispossessed farmers.\n\nForty kilometres outside Chongqing, Reporter Ramita Navai and Director Nick Sturdee begin their journey amongst the cranes, new buildings and construction work that stretch for as far as the eye can see. Over the last seven years, the Government has spent a staggering 114 billion pounds on roads, bridges and dams to turn an area two thirds the size of England into a vast transport and manufacturing hub at the centre of the country.\n\nChongqing is being built on the back of migrant labour. More than fifty per cent of the city&amp;#039;s population are migrants and half a million new labourers are drawn to it every year. But, as Unreported World highlights, these migrants are forced to endure years of cramped living conditions with no employment rights at all.\n\nNavai visits one apartment block and finds more than 40 men crammed into one flat, with 20 sleeping in just one room. They tell her that while they earn three times what they would in the countryside they&amp;#039;re still too poor for their families to join them. If they&amp;#039;re lucky they&amp;#039;ll see their wives and children a couple of times a year.\n\nAnd their lack of rights means they are easily exploited by the factory owners. Navai meets one group of workers who have been demonstrating for 20 days. They claim that they are owed money and have been thrown out of their jobs and homes without compensation, and tell Navai that if the government doesn&amp;#039;t act, mass anger cannot be stopped. Before they can film any more, the team are detained by the local police, anxious to prevent the outside world seeing pictures of the demonstration.\n\nAs well as factory workers, farmers are also suffering as the government evicts them from the land they are farming, often without the compensation to which they are legally entitled. When they protest, the farmers are sometimes beaten.\n\nOne female farmer, Yu Shu Rong, tells the team that the state had taken her land without any compensation; when she and her husband protested, they were severely beaten security guards. Another group of villagers claim that when they protested against being thrown out of their houses, they too were beaten up, and the developers then bulldozed their crops to force them to move on.&quot;\n\nThe power and confidence of the developers is illustrated shortly afterwards. While speaking to local farmers, the team are prevented from filming by two &quot;security officials&quot; whom the villagers claim are the same individuals who had beaten a group of elderly women for refusing to sign over their land to the developers.\n\nHundreds of millions of migrant labourers and farmers are now being directly affected by China&amp;#039;s development. Social unrest has rocketed with tens of thousands of protests involving millions of people and, as Unreported World concludes, unless the government starts taking account of them, the country could be heading for a crisis.\n\nFile Information\n\nDVBT-T (Freeview) Capture\nConverted using Gordian Knot\nResolution = 640x352\nVideo Codec = XviD\nAudio = 128kbps CBR","torrent":{"xt":"urn:btih:a9a65b24d4efb48f7df49a6cb104cf0478c1527d","amp;dn":"UK+-+20070511+Unreported+World+-+5+of+10+-+Chongqing-Invisible+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9a65b24d4efb48f7df49a6cb104cf0478c1527d","infoHashBuffer":{"type":"Buffer","data":[169,166,91,36,212,239,180,143,125,244,154,108,177,4,207,4,120,193,82,125]},"announce":[],"urlList":[]}}