{"title":"Caso Abierto 5x01[HDTV][Spanish].avi","uid":4375820,"size":367097856,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:abe85b31e3abb7ee578e85cccaa6338eddb0964a&amp;dn=Caso+Abierto+5x01%5BHDTV%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1220399650,"description":"Caso Abierto es una serie de corte policiaco sobre Lilly Rush (Kathryn Morris, Minority Report), la ÃƒÂºnica mujer detective en la brigada de homicidios de la comisarÃƒÂ­a de policÃƒÂ­a de Philadelphia, quien de repente encuentra su trabajo ideal cuando es asignada para investigar los llamados &quot;casos abiertos&quot;, denominaciÃƒÂ³n con la que se conoce a los casos que tras aÃƒÂ±os de investigaciÃƒÂ³n continÃƒÂºan sin poder resolverse, casos que son de difÃƒÂ­cil resoluciÃƒÂ³n dado el tiempo pasado y la consiguiente pÃƒÂ©rdida de pruebas y testigos.\n\nAntes, en su anterior labor en homicidios, Lilly aplicaba su amplio conocimiento e intuiciÃƒÂ³n sobre la mente criminal de asesinos actuales. Ahora, tendrÃƒÂ¡ que interrogar a testigos de crÃƒÂ­menes pasados, cuyas vidas y circunstancias han cambiado mucho desde entonces, usando los avances cientÃƒÂ­ficos que existen en la actualidad y buscar nuevas pistas para resolver esos casos que en el pasado quedaron sin resolver, todo un gran reto para esta aguda e inteligente detective. AdemÃƒÂ¡s, ella tiene que estar preparada para las consecuencias que puedan ocasionar sus investigaciones, ya que su trabajo puede abrir viejas heridas y llevar a los criminales a cometer nuevos crÃƒÂ­menes.\n\nCuando Lilly se encuentra en un callejÃƒÂ³n sin salida, siempre busca consejo en su respetado mentor, el teniente John Stillman (John Finn). TambiÃƒÂ©n en este equipo que investiga los &quot;casos abiertos&quot;, estÃƒÂ¡ el detective Scotty Valens (Danny Pino, The Shield), el mayor confidente de Lilly y su tenaz y terco compaÃƒÂ±ero; el detective Will Jeffries (Thom Barry), quien lleva tanto tiempo en la brigada que sirve para que Lilly tenga un enlace directo con el pasado y sea una gran fuente de informaciÃƒÂ³n, ya que conoce casi todos los crÃƒÂ­menes que este brigada debe investigar; y el detective Nick Vera (Jeremy Ratchford, Mirada de ÃƒÂ¡ngel), un duro policÃƒÂ­a que es considerado como el hombre ideal para arrancar una confesiÃƒÂ³n del sospechoso.\n\nLa detective Lilly Rush, que en un principio no estaba muy contenta de su nueva responsabilidad en esta investigaciÃƒÂ³n de los casos sin resolver, finalmente ve en ellos una oportunidad de darle un importante giro a su carrera, asÃƒÂ­ que decide comprometerse con este nuevo trabajo y asegurarse de que las vÃƒÂ­ctimas de crÃƒÂ­menes pasados, no sean olvidadas y pueda hacerse justicia con hechos que mucha gente habÃƒÂ­a aprendido a olvidar.","torrent":{"xt":"urn:btih:abe85b31e3abb7ee578e85cccaa6338eddb0964a","amp;dn":"Caso+Abierto+5x01%5BHDTV%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abe85b31e3abb7ee578e85cccaa6338eddb0964a","infoHashBuffer":{"type":"Buffer","data":[171,232,91,49,227,171,183,238,87,142,133,204,202,166,51,142,221,176,150,74]},"announce":[],"urlList":[]}}