{"title":"Avast v4.8.1229 Professional Edition &amp; Home Edition","uid":4363788,"size":27151046,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:acc129a012acdd2d755848892f4ba509a58cd8ca&amp;dn=Avast+v4.8.1229+Professional+Edition+%26+Home+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nohnaim","files":1,"time":1219797211,"description":"Avast 4 Professional Edition is a complete ICSA &amp; Checkmark certified antivirus, Checkmark certified anti-spyware &amp; anti-rootkit software package for corporate and advanced home use. avast Professional Edition includes an on demand scanner with two user interfaces, a skinnable simple interface: just select what you want to scan and in which way and press the play button, an enhanced user interface: Outlook like UI allows users to set any feature of Avast, prepare and run tasks, store and check task results, on access scanner: special providers to protect: most available e-mail clients, instant messaging: ICQ or Miranda, network traffic: lightweight firewall, P2P protection for Kazaa, BitTorrent, Web shield: all HTTP traffic, script blocker. avast Professional Edition is available in 32 languages. Small, true incremental, updates are downloaded and installed automatically.\n\n* avast! now contains a built-in anti-rootkit protection\n* avast! now comes with a built-in anti-spyware protection\n* new self-defense function to prevent active malware from terminating avast! processes as well as corrupting avast! files and registry items\n* scanners now display a progress of current scan (percentage of work done)\n* fixed a vulnerability in AavmKer4.sys kernel-mode driver (problem applies to Windows NT/2000/XP, 32-bit only); special thanks to Tobias Klein\n* improvements in boot-time scanner (detection &amp; removal of hidden or hard to delete files)\n* boot-time scanner will not start when booting into Safe Mode (the program was &quot;invisible&quot; in that case, no progress/messages could be seen)\n* improvements in many unpackers\n* ACE and RAR unpackers now work even in boot-time scanner\n* IM Shield: added support for QQ\n* improvements in handling of NTFS streams\n* Internet Mail provider now displays the name of the sending/receiving program in the tooltip of its taskbar icon\n* implemented a protection against false positives in critical system files\n* removed a small memory leak in one of avast! drivers (Windows Vista and XP 64-bit only)\n* added support for 64-bit WHS connector (available in WHS Power Pack 1)\n* greatly improved performance of the updater, especially in cases where many increments are being downloaded (e.g. avast! installations with outdated virus definitions)\n* silent installation now also includes scheduled tasks, if any\n* resolved a compatibility issue with Acronis TrueImage (XP 64-bit only)\n* compatibility tests with Vista SP1 and XP SP3 ","torrent":{"xt":"urn:btih:acc129a012acdd2d755848892f4ba509a58cd8ca","amp;dn":"Avast+v4.8.1229+Professional+Edition+%26+Home+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc129a012acdd2d755848892f4ba509a58cd8ca","infoHashBuffer":{"type":"Buffer","data":[172,193,41,160,18,172,221,45,117,88,72,137,47,75,165,9,165,140,216,202]},"announce":[],"urlList":[]}}