{"title":"[swelog]Shadow.Harvest.Phantom.Ops-SKIDROW","uid":6297356,"size":4174984612,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae4a190fbb4893219234b6b27e51496225cd04c4&amp;dn=%5Bswelog%5DShadow.Harvest.Phantom.Ops-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"swelogz","files":86,"time":1302045048,"description":" \t\n\n\n\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nShadow Harvest: Phantom Ops (c) Viva Media\n\n05-04-2011........Release Date - Protection...............Steam\nFPS..................Game Type - Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nBEHIND EVERY WAR IS A TRUTH YOU WERE NEVER MEANT TO KNOW - The year is\n2025 and the world is shaken by numerous conflicts over the control of\ndwindling natural resources. The hunger of rival warlords and dictators\nof mainly underdeveloped countries for advanced and highly effective\nweapon systems appears insatiable and the profits of the arms industry\nhave reached new heights.\n\nAs highly advanced weapon systems, made in the USA, are sighted on\nvarious battlegrounds in Third World countries, the US government\ndecides to send in an ISA agent, Cpt. Myra Lee, to find out how\npolitical enemies are acquiring arms that are under strict embargo.\n\nMyra is sent to Mogadishu, where American made weapons have allegedly\nbeen employed in combat by Somali military forces against rebel units.\nIn Somalia, Myra meets Cpt. Aron Alvarez, a hard-boiled close combat\nspecialist of US Army's 1st SFOD-Delta, whose squadron is assigned to\nassassinate Somalia's dictator. Myra and Aron begin working together\nonly to discover that that the seriousness of the whole affair reaches\nmuch deeper than just the illegal trade of US weapon systems.\n\nA special unit under the codename SHADOW HARVEST is formed within the\nISA to reveal the truth. Cpt. Myra Lee and Cpt. Aron Alvarez are made\npartners in the operational core of this special unit and their\ninvestigations lead them to various places all over the world.\n\nBased on the operations of the Intelligence Support Activity (ISA),\nwith missions ranging from gathering critical intelligence data to\ncovert direct action operations. The existence of the ISA has never\nbeen officially confirmed by the US government.\n\nTwo completely different characters each with very specific and fully\nfleshed out sets of skills, preferences and abilities. Cooperatively\ncomplete covert operations. Players may switch between each character\nat any time, using either Aron's combat abilities or Myra's stealth\nskills to solve the situation.\n\nPlayers choose from a vast array of weapons and technologies that\nenhance both characters strengths. Employ mechanized weapons to boldly\nattack enemies from head-on or an invisibility shield to creep through\nenemy territory undetected. Take advantage of refined game mechanics\nthat take the traditional shoot-to-kill approach to a new level.\n\nFeatures:\n\nWhen a covert operation to stop illegal arms sales reveals a full-scale\nglobal conspiracy, a special unit under the codename SHADOW HARVEST is\nformed to reveal the truth.\n\nWith two completely different characters serving as the unit's\noperation core, you must choose from a vast array of weapons and\ntechnologies that enhance both characters strengths.\n\nFeatures a gripping storyline that unfolds organically through the\ngameplay (doesn't rely on cutscenes to move the story along). The ratio\nof gameplay to cutscenes is better than 13:1.\n\nPlayers can switch between the two main characters at any time during\nthe game to take advantage of each characters strength as well as\ncombat a sophisticated AI that adapts to the strategies you develop.\n\nOpen level design and option secondary objectives leave the outcome\ncompletely up to the player to choose.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy all files from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy\n\nGREETINGS\n\n\n \t\n\n","torrent":{"xt":"urn:btih:ae4a190fbb4893219234b6b27e51496225cd04c4","amp;dn":"%5Bswelog%5DShadow.Harvest.Phantom.Ops-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae4a190fbb4893219234b6b27e51496225cd04c4","infoHashBuffer":{"type":"Buffer","data":[174,74,25,15,187,72,147,33,146,52,182,178,126,81,73,98,37,205,4,196]},"announce":[],"urlList":[]}}