{"title":"American.McGee's.Alice-FLT","uid":6479114,"size":889208030,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aff85984c8bb369e09d29d1cea9058cfa8de4bc4&amp;dn=American.McGee%5C%27s.Alice-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Test_Verify","files":3,"time":1308426427,"description":"American McGee's Alice (c) Electronic Arts\n\nSupplied by: FAIRLIGHT            : : Release Date: 29 November 2000     :\n\nCracked by:  FAIRLIGHT              Game Type:    Action\n\nPackaged by: FAIRLIGHT              Image Format: BIN/CUE\n\nCDS: 2                              Protection: CDILLA2\n\nCD1 archives: 49 x 15 MB            CD1:  FLT-AMAA.001 -&gt; .049\n\nCD2 archives: 16 x 15 MB            CD2:  FLT-AMAB.001 -&gt; .016\n\nSystem Requirements: Windows, Pentium II, CD-Rom\n\nGame information :\n\nWhen Alice answers a distressed summons to return to Wonderland, she\nbarely recognizes the befouled setting. From the fungal rot of the\nMushroom Forest to the infernal chemistry of the Mad Hatter's Domain and\nbeyond, Wonderland festers to its core. Undaunted by the diseased\nambiance, cavernous confusion, and mortal danger that surround her,\nAlice must undo the chaos. Equipped with courage, a keen appetite for\nthe bizarre, and a lethal array of transmogrified toys, she'll penetrate\nthe strongholds of her enemies, confront the forces of evil, and put the\nwicked Queen of Hearts in her place.\n\nA Strangely Familiar, Yet Utterly Wicked Tale\nRomp through a surreal but hauntingly familiar Wonderland, including the\nPool of Tears, the Mushroom Forest, and Mad Hatter's Domain. Lead Alice\non her quest to reclaim Wonderland -- stunning third-person, 3D action\nbased on an enhanced version of Quake III technology. Duel to the death\nwith psychotic renditions of characters from the original Alice\nadventures, including the Mad Hatter, Tweedle Dee and Tweedle Dum, and\nthe Jabberwocky. Be guided by Wonderland's more benign creatures,\nincluding the Cheshire Cat and a frenetic White Rabbit. Fight the\nQueen's vicious minions, sadistic card guards, demonic fire imps,\nravenous jabberspawn, and many more. Unravel devious puzzles, from the\nlabyrinthine Fortress of Doors to chicanery-filled Psychedelic Funhouse.\nDefeat your enemies with a collection of the most deadly toys ever\nimagined - roll nasty dice, hurl an exploding jack-in-the-box, and much\nmore. Immerse yourself in the Alice sound, which includes original music\ncomposed especially for American McGee's Alice. Created by renowned\nlevel designer American McGee--his impressive list of credits includes\nlevels design for Doom II and the Quake series.\n\nNote :\n\nBe sure to copy over the crack from CD1's /crack directory.\nWhen asked for the serial: enter XXXX-XXXXXXX-XXXXXXX-XXXX\n/Team FairLight","torrent":{"xt":"urn:btih:aff85984c8bb369e09d29d1cea9058cfa8de4bc4","amp;dn":"American.McGee%5C%27s.Alice-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aff85984c8bb369e09d29d1cea9058cfa8de4bc4","infoHashBuffer":{"type":"Buffer","data":[175,248,89,132,200,187,54,158,9,210,157,28,234,144,88,207,168,222,75,196]},"announce":[],"urlList":[]}}