{"title":"WeSC.Calendar.DVDRip.XviD-WeSC.avi","uid":3533581,"size":721118338,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b0f5d3f684089d10f32be715544d12bc5729a279&amp;dn=WeSC.Calendar.DVDRip.XviD-WeSC.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WeSC","files":1,"time":1159987177,"description":"...::::  WeSC Calendar of a year  ::::...\n\n\nIntroduction\nWhat did WeSC and their Weactivists do the last year? Who are all those Weactivists? And what the hell is a Weactivist anyway? You?ll figure that out while watching interviews Jerry Hsu, Gino Iannuci, Jason Lee, Chris Pastras, Chad Robertson, Seth Enslow, Love Eneroth, Amy Gunther, Millencolin, Clint Peterson and many more. Welcome to our world.\nThis is the full year version (12 episodes/month not devided into chapters). If you  only wnat separete episodes, get them here: \n &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3533578/WeSC.Calendar.Episodes.DVDRip.XviD-WeSC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3533578/WeSC.Calendar.Episodes.DVDRip.XviD-WeSC&lt;/a&gt;\n\nSee description of the content, month by month below.\n\n\n\nWeSC Calendar - January\nVisit Jerry Hsu - damn good skater and photographer - in his flat in San Jose.\n\nWeSC Calendar - February\nFollow Millencollin from their first record to their latest, from Ã–rebro to Barcelona, from Millencolin open to sold out concert at Razzmataz. Also, check out the WeSC, Adidas originals collaboration!!!\n\nWeSC Calendar - March\nIn March it&amp;#039;s getting sunnier so we bring forth the WeSC sunglasses. Seth Enslow tells us about some impossible things he has done on a dirt bike, about his head injury and about settling down...\n\nWeSC Calendar - April\nWe go visit Steve Forsner in Lyon, France. He tells us about being an activist. We get to see some skating. A spoken words session with skateboard magazine ?Giftorm?. More Skating. Canadian skating. Tosh osaka, Ross Milligan, Jesse Booi, Mitch Charron... You get the picture.\n\nWeSC Calendar - May\nIn May we go to the shooting of My name is Earl, starring Weactivist Jason Lee, telling how skating has evolved over the years. We get to see some clipse from the Stereo film, &quot;Visual Sound&quot;. We go to Milano to watch some really(!) beautiful people at WeSC fashion show. Also we swing by Clint Petersons gallery/bar/miniramp/home in L.A. !\n\nWeSC Calendar - June\nThe first WeSC concept store turned one i June 2005. We also meet Ed Leigh enjoying the annual sales meeting, check it out!\n\nWeSC Calendar - July\nWe go on the highest fashion show ever and end up on the beautiful beach of Barcelona having a great crayfish party. Love Eneroth, who has been around since the G-Spot days, currently living in Barcelona tells us about life abroad and about being able to skate all year.\n\nWeSC Calendar - August\nThis month we visit Chad Robertsons house in Beverly Hills. He talks about his work as an artist, about the golden skate era and much more. Also check out the first WeSC store in Japan, Casper Plaes, Nicky Guerrero, Adil Dyani and Tony Magnusson.\n\nWeSC Calendar - September\nMike Smith breaks down the direct connection between skating and fitness and coins the expression &quot; weight skating&quot;.\n\nWeSC Calendar - October\nVery modest Chris Pastras, skate pro since 1990 gives us his perspective on life right now. Also check out Jerry Hsu, Daniel Schimizu, Benny Fairfax, Jason Lee and Clint Peterson on a USA skate tour.\n\nWeSC Calendar - November\nAmy Gunther expresses her undying and complete love for N.Y.C. Also check out some country side skating by Jussi Oksanen. Hell yeah!\n\nWeSC Calendar - December\nOn Long Island, the end of New York, Gino Ianucci tells us about the 30 longest days of his life, about work pressure and the skateboard game. He gives us an insight in the life of a pro skater and about the complicated relationship between aging and skating.\n\n\nEnjoy the year together with WeSC and if you want to know more about WeSC - WeAretheSuperlativeConspiracy - check out our website:\nwww.wesc.com\n\n\n...::::  Why WeSC uses The Pirate Bay  ::::...\n\nWeSC is more than just another brand on the market ? WeSC ha a story to tell, a background to be proud of. And WeSC is surrounded by a lot of interesting peoples, which has a lot of interesting things to say, we call them Weactivists. \nThe very best way to connect to the idea behind WeSC is to watch it on film, to hear other people tell their version of what they think WeSC stands for. That?s what we?ve done with ?The WeSC Calendar?. And since we own all the copyrights to it ? we want to spread it world wide as fast as we can. That?s why we started this collaboration with The Pirate Bay.\nAnd the bittorrent technique makes it possible to reach out with a large amount of information to a massive crowd in no time.\n\n\n\n\n...::::  Info on the files and how to use them  ::::...\n\nXVID\nThese are encoded into the open source codec xvid. \nTo view them on your computer use our favorite tool VLC www.videolan.org which is a nice app that dont need any codecs. It works great on both Windows and Mac OSX. Very user friendly and works with most video files today!\n","torrent":{"xt":"urn:btih:b0f5d3f684089d10f32be715544d12bc5729a279","amp;dn":"WeSC.Calendar.DVDRip.XviD-WeSC.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0f5d3f684089d10f32be715544d12bc5729a279","infoHashBuffer":{"type":"Buffer","data":[176,245,211,246,132,8,157,16,243,43,231,21,84,77,18,188,87,41,162,121]},"announce":[],"urlList":[]}}