{"title":"Call-Girl.PAL-Audio.Por+Subs.Por+Eng-FLIpresentation","uid":4868363,"size":8278587392,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b227f4d1ffcb8ab1e48687c6dee0c67c0acba2e8&amp;dn=Call-Girl.PAL-Audio.Por%2BSubs.Por%2BEng-FLIpresentation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kaminer","files":57,"time":1240658285,"description":"Call-girl - 2007 &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1043835/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1043835/&lt;/a&gt;\n\nOriginal DVD full rip\nAudio - Por \nSubs - Eng+Por\nPAL\nGenre: Thriller / Crime / Erotic\n\nIn the plains of the southern Portuguese region of Alentejo the greatest agricultural richness are the cork-oaks since Portugal is the first cork producer in the world. There is a municipality of poor people most of them old who never knew another agricultural wealth and whose communist mayor is a honest man. A big international corporation needs the fields where the cork-oaks are implanted to build there a luxury tourist resort which includes extensive golf-links and courses. But to implement that big project it's necessary to pull down thousands of oak-trees thus changing completely the economy of the region and the lives of those who live there in the worst sense. The project cannot be put into practice without the mayor's signature authorizing it and he has always refused to do it, resisting to all corruption and bribery attempts that have been tried to break that resistance. There are in this world nowadays two levers that command power and change many situations: money and sex. Therefore here since the first lever failed the second one must be tried. And it's now that enters in the scene the element that can do it with success: the so called call girl or the fine and expensive prostitute whose role is splendidly done by Soraia Chaves a beautiful young actress who acts this role as well as any of the best Hollywood stars would do it. She is in fact irresistible and conquers and subdues our man entirely. A call girl when used as a means of corruption can be used in two ways: by corrupting directly the man with her sexual performances or at certain point refusing to go on with them without huge payments which forces the man who fell in love with her to accept the proposal of the bribers or corrupters in order to pay her and not lose her. This is basically the movie story, admirably told and admirably acted by all the performers including the two police inspectors that are trying along the whole movie to detect the corrupting business and arrest its intervenients. The story develops itself in a lot of varied vicissitudes and incidents which rivet our attention all along the movie projection till the end which is somewhat unpredicted. This is one of the recent movies that must indeed be seen not only by cinephiles but also by the the general public. (from a reader at IMDB)\n\n=================================================================================\n\nOn peut violer les lois sans qu'elles crient. (Talleyrand)","torrent":{"xt":"urn:btih:b227f4d1ffcb8ab1e48687c6dee0c67c0acba2e8","amp;dn":"Call-Girl.PAL-Audio.Por%2BSubs.Por%2BEng-FLIpresentation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b227f4d1ffcb8ab1e48687c6dee0c67c0acba2e8","infoHashBuffer":{"type":"Buffer","data":[178,39,244,209,255,203,138,177,228,134,135,198,222,224,198,124,10,203,162,232]},"announce":[],"urlList":[]}}