{"title":"Pimp School Educational Screensavers","uid":3813132,"size":7669331,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b315b9cbb79c5ff5af755af6602b4e8fffc1d19f&amp;dn=Pimp+School+Educational+Screensavers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vaaf","files":2,"time":1190304631,"description":"PIMP SCHOOL EDUCATIONAL SCREENSAVERS\n\n1.0.0 - 09.19.2007 - http://www.big-mafia.com\n\nScreenshot: tinyurl dot com slash 2t4tjb\n\nOur screensavers help you get better with women. Memorize all the best player\nadvice, pickup lines and funny things to say.\n\nWe have crawled through tons of websites, e-books and DVDs, taken the best\nstuff from the greatest players and packed it all into a simple and straight\nforward guide to help you get better with women. It comes as a screensaver,\nalong with some lovely pictures.\n\nThe seduction community is a loose-knit subculture of men who strive for better\nsexual and romantic success with women through self-improvement and a greater\nunderstanding of social psychology. It exists largely through Internet forums\nand groups, as well as over a hundred local clubs. Supporters refer to the\nsubculture simply as the community and often call themselves pickup artists.\n\nSupporters typically believe that the conventional dating advice for men is\nfatally flawed. For example, they reject the notion that men should attempt to\nwoo women by spending money on them (e.g. buying drinks, presents, jewelry),\ncalling it supplication. They also discourage flattery. They believe that\nphysical looks are less important to women in selection of a partner than they\nare to men, as evidenced by top gurus who rated poorly with their looks on a\nHot or Not style of website.\n\nMost active members of the seduction community work on their game (seduction\nskills) by improving their confidence and self-esteem (termed inner game),\ntheir social skills and understanding of female psychology (outer game) and\ntheir physical appearance (physical fitness, fashion sense, grooming). One&amp;#039;s\ngame is refined through regular practice, with the belief that the abilities\nneeded to interact with women can be learned.\n\nKeywords: advice, attracting women, babes, chicks, comedy, dating, flirting,\nfunny, game, girls, help, hilarious, hoes, hot, humor, jokes, lessons, love,\nlust, mackin, pickup lines, pimpin, punch lines, relationships, romance,\nseduction, sexy, sweet, tease, womanizing, women \n","torrent":{"xt":"urn:btih:b315b9cbb79c5ff5af755af6602b4e8fffc1d19f","amp;dn":"Pimp+School+Educational+Screensavers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b315b9cbb79c5ff5af755af6602b4e8fffc1d19f","infoHashBuffer":{"type":"Buffer","data":[179,21,185,203,183,156,95,245,175,117,90,246,96,43,78,143,255,193,209,159]},"announce":[],"urlList":[]}}