{"title":"A Very Brazzers Christmas 2","uid":12428809,"size":3974800317,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b5222634db9b177bb34222d9da585cfb786dc427&amp;dn=A+Very+Brazzers+Christmas+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"irealu69","files":1,"time":1442424861,"description":"\nA Very Brazzers Christmas 2\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nSynopsis: Naughty Or Nice?Santa needs a new Mrs. Claus, so one of his elves brought in a couple of big booty sluts named Ava Addams and Phoenix Marie to try out for the part. The two busty babes take turns licking each other's pussies and assholes, then suck on Santa's Christmas cock.Holiday SecretsKirsten can't help but notice what a crappy gift Alicia's boyfriend has gotten her for Christmas. She feels bad, so she decides to show Miss Secrets the massive toy she was given. Kirsten has all the naughty tools to put Alicia back in the holiday spirit.A Brazzers Christmas PartyChristmas time is here and all of the Brazzers girls are full of festive cheer! Also full of the cheer of being young, the cheer of being carefree and the cheer of being sexy horny sluts! Merry Christmas, everyone!SinderellaWhen Sinderella's fairy godmother appears, everything changes! Sinderella gets to go to the ball and seduce Prince Charming, and Buttons finally has all his dreams come true when he gets to have a wild threesome with Lady Hardon and Sinderella's fairy godmother.Cumming Together For ChristmasEva Angelina and Krissy Lynn are getting together for a nice romantic Christmas dinner, and Krissy has the perfect gift for her lusty lesbian lover: an all natural busty babe named Luna Kitsuen! Eva and Krissy bust out their favorite toys to play with their new fuckdoll.Squirting On SantaNight before Christmas, Veronica Avluv was missing her spouse. When a robber came down through the chimney that night, she sucked his big dick by the Christmas tree's light. This busty housewife was truly perverted, so he fucked her wet pussy until the thing squirted!\n\nCast: Dillion Harper, Ava Addams, Phoenix Marie, Veronica Avluv, Krissy Lynn, Eva Angelina, Staci Silverstone, Cathy Heaven, Kirsten Price, Luna C. Kitsuen, Rebecca More, Alice March, Alicia Secrets\n\nScreenshots:\n~~~~~~~~~~~~ &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/frI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/frI&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/frm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/frm&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/fro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/fro&lt;/a&gt;\n\nVideos Info:\n~~~~~~~~~~~~\nSize: 3.702 GB\nDuration: 03:58:44 \t\nResolution: 720x404","torrent":{"xt":"urn:btih:b5222634db9b177bb34222d9da585cfb786dc427","amp;dn":"A+Very+Brazzers+Christmas+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5222634db9b177bb34222d9da585cfb786dc427","infoHashBuffer":{"type":"Buffer","data":[181,34,38,52,219,155,23,123,179,66,34,217,218,88,92,251,120,109,196,39]},"announce":[],"urlList":[]}}