{"title":"Sexually Broken---brutal blow jobs!  Mahina Zaltana  Matt Willi","uid":9185035,"size":809472051,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b56d2292819e6be8c79a4dd0ee7c9f13dea7a55b&amp;dn=Sexually+Broken%5C---brutal+blow+jobs%21++Mahina+Zaltana++Matt+Willi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1384282856,"description":"Sexually BrokenLush porn star Mahina Zaltana turned into a fire hydrant, gushes uncontrollably, brutal blow jobs!  Mahina Zaltana  Matt Williams\n\nMP4 only.\n\n \nMahina Zaltana was born with a very sensitive pussy. Once you put a vibrator on it, she squirts almost instantly. There isn't a thing she can do to stop it, she is helpless to the overwhelming sensation. We love squirters here at Sexuallybroken, they are so much fun to play with. Today we are going to drain Mahina dry.\n\nBlindfolded, gagged and bound in a kneeling position with her arms strictly stretched over her head, Mahina awaits her fate. The blindfold prevents her from anticipating the action, all she can do is guess and endure. Some heavy nipple weights clamped on over her bright red dress reinforce that her breasts are nothing but a toy for our use. Her response to the vibrator is powerful and instant-she gushes uncontrollably all over our stage like a poorly trained puppy. While her squirt is still dripping through the boards of our stage, we introduce a rock hard cock to the back of her mouthhole.\n\nThe throat training is brutal and without mercy. She is just a pussy on her knees, a sheath for our cock. We grab her hair and whip her face hole back and forth on our tool as drool flows helplessly out of her mouth and coats her bound body. Mahina's eyes glaze over as she slides down into subspace. There is a special place people go when they are restrained and helpless and owned by cock. That is where our gushing little porn star is currently residing. Some flogging and a vibrator are the icing on the cake, and we leave our wrecked starlet a messy lump of used flesh, covered in her own juices and moaning softly. Training complete.\n\n \nScreens  &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_11mzaltana/SexuallyBroken-Mahina-Zaltana-Matt-Williams-Lush-porn-star-Mahina-Zaltana-turned-into-a-fire-hydrant-gushes-uncontrollably-brutal-blow-jobs.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_11mzaltana/SexuallyBroken-Mahina-Zaltana-Matt-Williams-Lush-porn-star-Mahina-Zaltana-turned-into-a-fire-hydrant-gushes-uncontrollably-brutal-blow-jobs.php&lt;/a&gt;\n\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\t\t","torrent":{"xt":"urn:btih:b56d2292819e6be8c79a4dd0ee7c9f13dea7a55b","amp;dn":"Sexually+Broken%5C---brutal+blow+jobs%21++Mahina+Zaltana++Matt+Willi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b56d2292819e6be8c79a4dd0ee7c9f13dea7a55b","infoHashBuffer":{"type":"Buffer","data":[181,109,34,146,129,158,107,232,199,154,77,208,238,124,159,19,222,167,165,91]},"announce":[],"urlList":[]}}