{"title":"The Vandals - Oi To The World (Live) (2nafish)","uid":6033164,"size":86183940,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b65b5c10520200919549066aab677f66c8605a88&amp;dn=The+Vandals+-+Oi+To+The+World+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292151466,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nOi to the World! is a Christmas album by the southern California punk rock band The Vandals. It was released in 1996 by their label Kung Fu Records, who also re-released it in 2000 with altered artwork and a bonus track. It was the band's sixth full-length studio album and presented holiday-themed songs written and performed with the tongue-in-cheek humor for which the band is known.\n\nBecause Kung Fu Records itself had been formed in 1996 and was at this point still a small label, the original pressing of the album was somewhat limited and it remained relatively obscure for several years (the band's major studio albums at this time were being released by Nitro Records). The Vandals maintained a close friendship with fellow Orange County band No Doubt, who covered the album's title track &quot;Oi to the World&quot; for a Christmas compilation in 1997. Their version, which was produced by Vandals guitarist Warren Fitzgerald, received mainstream exposure and popularity and spawned a music video. Partly thanks to the exposure brought by association with No Doubt (with whom the Vandals also toured), fan interest in Oi to the World! increased and in 2000 Kung Fu Records, which by now had grown in size, re-released the album with new artwork and a bonus overture, as well as a new intro for the title track.\n\nBecause Vandals full-time drummer Josh Freese was involved with other musical projects at the time of the album's recording, a number of fill-in drummers were recruited to play most of the drum tracks on the album: Brooks Wackerman of Infectious Grooves and Suicidal Tendencies, Erik Sandin of NOFX, and Rat Scabies of The Damned. Freese did play on three of the album's tracks, and both his brother Jason Freese and father Stan Freese also appeared playing horns. The original release was dedicated to the memory of Pat Brown, a friend of the band during their formative years and subject of their 1982 song &quot;The Legend of Pat Brown.&quot; He had died in 1996.\n\nAlmost every year since the album's release the Vandals have played a traditional &quot;Christmas Formal&quot; concert in Anaheim during the holiday season, at which they perform Oi to the World! nearly in its entirety. Other than at this special show songs from the album are rarely performed in concert, with the exception of &quot;Oi to the World,&quot; which has become a regular part of their setlist.\n\nThe Vandals are an American rock band established in 1980 in Huntington Beach, California. They have released ten full-length studio albums and two live albums and have toured the world extensively, including performances on the Vans Warped Tour. They are well-known for their use of humor, preferring to use their music as a vehicle for entertainment and sarcasm rather than as a platform for more &quot;serious&quot; issues. They are currently recording for Kung Fu Records.\n\nThe band's lineup fluctuated significantly over their first nine years, though founding members Steven Ronald Jensen, guitarist Jan Nils Ackermann, and first consistent drummer Joe Escalante remained regular fixtures. Of the early members only Escalante has remained through all subsequent incarnations of the band. The current lineup of Escalante, Dave Quackenbush, Warren Fitzgerald, and Josh Freese has remained intact since 1990 and is generally considered far removed from the band's early 1980s incarnation. Since 2002 Escalante has released all of the band's albums through his Kung Fu Records label, with Fitzgerald generally producing.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b65b5c10520200919549066aab677f66c8605a88","amp;dn":"The+Vandals+-+Oi+To+The+World+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b65b5c10520200919549066aab677f66c8605a88","infoHashBuffer":{"type":"Buffer","data":[182,91,92,16,82,2,0,145,149,73,6,106,171,103,127,102,200,96,90,136]},"announce":[],"urlList":[]}}