{"title":"The.Incredible.Human.Journey.Part.1.720p.HDTV.x264-SFM","uid":4894987,"size":1564112536,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b8c4ccdb113744414cf32f927d7e89c55ae18b03&amp;dn=The.Incredible.Human.Journey.Part.1.720p.HDTV.x264-SFM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"d_jooser","files":2,"time":1242263225,"description":"Dr Alice Roberts travels the globe to discover the incredible story of how humans left Africa to colonise the world - overcoming hostile terrain, extreme weather and other species of human. She pieces together precious fragments of bone, stone and new DNA evidence and discovers how this journey changed these African ancestors into the people of today.\n\nAlice travels to Africa in search of the birthplace of the first people. They were so few in number and so vulnerable that today they would probably be considered an endangered species. So what allowed them to survive at all? The Bushmen of the Kalahari have some answers - the unique design of the human body made them efficient hunters and the ancient click language of the Bushmen points to an early ability to organise and plan.\n\nHumans survived there, but Africa was to all intents and purposes a sealed continent. So how and by what route did humans make it out of Africa? Astonishing genetic evidence reveals that everyone alive today who is not African descends from just one successful, tiny group which left the continent in a single crossing, an event that may have happened around 70 thousand years ago. But how did they do it? Alice goes searching for clues in the remote Arabian Desert.\n\nVideo Format : x264 (in matroska container)\nVideo Resolution : 1280x720 (25 fps)\nVideo Bitrate : 2 Pass @ 3148 kb/s AVG\nAudio Bitrate : AC3 2.0 @ 384 kb/s AVG\nSample Rate : 48 kHz\nLength : 59 MiN 01 SECS\n\nThis may be a bit slow at the beginning.. but it will finish.","torrent":{"xt":"urn:btih:b8c4ccdb113744414cf32f927d7e89c55ae18b03","amp;dn":"The.Incredible.Human.Journey.Part.1.720p.HDTV.x264-SFM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8c4ccdb113744414cf32f927d7e89c55ae18b03","infoHashBuffer":{"type":"Buffer","data":[184,196,204,219,17,55,68,65,76,243,47,146,125,126,137,197,90,225,139,3]},"announce":[],"urlList":[]}}