{"title":"Accept - Midnight Mover","uid":4866826,"size":119382020,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b9af4832105c47c15e70536daa1bb6190e7bda03&amp;dn=Accept+-+Midnight+Mover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1240569754,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nMetal Heart is a 1985 release by German heavy metal band Accept. Although the group had recorded before at Dierks-Studios, this was the first album produced by Dieter Dierks himself. This album was a cautious attempt to crack the lucrative American market with more accessible songcraft and emphasis on hooks and melodies. Although critically panned at the time, today Metal Heart is often considered by fans as one of the band's best records.\n\nIt contains several of their classic songs such as &quot;Metal Heart&quot; and &quot;Living for Tonite&quot;. The band also makes a detour into jazz territory with the unusual song &quot;Teach Us to Survive&quot;.\n\nThe song &quot;Metal Heart&quot; is well known for containing the cover of two famous classical themes: Tchaikovsky's Slavonic March (in the intro) and Beethoven's FÃƒÂ¼r Elise in the solo. This song was covered in 1998 by Norwegian Black Metal band Dimmu Borgir. &quot;I had no idea it would become as popular as it did,&quot; Wolf remembers of his contribution to the song.\n\n&quot;Midnight Mover&quot;, about a drug dealer, is one of the more commercial songs on the album and was selected for a memorable music video that anticipates the bullet time filming technique by a full decade. &quot;Just ahead of our time again!&quot; jests Wolf.\n\nDespite the more commercially appealing sound of the album, it fell short of the sales figures of its predecessor Balls to the Wall in America. Udo remembers the Breaker through Metal Heart era as the time when the band got along best together. Thus this would turn out to be the last album of Accept's golden era, as cracks were soon to appear in the band's solidarity.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b9af4832105c47c15e70536daa1bb6190e7bda03","amp;dn":"Accept+-+Midnight+Mover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9af4832105c47c15e70536daa1bb6190e7bda03","infoHashBuffer":{"type":"Buffer","data":[185,175,72,50,16,92,71,193,94,112,83,109,170,27,182,25,14,123,218,3]},"announce":[],"urlList":[]}}