{"title":"Democracy Now - 17 jun 2011","uid":6476554,"size":454491003,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b9b6a085f286856590abedc592ff2ea777b2a27c&amp;dn=Democracy+Now+-+17+jun+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1308328639,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jun 17, 2011\n\n- U.S., Rebels Reject Gaddafi Proposal\n- Boehner Warns Admin on Libya War Funding\n- Rep. Weiner Resigns Over Online Photo Scandal\n- Wisconsin Senate Approves Public Spending Cuts\n- Syrian Troops Enter Northern Towns\n- Powerful Assad Cousin Divests of Holdings\n- Israel Vows to Block New Gaza Flotilla\n- Panel: Nuclear Plants Fail to Account for Japan Scenario\n- Arizona Schools Ordered to Cancel Ethnic Studies Program\n- Report: TSA Screeners Deliberately Targeted Mexicans, Dominicans at Newark Airport\n- Relatives Urge Probe of ATF Program in Border Agent's Death\n- On 40th Anniversary, Carter Calls for End to U.S. Drug War\n\n\nSpecial reports\n\n- &quot;A Moment in the Sun&quot;: An Extended Interview with Independent Filmmaker, Author John Sayles\n\nWe spend the hour with legendary independent filmmaker and author, John Sayles. Over the past three decades, he has directed 17 feature films, including The Return of the Seacaucus Seven, Matewan, Lone Star, and Eight Men Out. He has often used his films to tackle pressing political issues, as well as themes of of race, class, labor and sexuality. His newest film, Amigo, which opens in August, is set in the Philippines during the U.S. occupation. John Sayles is also celebrated author. A winner of the O. Henry award, he has just published his first novel in 20 years, called &quot;A Moment in the Sun.&quot; It is a sprawling work which takes the turn of the 20th Century in its sights-from a white-racist coup in Wilmington, North Carolina, to the first stirrings of the motion-picture industry, to the bloody dawn of U.S. interventionism in Cuba and the Philippines. We talked with Sayles about his work and career before he left to screen Amigo in the Philippines. &quot;However small your audiences, however frustrating it is to get where your version of the world or what you want to talk about out there, it is part of the conversation. If you shut up, the conversation is one-sided,&quot; says Sayles.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b9b6a085f286856590abedc592ff2ea777b2a27c","amp;dn":"Democracy+Now+-+17+jun+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9b6a085f286856590abedc592ff2ea777b2a27c","infoHashBuffer":{"type":"Buffer","data":[185,182,160,133,242,134,133,101,144,171,237,197,146,255,46,167,119,178,162,124]},"announce":[],"urlList":[]}}