{"title":"Magic,TorrentSanta -Gift.3-Michael Vincent - Rhapsodies in Silve","uid":5260809,"size":56309461,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ba0d87f09d016a3bbc78e781717623a555315011&amp;dn=Magic%2CTorrentSanta+-Gift.3-Michael+Vincent+-+Rhapsodies+in+Silve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1262722357,"description":"This one is for &quot;daniafghani&quot;. Enjoy and Merry Christmas! Ohh.. and this is really :\n\nMichael Vincent - Rhapsodies in Silver &amp; Other Mysteries  vol.1\n\n \n\nEnter a world of elegance and sophistication...\n\n...where time stops, money  #   disappears into thin air, black becomes white and white becomes black...\n\n...Michael Vincent defies all human logic as the world`s maestro of sleight of hand....\n\n...and after the huge worldwide success of The Classic Magic of Michael Vincent...\n\n...he is now back by popular demand to continue where he left off...\n\nALAKAZAM MAGIC IS VERY PROUD TO PRESENT THE MAGICAL ARTISTRY OF MICHAEL VINCENT\n\nOnce in every generation is born an individual whose work becomes known worldwide as a touchstone for excellence. With the hands of an artist and the soul of a poet, Michael is just such an individual.\n\nHis sleight-of-hand is masterful, his presentations are inventive and his performances are the epitome of class and sophistication.\n\nAs the only magician in history to have won the prestigious title of ``Magic Circle Close-up Magician of the Year`` three times, Michael has spent the better part of three decades honing his skills to become one of finest magicians that Great Britain has ever produced.\n\nThe material on this collection features some astonishing effects from Michael`s repertoire. ``Rhapsodies in Silver`` focuses on magical effects using coins, while ``Other Mysteries`` features some of Michael`s favorite card effects.\n\nVolume 2 continues where the first volume left off with Michael taking you on an introspective journey into his world of magic. Over four DVDs, you will be privy to his thoughts, beliefs and values about the craft  #   of magic.\n\nWhile the focus is on magic with coins and cards, you will also be exposed to a way of thinking, which can take your magic to another level. The pathway to excellence is all about having a road map  #   and the terrain on this DVD has been laid for you to follow.\n\nMichael amplifies his teaching  #   and mentoring with the intention to leave you moved and inspired to become even better magicians. As you watch it, you will experience for yourself why Michael`s stunning presentations are regarded by audiences and fellow professionals  #   alike as some of the very best in the world today.\n\nDisc One:THE LIVE PERFORMANCE:\n- The Slot Machine - Coins Across &amp; the Coins through the Table  #   - Match Made in Heaven - Dai Vernon`s ``Matching the Cards`` plays big. - The Two-Card Monte-Michael`s handling and presentation for Eddie Fechter`s ``Be Honest, What is it`` - The Mushin Travellers \nAll routines in the live performance are explained in full, throughout this four-disc set.\n\nTHE REVELATIONS:\n\nA Discussion on Coin Magic with Chris Harding\n\nIncluding a detailed study  #   of the fundamental coin sleights:\n\nThe Basic Palms: Finger Palm Thumb Palm The Classic Palm Transferring from different palm positions The natural look of the hand\n\nFurther sleights: The Coin Shuttle-Thanks to David Regal Vincent on The Ramsay Vanish\n\nMy Three Coins Vanish A wonderful sequence that will serve not only as a mystifying piece of elegant coin magic but will enable you to practice all of the discussed techniques in a specific context.\n\nThe Right Way to Wash Your Hands: A Study of ``The Beat`` This is an extremely valuable technique to learn and this is a perfect place to do so.\n\nMV`s Slot Machine\nMichael`s handling of a Dr Sawa routine that is a fabulous opener as well as a guaranteed ovation getter. This routine has it all: an engaging presentation, beautiful magic and the classic Vincent charm  #  .\n\n","torrent":{"xt":"urn:btih:ba0d87f09d016a3bbc78e781717623a555315011","amp;dn":"Magic%2CTorrentSanta+-Gift.3-Michael+Vincent+-+Rhapsodies+in+Silve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba0d87f09d016a3bbc78e781717623a555315011","infoHashBuffer":{"type":"Buffer","data":[186,13,135,240,157,1,106,59,188,120,231,129,113,118,35,165,85,49,80,17]},"announce":[],"urlList":[]}}