{"title":"Glamourpuss The Lady Gaga Story 2010 NTSC DVD5","uid":6366730,"size":4177391616,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bae6d11aaf92987a86494aa546488c758cf7b005&amp;dn=Glamourpuss+The+Lady+Gaga+Story+2010+NTSC+DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1304534863,"description":"Glamourpuss The Lady Gaga Story 2010 NTSC MDVDR-mVm\n\nThe most dynamic, talented and earth shattering pop phenomenon of the past decade, Lady Gaga stormed charts, graced magazines and hogged chat shows across the globe during 2009, turning herself into an international superstar before even the release of her debut album. And with Gaga s music now blasting out of speakers everywhere, her image decorating the walls of the planet and the Lady herself taking over as principal talking point in casual conversations across the world, this is an artist whose time is now. This in-depth documentary film and review uncovers the foundations on which Lady Gagas extraordinary success has been built and follows her career thereafter to the point at which it currently rests. With; detailed analysis of the Ladys background, musical growth, hit songs, concerts and videos; archive and rare footage of Gaga in interview and in performance; contributions from those who have known her best across the years; expert music journalists who have followed her career closely, and many more, plus news reports, location shoots and a host of other features\n\n\n\n","torrent":{"xt":"urn:btih:bae6d11aaf92987a86494aa546488c758cf7b005","amp;dn":"Glamourpuss+The+Lady+Gaga+Story+2010+NTSC+DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bae6d11aaf92987a86494aa546488c758cf7b005","infoHashBuffer":{"type":"Buffer","data":[186,230,209,26,175,146,152,122,134,73,74,165,70,72,140,117,140,247,176,5]},"announce":[],"urlList":[]}}