{"title":"[Q-CLONE 003] Killing Emmett Young (2002) UNCOMPRESSED DVD5 +ART","uid":5253132,"size":4398030433,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc109fe8378dbf4e52e7c4972f95de33d37faf67&amp;dn=%5BQ-CLONE+003%5D+Killing+Emmett+Young+%282002%29+UNCOMPRESSED+DVD5+%2BART&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Quidsane","files":-1,"time":1262443913,"description":"In the Philadelphia police department, Emmett Young is a hotshot, a workaholic newly promoted to homicide. He learns he has a disease that will soon kill him painfully, so he hires a stranger to arrange his own death. With one eye on the calendar (he's allowed a few days' grace before his murder), he pursues a final case, the serial killing of young women. Emmett develops a profile of the assailant. Meanwhile, his fixer hires an ex-cop to kill Emmett, a lonely security guard whom the fixer taunts and belittles. In this limited time, can Emmett sort out what's important?\n\nThe story follows Detective Emmett Young who finds out that due to a sudden and very rare disease his death will be very soon and very unpleasant. He soon meets someone who offers him a way out. He then puts out a hit on himself that is sent to a former police man and now security guard (Tim Roth). Emmett Young is soon met with another challenge of finding a violent serial killer/rapist within the time of his hit. The story unfolds perfectly with some great character study. From start to finish the story is bleak and dark which blends perfectly with the over all theme. The story also has a surprising and unsettling twist in the middle which gives the movie more tension and well as adds to the protagonists struggles. The use of dialog throughout the story helps set the mood as well as give the audience a truthful look at the 3 main characters. We see what exactly separates Emmett Young from his assassin as well as what can drive someone to make the choice to kill another person. Tim Roth gives a brilliant and chilling performance as a broken former cop who has more reason to kill than just money. Anyone who likes smart story telling as well as fine character performances will enjoy Killing Emmett Young.\n\nR1 America - (Screen Media Films)\n\nExtras: Director's Commentary, Deleted Scenes\n\nSubtitles: Spanish\n\nAspect Ratio: 2.35:1\n\nPicture Format: ANAMORPHIC\n\nTV System: NTSC\n\nSoundtrack(s): English Dolby Digital 5.1 Surround\n\nCase type: Amaray (Keep) Case\n\nNo shrinkage of any kind.\nComes with ALL artwork. (Hi-Res .png files)\nNo HD-DVD or Blu-Ray version has been released.\nAFAIK, this is the best version available...","torrent":{"xt":"urn:btih:bc109fe8378dbf4e52e7c4972f95de33d37faf67","amp;dn":"%5BQ-CLONE+003%5D+Killing+Emmett+Young+%282002%29+UNCOMPRESSED+DVD5+%2BART","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc109fe8378dbf4e52e7c4972f95de33d37faf67","infoHashBuffer":{"type":"Buffer","data":[188,16,159,232,55,141,191,78,82,231,196,151,47,149,222,51,211,127,175,103]},"announce":[],"urlList":[]}}