{"title":"J. River Media Center v13.0.166 + Patch [RH]","uid":4887309,"size":13969303,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bd1e829a7cfa860565722d13058287a46cab1e98&amp;dn=J.+River+Media+Center+v13.0.166+%2B+Patch+%5BRH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RobbingHood","files":1,"time":1241787636,"description":"\n\n\n    .-.________                                                     ________.-.\n---( )_)_______)      J. River Media Center v13.0.166 + Patch      (_______(_( )---\n  (    ()___)                                                         (___()    )\n       ()__)                                                           (__()\n--(___()_)                                                               (_()___)--\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n SPONSORED LINK                    SPONSORED LINK                   SPONSORED LINK\n ^^^^^^^^^^^^^^                    ^^^^^^^^^^^^^^                   ^^^^^^^^^^^^^^\n&lt;---------------------------------------------------------------------------------&gt;\n\nJ. River, Inc Support Website for all J. River, Inc Products &amp; Cracks:   &lt;a href=&quot;\nhttp://yabb.jriver.com/interact/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://yabb.jriver.com/interact/&lt;/a&gt;\n\nNOTE: Please do not forget to leave behind as much information as possible  \nabout where the product is from and about your personal identification data. \nYou'll then be contacted as soon as possible by the J. River, Inc Support Team! \n\n\nThank you for choosing J. River, Inc,\n\nThe J. River, Inc Support Team\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n                      J. River Media Center v13.0.166 + Patch\n\n\n\nRelease date &quot;J. River Media Center v13.0.166&quot;: may 06 2009\n\n\nOrganize and experience all your media _ music, photos, and video YOUR way - \nall from a single software program! Media Center is a software that helps you \ncollect, organize and play media files.\n \nConnect your PC to your home entertainment hardware and control it all with a \nremote! Load your music on your iPod while you watch TV! All with one easy-to-use \nprogram - MEDIA CENTER! J.River Media Center has a new user interface designed to \nmake it even easier to organize, find and play your digital files, and to connect \nto hardware devices.\n\nAll-in-one media management app turns any Windows PC into an entertainment hub \nfor complete control of your digital media. It connects PC to stereo, TV, remote \ncontrol devices, digital cameras, scanners, and portable MP3 players. It plays \nall media, rips, burns, and organizes all your music, images, and video. \nMC encodes and plays all popular media formats. Powerful utilities include Media \nServer for streaming music and images to remote PCs.\n\n\n\nHere are some key features of &quot;J. River Media Center&quot;:\n\n- Copy music from MEDIA CENTER to a portable digital audio player or move \n  digital camera photos into MC's powerful image library. Make a CD of music \n  for your car. Record your favorite shows and watch them on your TV. \n  More than one soundcard? Play different music simultaneously in different \n  rooms. MC's Media Server can even stream your music to your PC at work!\n- Camera and Images\n- Support for Canon and Kodak cameras and others that use the WIA interface. \n  Almost all cameras are supported.\n- Image enhancement during slide show or for e-mail and web upload.\n- Display color images as black-and-white or sepia.\n- JPG, BMP, TIFF, RAW and PNG support.\n- With one click, acquire images from your camera and load them into your \n  media library.\n- Basic image editing.\n- Remote control Improved learning mode and additional commands.\n- Handheld Devices\n\nFor the iPod:\n- Single Click Synchronization of iPod audio and data with MC.\n- Apply Replay Gain to files on iPod.\n- Dynamically adjust playback volumes.\n- Audible file bookmarking.\n- iPod playcounts, date last played, and rating transfer to MC from iPod.\n\nFor players that support synchronization or appear as a drive:\n- Drag and Drop on Handheld image in the Action Window.\n- One click synchronization.\n\nFor players that appear as a drive:\n- Auto create a folder structure based on tags.\n- Designate a root directory.\n- For Microsoft PlaysForSure devices\n- Support for handhelds that play Microsoft protected files and the WMDM standard.\n\n\n\nOverview:\n\n* Organize and experience all your media. Music, photos and video YOUR way - \nall from a single software program! Connect your PC to your home entertainment \nhardware and control it all with a remote! Load your music on your iPod while \nyou watch TV! All with one easy-to-use program - MEDIA CENTER!\n\n* Make your media part of your digital lifestyle. Copy music from MEDIA CENTER to \na portable digital audio player or move digital camera photos into MC's powerful \nimage library. Make a CD of music for your car. Record your favorite shows and \nwatch them on TV. More than one soundcard? Play different music simultaneously \nin different rooms. MC's Media Server can even stream your music to your PC at \nwork!\n\n* Organize your images. The main image screen, showing thumbnails of digital \ncamera images. An optional properties page can be opened to show details about \neach image.\n\n* Theater View. A unique full screen mode. This customizable view is designed for \nbrowsing your media on a monitor or TV from across the room. Type is enlarged and \nnavigation is simplified for easy use with a remote device.\n\n* Mobilize your tunes. MC supports more hardware players than any other \napplication. Now you can synchronize your library with your Apple iPod or \none of many supported devices. \n\n* Copy music from MEDIA CENTER to a portable digital audio player or move \ndigital camera photos into MC's powerful image library. \n\n* Make a CD of music for your car. Record your favorite shows and watch them \non your TV. More than one soundcard? Play different music simultaneously \nin different rooms. \n\n* Cover View\nMC has a new view showing album covers for audio tracks Note the new \n&quot;My Computer&quot; section of the organization tree, where you can browse \nyour drives without leaving the application. \n\n* Digital Images\nThe main image screen, showing thumbnails of digital camera images. An optional \nproperties window can be opened for details about each image Minor edits can be \nmade with the included Image Editor.\nTheater View Prefer to browse your media from the comfort of the couch? This \ncustomizable view is designed for use from across the room on a monitor or TV. \nType is enlarged and navigation is simplified so it's easy to use with a remote.\n\n* PLAY your media YOUR way\nCreate a slideshow of your vacation photos, and add a music soundtrack from \nyour song library. Get the party started with a playlist of hot tunes. Or let \nMC do the work by picking an Auto Smartlist, such as an hour of random music, \na CD of MP3 favorites, an audio CD of recently played tracks etc.\n\n* Slideshow\nDigital images can be screened in an automated slideshow. You can stop to \nzoom in on a single image, pan from side to side, and then resume. All with \nyour favorite music playing in the background. \n\n* Slideshow options \nChange the look of your slide show by altering the timing between images, \ntransition effects and more.\n\n* Auto Smartlists\nAn hour of random music, a CD of MP3 favorites, an audio CD of recently \nplayed tracks, all tracks with empty properties. These and more are what \n&quot;Auto Smartlists&quot; are about. \n\n* Powerful TV Features\nTV recording, pause, resume, fast forward and re-wind. Control it using \na remote device across the room or a PDA, PocketPC or TabletPC.\n\n* ORGANIZE your media YOUR way\nWant to arrange your pictures by subject, date, and location? Categorize your\nmusic by artist, album, genre and assign a star-rating to your favorite songs? \nOr sort your videos by director, cast and year? Do it easily with the world's \nmost powerful and flexible media library. Even add your own custom categories.\n\n* File Browser\nA new section of the Organization Tree called &quot;My Computer&quot; lets you browse \nall your files and folders as with Windows Explorer. You can even see files \nyou haven't imported and files on your portable music player. \n\n* Flexible views \nYou can add new &quot;view schemes&quot; under any media type so you can see your files, \narranged as you want to see them.\n\n* CD and Track Lookup\nJ. River's YADB database is the most trouble-free and accurate database \navailable for CD titles and tracks. Audio fingerprinting also lets you \nlook up track names on individual tracks. \n\n* Extensive Tagging Capabilities\nMC supports ID3v1 and ID3v2 for music. It supports J. River tags for photos. \nIt can also import MusicMatch tags. You can fill the tags from the file names, \nre-name files from the tags, clean tags and much more. When the files are moved \nand re-imported, the organization is restored.\n\n\n\nWhat's new in J. River Media Center v13.0.166:\n\n* Fixed: With the ripping option to overwrite existing files enabled \n  some encoders would not work(only applies to last few builds)\n* Fixed: Using incomplete math syntax like &quot;3 /&quot; or &quot;2+1+&quot; could cause \n  problems in expressions.\n* Changed: DSP Plug-ins are always loaded from the main user interface\n  (solves problems with plugins that create user interface at load \n   instead of when requested by Media Center like DFX)\n* Optimized: Improved performance of JRiver edit / expression controls.\n\n\nNote: Russian language included.\n\n\n\nSystem Requirements: \n\n- Windows All \n- 600 MHz Pentium\n- 32 MB RAM\n- 40 MB Free hard drive space\n- Sound card\n- Video card\n- Microsoft Internet Explorer I.E. 5.0 or above\n- Internet connection (recommended).\n\n\n\nMore info: &lt;a href=&quot;\nhttp://www.jrmediacenter.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jrmediacenter.com/&lt;/a&gt;\n\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n&gt;&gt;&gt;When using TPB please read these important notes: \n****************************************************\n\n01- Anti-malware apps may warn about keygens, patches, cracks etc because of \n    their capabilities (generating codes, etc). Sometimes also they're added to \n    the virus/spyware database and will be detected as malware. If not trusting \n    keygens, patches, cracks etc don't use them.\n\n02- Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it and uploaded it again.\n\n03- Letting antimalware-apps sending scanning-results to their companies can coz\n    keygens, patches, cracks etc being added to their virus-database.\n\n04- Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n05- Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n06- Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n07- Clicking on unknown links can coz malware being silently installed on a pc!\n  \n08- In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n09- In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n10- Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n\nFor reporting bad or suspicious torrents:  &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nFor visiting &quot;TPB's Most Ridiculous Comments&quot;:  &lt;a href=&quot;\nhttp://suprbay.org/showthread.php?t=30402&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/showthread.php?t=30402&lt;/a&gt;\n\nFor visiting my account*:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/RobbingHood/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RobbingHood/&lt;/a&gt;\n\n*All torrents scanned with:\n1- Norton Internet Security  \n2- Avast! Antivirus AV Pro  \n3- AVG Antivirus Pro   \n4- Kaspersky AV Pro  \n5- NOD32 AV  \n\n...and also with most well known antispyware. Reported malware detected by \n   other anti-malware apps probably are false positives!\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n\n\nTo the &quot;United Reliable Pirate Bay Users&quot;,\n\nNowadays a lot of PB members abuse their PB membership by intenionally posting \nfake comments &amp; files. Their meaning is just to spread confusion and try to \nfrustrate PB and it's users. And less downloaders = less seeders = less \ndownloadspeed etc etc. \n\nIt's in the benefit of PB and all reliable users to warn each other about people \nwho intenionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intenionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and PB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay\n                                         \n* Status torrent at may 08 2009 - 11.45 CET: clean, tested &amp; working.","torrent":{"xt":"urn:btih:bd1e829a7cfa860565722d13058287a46cab1e98","amp;dn":"J.+River+Media+Center+v13.0.166+%2B+Patch+%5BRH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd1e829a7cfa860565722d13058287a46cab1e98","infoHashBuffer":{"type":"Buffer","data":[189,30,130,154,124,250,134,5,101,114,45,19,5,130,135,164,108,171,30,152]},"announce":[],"urlList":[]}}