{"title":"Not Quite Hollywood (2008) DvDrip.Avi","uid":4723209,"size":733702144,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bdc7fd9208cb59d60f7ac08b1353ab0931bfbaf6&amp;dn=Not+Quite+Hollywood+%282008%29+DvDrip.Avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sherwood10001","files":-1,"time":1234622191,"description":"Not Quite Hollywood (2008) DvDrip.Avi\n\nGenre:  Documentary\nIMDB: http://www.imdb.com/title/tt0996966/\nIMDB Rating: 8.0/10   (340 votes)\nLanguage: English\nRuntime: 103 minutes\nDvD Release: January, 2009\nWinner of the 2008 Australian Film Institute Award for Best Documentary\n\nNOT QUITE HOLLYWOOD is the wild, untold story of &quot;OZPLOITATION&quot; movies - a time when Australian cinema got its gear off and showed the world a full-frontal explosion of sex, violence, horror and foot-to-the-floor, full bore action!   It is jam packed full of outrageous anecdotes, lessons in maverick filmmaking and a genuine, infectious love of Australian movies.  This film is a fast moving journey through Aussie genre cinema of the 70s and early 80s - an unjustly forgotten cinematic era unashamedly packed full of boobs, pubes, tubes... and even a little kung fu.\n\nYou may discover a whole host of previously undiscoverd (by you) Australian movies to enjoy, which range from sex comedies, car chase films, hardcore horror and kung fu flicks.  This tribute to the Ozploitation genre moves at an almost non-stop pace and is full of hilarious interviews, great clips and interesting tales of on-set accidents and rowdy actors.  In the section titled &quot;Comatose Killers and Outback Chillers.&quot; USA film producer and director Quentin Tarantino, a confessed fan of Australian horror films, reels off his favourites and tells how they have inspired some of his films.  In the section titled &quot;High Octane Disasters and Kung Fu Masters.&quot; Tarantino shows a vast knowledge and passion for Australian film car chase scenes and the &quot;fetishistic&quot; way they are filmed, epitomized by the cult classic Mad Max (1979).\n\nThis documentary about Australia's contribution to cinematic immortality is very well made, to the point, funny and always captivating.\n\n\n..........................\n\n","torrent":{"xt":"urn:btih:bdc7fd9208cb59d60f7ac08b1353ab0931bfbaf6","amp;dn":"Not+Quite+Hollywood+%282008%29+DvDrip.Avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdc7fd9208cb59d60f7ac08b1353ab0931bfbaf6","infoHashBuffer":{"type":"Buffer","data":[189,199,253,146,8,203,89,214,15,122,192,139,19,83,171,9,49,191,186,246]},"announce":[],"urlList":[]}}