{"title":"Coast.to.Coast.AM.June.01.2009-komie","uid":4929034,"size":55115953,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bf2622fb6eefa8e24853a7fb6671f0ec4043b3d9&amp;dn=Coast.to.Coast.AM.June.01.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":6,"time":1243966255,"description":"Cosmology &amp; Discoveries\n\n\n\nDate:\n06-01-09\n\nHost:\nGeorge Noory\n\nGuests:\nBrian Greene, William R. Forstchen\n\n\nProfessor of physics and mathematics at Columbia University, Brian Greene discussed discoveries in cosmology, as well as the groundbreaking Superstring Theory and other current research. Einstein's quest for a Unified Field Theory went unfulfilled in his lifetime, but it's possible that String Theory could turn out to be the uniting explanation he was looking for. The theory suggests that inside the smallest known particles such as quarks and electrons even smaller objects exist-- filaments or strings that vibrate and produce different particles.\n\nRelated to this is the idea that we may live in a world with as many as 11 different dimensions. Yet these dimensions may not be that exotic-- they could just not be visible to humans, he explained. The Big Bang could be happening in an ongoing fashion creating new universes, like bubbles, and it might be possible someday to communicate with these other universes through gravitational signals, Greene noted.\n\nIt's possible our universe is not curved but like a gigantic cube that goes on forever, such that if you kept going you would never return to your starting place, he detailed. A black hole could be thought of as a moment where time ends, rather than a specific location, Greene continued. He is looking forward to the upcoming experiments at the Hadron Collider, which could yield new breakthroughs and surprises in physics.\n\nEMP Attack\n\nFirst hour guest, author William Forstchen outlined how an EMP (electromagnetic pulse) attack could be carried out on the United States and the effects it would have. Detonating several small fission bombs at various locations above the country would build up an electrostatic discharge in the atmosphere and knock out the power grid, he said. Forstchen urged people to have emergency supplies on hand, band together with neighbors, and push for congressional action on this threat.\nWebsite(s):\n# worldsciencefestival.com\n# onesecondafter.com\nBook(s):\n# The Fabric of the Cosmos: Space, Time, and the Texture of Reality\n# The Elegant Universe\n# Icarus at the Edge of Time\n# One Second After\n","torrent":{"xt":"urn:btih:bf2622fb6eefa8e24853a7fb6671f0ec4043b3d9","amp;dn":"Coast.to.Coast.AM.June.01.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf2622fb6eefa8e24853a7fb6671f0ec4043b3d9","infoHashBuffer":{"type":"Buffer","data":[191,38,34,251,110,239,168,226,72,83,167,251,102,113,240,236,64,67,179,217]},"announce":[],"urlList":[]}}