{"title":"The Herring Seller's Apprentice - L. C. Tyler.epub","uid":9346827,"size":433353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c00bcd60947e01333bb2bbd28238ea0e0ee91cdc&amp;dn=The+Herring+Seller%27s+Apprentice+-+L.+C.+Tyler.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387053280,"description":"Ethelred Tressider is a crime writer with problems. His latest novel is going nowhere, mid-life crisis is looming and he's burdened by the literary agent he probably deserves: Elsie Thirkettle, a diminutive but determined individual who claims to enjoy neither the company of writers nor literature of any sort. But however bad things look they can always get worse, as Ethelred discovers when his ex-wife, Geraldine, vanishes close to his Sussex home. When the disappearance becomes a murder enquiry, the police quickly decide that Geraldine Tressider has been the victim of a local serial killer.Elsie begs to differ, on the grounds that the killer's other victims had been Sad Cows, whereas Geraldine was a Scheming Bitch - another species entirely - and no serious serial killer would murder one in mistake for the other ...Soon the indefatigable Elsie has bullied Ethelred into embarking upon his own investigation, but as their enquiries proceed, she begins to suspect that her client's own alibi is not as solid as he claims.","torrent":{"xt":"urn:btih:c00bcd60947e01333bb2bbd28238ea0e0ee91cdc","amp;dn":"The+Herring+Seller%27s+Apprentice+-+L.+C.+Tyler.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c00bcd60947e01333bb2bbd28238ea0e0ee91cdc","infoHashBuffer":{"type":"Buffer","data":[192,11,205,96,148,126,1,51,59,178,187,210,130,56,234,14,14,233,28,220]},"announce":[],"urlList":[]}}