{"title":"Peg Leg Sam Early in The Morning(blues)(flac)[rogercc]","uid":5960715,"size":219258621,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c7fb410f4b299a95b536f14079a216bdbef91624&amp;dn=Peg+Leg+Sam+Early+in+The+Morning%28blues%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc1","files":13,"time":1289943839,"description":"PEG LEG SAM EARLY IN THE MORNING\nRecorded: 1975\nReleased:1995\nLabel:Labor Records\nFormat:Flac\n\n\nPeg Leg Sam is considered by many blues players to have been on equal footing with the great Sonny Terry and Sonny Boy Williamson. His impassioned performance, here mostly of traditional rural blues classics, are delivered with the authority and simplicity of a long and colorful life lived only by the rules of the blues. \n\nA rover from the age of twelve, Peg leg Sam cooked on ships, hoboed, shined shoes and blew harmonica on street corners for change. His peg leg resulted from a failed attempt to hop a freight train out of Raleigh, North Carolina as a young man - he fashioned it himself from a fencepost after recovering from the wound. There is no government record of his existence other than his birth (1911) and death (1977) certificates in Jonesville, South Carolina; he never filed or paid taxes, never married or had children or had anything to do with a permanently settled lifestyle. \n\nPerhaps it doesn't take all this to be a great musician, to sound like an original and not an imitator. However, it doesn't seem to have hurt Peg Leg Sam in the least. In his travels he picked up the art of playing two harmonicas simultaneously and developed his abilities as an entertainer. Throughout much of the 1940's and 50's he made his living as an attraction at traveling carnivals and medicine shows in the rural South. By the 1970's he was recording for independent blues labels and performing on the festival and blues club circuit solo and with Ruff Johnson, Sugar Blue and Louisiana Red. His last recording, Early in the Morning, should be considered a classic of the blues harmonica discography.\n\n\n\nTracklist\n1.Joshua Fit The Battle Of Jericho 3:21 \n2.Navaho Trail 4:41 \n3.John Henry 5:57 \n4.Going Train Blues 3:15 \n5.Mr. Ditty Wa Ditty 4:22 \n6.Strollin' 4:54 \n7.I Got A Home 4:42 \n8.Dog Chase 3:02 \n9.Early In The Morning 3:02 \n10.Poor Boy 3:46\n\nPersonnel:\nPeg Leg Sam - Vocals,Harp\nLouisiana Red - Guitar,Vocals\n\n\n","torrent":{"xt":"urn:btih:c7fb410f4b299a95b536f14079a216bdbef91624","amp;dn":"Peg+Leg+Sam+Early+in+The+Morning%28blues%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7fb410f4b299a95b536f14079a216bdbef91624","infoHashBuffer":{"type":"Buffer","data":[199,251,65,15,75,41,154,149,181,54,241,64,121,162,22,189,190,249,22,36]},"announce":[],"urlList":[]}}