{"title":"doktorn kan komma 70-74.rar","uid":4630282,"size":7616293292,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ca9e0dae33b16cd04eb08a2eb25067874363c321&amp;dn=doktorn+kan+komma+70-74.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fiskkatten","files":1,"time":1231362090,"description":"70. The forbidden \nA land inspector visits and falls down a cave after being warned by an aboriginal spirit to stay away. He is rescued but is very ill. Geoff asks Dougie for help in getting the curse removed. The man recovers but his tests show he has a disease caused by bat droppings. Mike visits Chris and brings his two daughters with him. The whole town starts talking about Chris, so Mike leaves but states he will be back. Sam's sister, Paula, also comes to the Crossing, she got a job as radiographer at the hospital.\n\n71. She'll be right \nHurtle returns to the crossing driving a Rolls Royce, which is stolen, but he doesn't know. Constable O'Connor is advised to look out for the stolen car, so Hurtle and Vic hide it. Jack returns and he finds out Hurtle and Vic are up to no good. Mike tells Chris he has asked his wife for a divorce, but receives a call saying his wife has taken the children back to France. He asks Chris to go with him but she refuses. Mike leaves, and Chris cries on Jack's shoulder. \n\n72. One final request \nAn old lady is dying. Geoff and Kate keep her company, as she won't leave her house. She tells Geoff and Kate not to hesitate to say that they are in love with each other. Hurtle and Vic must appear to court because they owned a stolen car.\n\n73. Roxanne \nEmma is going out to fix a tractor, despite Sam's and Paula's protests. On the road she sees a car in trouble. Inside she finds Roxanne and Kenny, both on the run from the police after a robbery. Kenny has been shot and is in a dreadful state. Roxanne forces Emma, under gunpoint, to ditch their car, and drive them to an abandonned shed in the bush. Late at night Kenny gets worse, so Emma and Roxanne go into town and get Chris. Sam has already reported Emma missing, but no one misses Chris until the following morning. A search is organised and finally they find Chris and Emma, who has been under a lot of strain, since Roxanne has been taking amfetamines. \n\n74. Don't tell anybody \nA school picnic is held at a property belonging to a man named Rodney. He claims a ghost lives there too, called Mick. Geoff and Kate are there, to teach the kids first aid. Later on the town people gather out there, except for Maggie, Emma, Chris and Lucy, who look after the pub. Geoff and Sam are called out on an emergency, but get terribly frightened by a dog! They swear, however, not to tell anybody. At night three nasty men arrive at the pub, which scares the women a bit. On the property Marty decides that he's going to sleep in Mick's room, to see if he is real. Paula scares him during the night, pretending to be a ghost. Marty runs away and falls down a gully! Sam is getting very worried about Emma, he can't reach her on the phone. He rushes back the following morning, only to find her and the other women having a nice breakfast with the nasty blokes from the previous night. Before Jack leaves Rodney's property, he actually sees Mick, in whom he had never previously believed, but when he tells Chris, she just laughs. \n\n","torrent":{"xt":"urn:btih:ca9e0dae33b16cd04eb08a2eb25067874363c321","amp;dn":"doktorn+kan+komma+70-74.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca9e0dae33b16cd04eb08a2eb25067874363c321","infoHashBuffer":{"type":"Buffer","data":[202,158,13,174,51,177,108,208,78,176,138,46,178,80,103,135,67,99,195,33]},"announce":[],"urlList":[]}}