{"title":"Democracy Now - 31 aug 2010","uid":5801482,"size":454893559,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cd9eece25bb313de0ebb3aa901bb50822ab96e39&amp;dn=Democracy+Now+-+31+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1283272188,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 31, 2010\n\n- Obama to Declare End to Combat Operations in Iraq\n- UN: Iraq Still Faces Humanitarian Crisis\n- Gibbs: US Is Increasing Fight Against al-Qaeda in Africa and Southeast Asia\n- Obama Administration Sued over Plan to Assassinate US Citizens\n- 19 US Troops Killed Since Saturday in Afghanistan\n- Anti-Mosque Rhetoric in US Reportedly Boosts Taliban Recruitment\n- Candlelight Vigil in Tennessee Condemns Arson at Mosque Site\n- Predator Drones to Begin Patrolling Texas-Mexico Border\n- Obama Urges Senate GOP to Pass $30 Billion Jobs Bill\n- One in Six Americans Now Enrolled in Anti-Poverty Programs\n- Mice, Maggots, Manure Found At Factory Egg Farms Linked to Salmonella Outbreak\n\n\nSpecial reports\n\n- Draft UN Report Accuses Rwandan Troops of Committing Genocide in the Congo\n\nRwanda is facing explosive allegations from the United Nations of committing war crimes and possibly even genocide in the Democratic Republic of Congo. A leaked report from the UN high commissioner for human rights says that after the 1994 genocide in Rwanda, Tutsi-led Rwandan troops and their rebel allies killed tens of thousands of members of the Hutu ethnic group inside the Congo.\n\n\n- Slain Latino Journalist Ruben Salazar, Killed 40 Years Ago in Police Attack, Remembered as Champion of Chicano Rights\n\nRuben Salazar was one of the most well-known Latino journalists of the 20th Century and one of the few journalists killed while reporting in the United States. This Sunday marked the 40th anniversary of his death. He was killed on August 29th, 1970 when he was struck in the head by a tear gas projectile fired by a Sheriff's deputy into an East Los Angeles bar as he was covering the massive National Chicano Moratorium Against the Vietnam War, a massive antiwar march that drew some 30,000 people to LA's Eastside. For forty years, speculation and controversy have swirled around what happened. We remember the life and legacy of Salazar and the Chicano Moratorium.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:cd9eece25bb313de0ebb3aa901bb50822ab96e39","amp;dn":"Democracy+Now+-+31+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd9eece25bb313de0ebb3aa901bb50822ab96e39","infoHashBuffer":{"type":"Buffer","data":[205,158,236,226,91,179,19,222,14,187,58,169,1,187,80,130,42,185,110,57]},"announce":[],"urlList":[]}}