{"title":"Zodiac Unmasked.mobi","uid":5760522,"size":1011552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d11983553c8dd223fb0a2de4adb4430cd2042b1c&amp;dn=Zodiac+Unmasked.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pgnds","files":1,"time":1281714920,"description":"Rarely have the crimes of a serial murderer captured the imagination and fears of the entire country as did the unsolved &quot;Zodiac&quot; killings in the Bay Area in the 1970s. Close to the investigators and long obsessed with the case, Graysmith reputedly knows more about the killer than anyone else. His popular 1986 Zodiac offered such a thorough account that even a lead investigator used it as a reference. In that book, , seasoned true-crime author Graysmith identified the most likely suspect though only under a pseudonym, Richard Starr, hoping the book would trigger a reader to come forward with incontrovertible evidence. The suspect died in 1992, and in this follow-up to Zodiac, Graysmith now identifies &quot;Starr&quot; by his real name, Arthur Leigh Allen, a terrifying sociopath and convicted pedophile whom police long considered the prime suspect. Culled from official records and new interviews conducted in recent years, the latest book excavates the still burgeoning 30-year history of investigations into the Zodiac murders six confirmed and dozens of others that the killer claimed to have committed, and who spawned a score of copycat killers, most recently a 15-year-old from Kobe, Japan. The Zodiac case is convoluted at its heart and though Graysmith's evidence against Allen plays solidly, the narrative often gives way to unexpected segues and jumps in time. To keep track of this case that has more facets than a diamond, readers will need a scorecard. Photos and other supporting material in the book were not seen by PW. ","torrent":{"xt":"urn:btih:d11983553c8dd223fb0a2de4adb4430cd2042b1c","amp;dn":"Zodiac+Unmasked.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d11983553c8dd223fb0a2de4adb4430cd2042b1c","infoHashBuffer":{"type":"Buffer","data":[209,25,131,85,60,141,210,35,251,10,45,228,173,180,67,12,210,4,43,28]},"announce":[],"urlList":[]}}