{"title":"Beyond Recall - Robert Goddard  (Unabridged)","uid":6052876,"size":165211598,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d2a4c5a635c0ce401f6f5c7860e584107e4d5c03&amp;dn=Beyond+Recall+-+Robert+Goddard++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lucy1948","files":22,"time":1292799286,"description":"Unabridged and read by Michael Kitchen. 11 Hours 28 Mins duration.10 Cassettes. (Fraunhofer CBR 32 kbit/s 22050 Hz Mono, jetAudio 6.2+)\n\n\n[Goddard's 10th Novel]\n\nHere again Goddard creates a narrator who uncovers secrets buried in the past that cast grim shadows on later generations. He takes classic English mystery staples - a grand old house in Cornwall, a family fortune in dispute, murder and blackmail and concocts an absorbing suspense novel with a modern sensibility.\n\nAlienated from his family for some years, Chris Napier returns home to the Cornish town of Truro for his niece's wedding at Tredower House, the family estate (now a hotel and conference center) bequeathed by his adventurous great uncle, Joshua Carnoweth. Guests are reminded of an unpleasant event when Chris's boyhood friend, Nicky Lanyon, shows up at the reception to announce that his father, who was hanged for the murder of Uncle Joshua, was innocent of the deed. Nicky culminates his plea by committing suicide. In Nicky's memory, Chris investigates the 34-year-old murder case, while one mysterious woman goes after his money and another wins his heart.\n\nGoddard intricately interweaves the life stories of three generations, adding texture to the parallel plots: the love between his great-uncle and Nicky's grandmother, the moral crises of the WWII generation and Chris's own tale of 1960s rebellion. \n\nAs usual, Goddard is meticulous with background details and local color, and his characters, with their good manners and dark secrets, seem to have stepped out of a Daphne Du Maurier novel. There are enough surprises in this tale of switched identities and lingering resentments to keep readers steadily engrossed.","torrent":{"xt":"urn:btih:d2a4c5a635c0ce401f6f5c7860e584107e4d5c03","amp;dn":"Beyond+Recall+-+Robert+Goddard++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2a4c5a635c0ce401f6f5c7860e584107e4d5c03","infoHashBuffer":{"type":"Buffer","data":[210,164,197,166,53,192,206,64,31,111,92,120,96,229,132,16,126,77,92,3]},"announce":[],"urlList":[]}}