{"title":"Oorlog van de eeuw dvd 5(Dutch)(Dorien)","uid":5963532,"size":4512909443,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d5affa392020beca6e525cb677045625b9943dc6&amp;dn=Oorlog+van+de+eeuw+dvd+5%28Dutch%29%28Dorien%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dorien69","files":40,"time":1290031427,"description":"\n\nDe Oorlog Van De Eeuw 5/10       \n\nIn alle documentatie tot nu toe is deze oorlog gewoonlijk gepresenteerd vanuit het nationale gezichtspunt. \nngeveer 60 jaar na het einde van de oorlog is de tijd rijp om, nu de overlevenden nog steeds onder ons zijn, voormalige vijanden elkaar de hand te laten schudden en te laten zien wat voor een oorlog dit was. \nHierbij is gebruikgemaakt van authentiek filmmateriaal, veel er van in kleur en de verhalen van ooggetuigen van beide zijden. Vooraanstaande internationale historici namen tevens deel aan dit project. \nDeze geschiedenis presenteert naties die eens bittere vijanden waren in bijna gelijke beelden en televisiecommentaren gerelateerd aan het meest pijnlijke hoofdstuk uit de twintigste eeuw.\nGebeurtenissen, beschreven door de overlevenden: Duitsers en Amerikanen,en Russen, Polen en Fransen.\nVoordat het te laat is...\n\nDe weg naar Stalingrad\nZomer 1942: Volograd, voormalig Stalingrad. De plaats van de meest bloedige slag tijdens de gehele Tweede Wereldoorlog. \nEen grote Duitse aanval penetreerde tot diep in het zuiden van Rusland. Niets ontziend viel Hitler ook de Russische burgers meedogenloos aan. \nMiljoenen stierven de hongerdood. Bij Stalingrad vochten de legers, met hevige verliezen aan beide zijden, vijf maanden lang. \nTenslotte viel de strenge Russische winter in die het keerpunt zou zijn in deze oorlog: de terugval van het Duitse leger. \nHet Rode Leger lanceerde een tegenaanval met meer dan een miljoen soldaten, brak door de Duitse linies heen en omsingelde 300.000 Duitse soldaten van het Zesde Leger. \nSlechts 6.000 zouden uiteindelijk terugkeren naar Duitsland... De executie van een geheel leger.\n\nHet geheim van de U166\nDe onderzeeboten van Hitler zaaiden dood en verderf in de Tweede Wereldoorlog. Niet alleen in de Europese wateren maar zelfs tot de Golf van Mexico toe. \nJonge U-boot bemanningen werden in de propagandafilms van het Derde Rijk vereert als helden. Na de aanval van Japan op Pearl Harbor verklaart Hitler ook de oorlog aan de Verenigde Staten. \nZijn 'grijze wolven' torpederen meer dan 400 handelsschepen voor de Noord Amerikaanse kust. De U166 is daar in de zomer van '42 ook actief, maar keert niet terug naar Duitsland. \nTot februari 2001 blijft het onduidelijk wat de U166 is overkomen, dan vinden onderzoekers van oliemaatschappijen de U-boot terug op een diepte van 1.500 meter. \nWat is het geheim van de U166?\n\n\nNEDERLANDS GESPROKEN\n\nSpotinformatie\n \nCategorie    : Beeld \nFormaat      : DVD5 \nBron         : Retail\nOndertitels  : Nederlands (instelbaar)\nGenre        : Documentaire\n\n\n &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+5/10&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=Oorlog+van+de+Eeuw+5/10&lt;/a&gt; \n\n\n \n \n*****************************************\n\nBrought to you by Dorien\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d5affa392020beca6e525cb677045625b9943dc6","amp;dn":"Oorlog+van+de+eeuw+dvd+5%28Dutch%29%28Dorien%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5affa392020beca6e525cb677045625b9943dc6","infoHashBuffer":{"type":"Buffer","data":[213,175,250,57,32,32,190,202,110,82,92,182,119,4,86,37,185,148,61,198]},"announce":[],"urlList":[]}}