{"title":"Pes 2009 Solo Campeones (sc)","uid":4656396,"size":4374364160,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d87779084118090b433d90f507bbe0e026894c37&amp;dn=Pes+2009+Solo+Campeones+%28sc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"davidr332","files":1,"time":1232217567,"description":"Bueno este es el verdadero PES 2009 SOLO CAMPEONES , no como el que pusieron anteriormente que quedaba hasta 52,1% el computador lo dejare prendido para que haga seed durante algunos dÃƒÂ­as lo ÃƒÂºnico que les pido es que cuando terminen al 100% la descarga hagan seeding ustedes tambn para que mas gente se lo descargue\n\nPD: para que el juego quede al 100% tienen que cargar el OPTION FILE estas son las Instrucciones de La instalaciÃƒÂ³n:\nSe  necesita la memory card y tenerla insertada al poner el cd.\nPaso 1:graben la option file que es una archivo bin cue con el alcohol 120% en un CD ( importante tiene que ser CD)\nPaso2:Arrancamos nuestra PS2 con el cd que acabamos de grabar.\nPaso3:Presionamos el botÃƒÂ³n R1 del controlador uno (aparese una ventanilla con unas opciones hacie el costado derecho arriba)\nPaso4:Mueve el cursor hasta abajo, con la opciÃƒÂ³n &quot;cdfs:&quot; marcada. Esto mostrarÃƒÂ¡ en contenido del CD.\nPaso5:Mueve el cursor hasta el archivo con extencion &quot;npo&quot;  y presiona el botÃƒÂ³n &quot;triangulo&quot;. \nPaso6:El archivo de opciones se pasarÃƒÂ¡ en pocos segundos a la memory card.\nPaso7:cuando termine de copiar reinicias la play y retiras el disco pones el disco del juego y cargas la memory y a disfrutar. \nespero q haiga  servido de algo saludos!!!\n\nPD: el archivo option file bÃƒÂºsquenlo por Option File Pes 2009 solo campeones.\n","torrent":{"xt":"urn:btih:d87779084118090b433d90f507bbe0e026894c37","amp;dn":"Pes+2009+Solo+Campeones+%28sc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d87779084118090b433d90f507bbe0e026894c37","infoHashBuffer":{"type":"Buffer","data":[216,119,121,8,65,24,9,11,67,61,144,245,7,187,224,224,38,137,76,55]},"announce":[],"urlList":[]}}