{"title":"Cake Like - Bruiser Queen","uid":4486925,"size":40554817,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d9130f2770ae8e2fe5dbb9464bf3be0e44807171&amp;dn=Cake+Like+-+Bruiser+Queen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nigeldpablo","files":-1,"time":1225812642,"description":"Cake Like was an all-women indie rock band. Its members were bassist and lead singer Kerri Kenney-Silver (under her then maiden name Kerri Kenney), drummer Jody Seifert and vocalist and guitarist Nina Hellman. Kenney-Silver is also an actress who has appeared in the TV shows The State, on MTV, Viva Variety, which she also co-wrote, for the Comedy Central network, and as the character &quot;Pam&quot; on The Ellen Show. Now most recently she is on Comedy Central&amp;#039;s Reno 911!. Nina Hellman is also an actress and works in the theatre in New York and appeared in the film Wet Hot American Summer, as well as providing voices for several episodes of The Venture Bros. Seifert works in the fashion industry. The band came together in 1993 when Kenney-Silver and Hellman met at New York University&amp;#039;s Experimental Theater Wing, decided to form a band, and were joined by Hellman&amp;#039;s roommate Seifert. The members had never played music before and so developed their own unique style. Their songs often play out like poetry set to erratic guitar-rock. They soon attracted the attention of John Zorn, who signed the band to his Avant Records label, which released their first LP. This record came to the attention of Ric Ocasek, formerly of The Cars, who produced their follow-up EP. He then brought the band to the attention of Neil Young, who signed the band to his Vapor Records label for their second and third LPs. The band dissolved in 1999 when Kenney-Silver relocated to Los Angeles.\n\nTracklisting:\n1 \t  \tThe New Girl (2:17)\n2 \t  \tWendy (2:19)\n3 \t  \tMr. Fireman (3:10)\n4 \t  \tGroovy (2:01)\n5 \t  \tLatin Lover (2:39)\n6 \t  \tPretty New (3:40)\n7 \t  \tLorraine&amp;#039;s Car (3:26)\n8 \t  \tFranchise (2:51)\n9 \t  \tCancer (3:19)\n10 \t  \tThe American Woman (2:02)\n11 \t  \tTruck Stop Hussy (3:24)\n12 \t  \tDestroyed (2:28)","torrent":{"xt":"urn:btih:d9130f2770ae8e2fe5dbb9464bf3be0e44807171","amp;dn":"Cake+Like+-+Bruiser+Queen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9130f2770ae8e2fe5dbb9464bf3be0e44807171","infoHashBuffer":{"type":"Buffer","data":[217,19,15,39,112,174,142,47,229,219,185,70,75,243,190,14,68,128,113,113]},"announce":[],"urlList":[]}}