{"title":"David Lewis: Convention. A Philosophical Study","uid":4569867,"size":43835665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d93b26cc770ae3b3e113ba0ef5d7c875fdb7fb92&amp;dn=David+Lewis%3A+Convention.+A+Philosophical+Study&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kuuskivi","files":1,"time":1229017355,"description":"David Lewis: Convention. A Philosophical Study\n\n\nConvention was immediately recognized as a major contribution to the subject and its significance has remained undiminished since its first publication in 1969. Lewis analyzes social conventions as regularities in the resolution of recurring coordination problems - situations characterized by interdependent decision processes in which common interests are at stake. Conventions are contrasted with other kinds of regularity, and conventions governing systems of communication are given special attention. \n\n\n&quot;This book is my attempt at an analysis of our common, established concept of convention, so that you will recognize that it explains what you must have in mind when you say that language is governed by conventions. Language is only one among many activities governed by conventions that we did not create by agreeing and that we cannot describe.&quot; David Lewis\n\n&quot;Readers will be indebted to the author of this book.&quot; Philosophical Quarterly\n\n&quot;The notion of convention has served philosophers since Aristotle as a convenient exploration of the arbitrary character of referential word meaning. In 1936 Willard Quine, pursuing the notion of analyticity, called attention to the emptiness of this explanation. David Lewis has attempted to re-establish the notion of convention as a partial explanation of analytic truth [and his] explication of &quot;convention&quot; is a tour de force of Humean analysis.&quot; Philosophy and Rhetoric\n\n&quot;This book has been published for quite some time. Its significant contribution is no longer in question [and it will] remain a central reference for discussions on the nature of conventions. An excellent book for teaching purposes.&quot; Australasian Journal of Philosophy\n\n","torrent":{"xt":"urn:btih:d93b26cc770ae3b3e113ba0ef5d7c875fdb7fb92","amp;dn":"David+Lewis%3A+Convention.+A+Philosophical+Study","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d93b26cc770ae3b3e113ba0ef5d7c875fdb7fb92","infoHashBuffer":{"type":"Buffer","data":[217,59,38,204,119,10,227,179,225,19,186,14,245,215,200,117,253,183,251,146]},"announce":[],"urlList":[]}}