{"title":"Brian Setzer albums","uid":4880396,"size":1952025561,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d97728d1b47da2cc47278aa5f8b66de682c73d65&amp;dn=Brian+Setzer+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1241361798,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nBrian Setzer (born April 10, 1959, Massapequa, New York) is an American guitarist, singer and songwriter.\nBeginning in January 1980, Setzer fronted the popular rockabilly band, Stray Cats. After performing from New York to Philadelphia, Setzer, Lee Rocker (born Leon Drucker) and Slim Jim Phantom (born James McDonnell) decided in June 1980 to go to London where they believed people would better appreciate their sound and style. Upon arrival, they decided to call themselves &quot;Stray Cats&quot;, a name suggested by Rocker. The Stray Cats drew the attention of producer Dave Edmunds and released a series of successful singles in the UK.\nThe Stray Cats caught America's attention with the 1982 album Built for Speed, which included the two Top Ten hits, &quot;Rock This Town&quot; (#9) and &quot;Stray Cat Strut&quot; (#3), as well as with the follow-up 1983 album Rant 'N Rave with the Stray Cats, which included the two successful singles &quot;(She's) Sexy + 17&quot; (#5), and &quot;I Won't Stand In Your Way&quot; (#35).\nThe Stray Cats broke up in 1984, but would reunite briefly to record albums and mount tours several times through the early 1990s.\nIn 1986, Setzer released his first solo album, The Knife Feels Like Justice, which marked a move away from rockabilly and towards a more mainstream rock sound. The album found minor success, peaking at number 45 on the US album charts. Also in the mid-80s, Setzer was the lead guitarist for the touring version of Robert Plant's ensemble band, The Honeydrippers. In 1987, Setzer played the part of Eddie Cochran in the biographical film on the life of Ritchie Valens, La Bamba.\nSetzer led a comeback for swing and jump blues music in the mid-1990s when he formed The Brian Setzer Orchestra, an ambitious 17-piece ensemble project, which released four studio albums, a Christmas disc and several live releases between 1994 and 2002. The group's biggest success (and Setzer's outside the Stray Cats) came in 1998 with the release of The Dirty Boogie which cracked the top ten on the US album charts and featured a hit single, a cover of Louis Prima's &quot;Jump, Jive an' Wail&quot;.\nSetzer continued to release solo-billed albums sporadically, including a solo live disc Rockin' By Myself in 1998 and Nitro Burnin' Funny Daddy in 2003. In 2001 he released an album titled Ignition with his a new trio billed as the '68 Comeback Special. A tribute album titled Rockabilly Riot Vol. 1: A Tribute To Sun Records was released on July 26, 2005, in the United States. His latest Record, 13, was released in October 2006.\nOn September 25 2007, the Brian Setzer Orchestra released Wolfgang's Big Night Out which features Setzer's take on classical pieces, such as Beethoven's Symphony No. 5, Flight of the Bumblebee, and FÃƒÂ¼r Elise. &quot;Wolfgang&quot; earned Setzer his 8th Grammy nomination, this time for Best Classical Crossover album of the year.\nSetzer spoofed himself in a 2002 episode of popular animated series The Simpsons. He voiced himself as a &quot;tutor&quot; at a fictional Rock 'n Roll Fantasy Camp attended by Homer Simpson, and delivered the amusing line (after his animated version participated in chasing Homer in a motorized devil's head): &quot;I hope you won't judge the entire Brian Setzer orchestra based on my actions.&quot;\nSetzer is a major influence on frontman Chris Cheney of The Living End, a famous rockabilly-punk band from Australia.\n\n","torrent":{"xt":"urn:btih:d97728d1b47da2cc47278aa5f8b66de682c73d65","amp;dn":"Brian+Setzer+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d97728d1b47da2cc47278aa5f8b66de682c73d65","infoHashBuffer":{"type":"Buffer","data":[217,119,40,209,180,125,162,204,71,39,138,165,248,182,109,230,130,199,61,101]},"announce":[],"urlList":[]}}