{"title":"Avenged Sevenfold - Bat Country","uid":4704780,"size":142497796,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d996a39358eb3309ba071d7f735def2e6bcd9106&amp;dn=Avenged+Sevenfold+-+Bat+Country&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1233827498,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Bat Country&quot; is a single by the American metal band Avenged Sevenfold from their 2005 album, City of Evil. The song's main influence comes from Hunter S. Thompson's 1971 novel Fear and Loathing in Las Vegas, and the title itself also comes from a line from the book in which Raoul Duke, the alter-ego pseudonym of Thompson himself, is on his way to Las Vegas while being affected by various drugs, and thus hallucinates, seeing huge bats and manta rays in the sky. With this, he screams to his companion, Dr. Gonzo, &quot;We can't stop here. This is bat country.&quot;\n\nThe song has been used in several video games including EA Sports' NHL 06, Madden NFL 06, SSX on Tour and Saints Row 2. It also had a short cameo in Big Momma's House 2. The song is featured on the soundtrack to the extreme mountain bike film New World Disorder 7: Flying High Again.\n\nThe song appeared on an episode of the FOX TV series Bones entitled &quot;The Superhero in the Alley&quot;\n\nAvenged Sevenfold won 'Best New Artist' at the 2006 MTV Video Music Awards for &quot;Bat Country&quot;.\n\nThe following quote is frequently referred twice throughout the song(at the beginning and the bridge before the last chorus) and is shown at the beginning of the music video.\n\n&quot;He who makes a beast out of himself, gets rid of the pain of being a man.&quot; - Dr. Johnson\n\nThe video for this song shows various symbolic images and references to the above-mentioned Thompson book. The song centers around the band performing in a hotel room, surrounded by exotic dancers. There are also cuts to a scene in which the band is driving down a barren highway in a bat-winged Cadillac convertible, surrounded by a cloud of bats (who are being swatted by Zacky and The Rev). During the &quot;soft&quot; section, the band appears at a strip club, surrounded by snake-tongued strippers. Also, it's implied that the video is partially a hallucinaton.\n\nIf one were to examine closely, the words on M. Shadows' shirt appear to change between &quot;Why Disneyland&quot; and &quot;If you have Amsterdam&quot;. The shirt actually says &quot;Why Disneyland if you have Amsterdam?&quot; at one point in the song. It changes back afterward. During Synyster Gates' and Zacky Vengeance's guitar solo/duo, the bats that fly into the sky are sometimes not there. The regular people sometimes appear to have a disfigured face. During the video's commentary by Avenged Sevenfold on their All Excess DVD, the band says that the bats hallucination was actually due to a lack of funds, however, whether or not they were being serious or joking is not clarified.\n\nThe music video, which was filmed around Las Vegas, still receives considerable airplay on many channels. As Shadows says, the band members live close to Las Vegas. Synyster Gates commented at 2:47, 'You put all of us in the car, and that's basically what you have.'\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d996a39358eb3309ba071d7f735def2e6bcd9106","amp;dn":"Avenged+Sevenfold+-+Bat+Country","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d996a39358eb3309ba071d7f735def2e6bcd9106","infoHashBuffer":{"type":"Buffer","data":[217,150,163,147,88,235,51,9,186,7,29,127,115,93,239,46,107,205,145,6]},"announce":[],"urlList":[]}}