{"title":"Janet Jackson - Discipline - (2008)[FLAC-EAC-CUE]","uid":4925454,"size":394703628,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da336b6c8686387f3ed0e03e9bc174892dc3aef4&amp;dn=Janet+Jackson+-+Discipline+-+%282008%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seanprince","files":31,"time":1243826121,"description":"Janet Jackson - Discipline - (2008)[FLAC-EAC-CUE]\n\n\n\nTrack list\n\nJanet Jackson - Discipline\n\n01. I.D. 00:47\n02. Feedback 03:38\n03. Luv 03:09\n04. Spinnin 00:07\n05. Rollercoaster 03:50\n06. Bathroom Break 00:40\n07. Rock With U 03:51\n08. 2nite 04:08\n09. Can't B Good 04:13\n10. 4 Words 00:10\n11. Never Letchu Go 04:07\n12. Truth Or Dare 00:23\n13. Greatest X 04:22\n14. Good Morning Janet 00:43\n15. So Much Betta 02:52\n16. Play Selection 00:17\n17. The 1 03:40\n18. What's Ur Name 02:33\n19. The Meaning 01:16\n20. Discipline 05:00\n21. Back 00:18\n22. Curtains 03:50\n\nBiography by Steve Huey\n\nFew celebrity siblings can emerge from the shadows of their already famous relations to become superstars in their own right and with their own distinct personalities. That's exactly what Janet Jackson did in becoming one of the biggest female pop and R&amp;B stars of the '80s and '90s. Since her breakthrough in 1986 with the album Control, Jackson's career as a hitmaker has been a model of consistency, rivaling Madonna and Whitney Houston in terms of pop chart success over the long haul. A big part of the reason was that Jackson kept her level of quality control very high; her singles were always expertly crafted, with indelible pop hooks and state-of-the-art production that kept up with contemporary trends in urban R&amp;B. Once established, her broad-based appeal never really dipped all that much; she was able to avoid significant career missteps, musical and otherwise, and successfully shifted her image from a strong, independent young woman to a sexy, mature adult. With a string of multi-platinum albums under her belt, she showed no signs of slowing down in the new millennium.\nJanet Damita Jo Jackson was born May 16, 1966, in Gary, IN. She was the youngest of nine children in the Jackson family, and her older brothers had already begun performing together as the Jackson 5 by the time she was born. Bitten by the performing bug at a young age, she first appeared on-stage with the Jackson 5 at age seven, and began a sitcom acting career at the age of ten in 1977, when producer Norman Lear selected her to join the cast of Good Times. She remained there until 1979, and subsequently appeared on Diff'rent Strokes (1981-1982) and A New Kind of Family. In 1982, pushed by her father into trying a singing career, Jackson released her self-titled first album on A&amp;M; a couple of singles scraped the lower reaches of the charts, but on the whole, it made very little noise. She was cast in the musical series Fame in 1983; the following year, she issued her second album, Dream Street, which sold even more poorly than its predecessor. Upon turning 18, Jackson rebelled against her parents' close supervision, eloping with a member of another musical family, singer James DeBarge. However, the relationship quickly hit the rocks and Jackson wound up moving back into her parents' home and having the marriage annulled.\nJackson took some time to rethink her musical career, and her father hired her a new manager, John McClain, who isolated his young charge to train her as a dancer (and make her lose weight). McClain hooked Jackson up with producers/writers Jimmy Jam and Terry Lewis, whom she'd seen perform as members of the Minneapolis funk outfit the Time. Jackson collaborated with Jam and Lewis on most of the tracks for her next album, Control, which presented her as a confident, tough-minded young woman (with a soft side and a sense of humor) taking charge of her life for the first time. In support of Jackson's new persona, Jam and Lewis crafted a set of polished, computerized backing tracks with slamming beats that owed more to hard, hip-hop-tinged funk and urban R&amp;B than Janet's older brother Michael's music. Control became an out-of-the-box hit, and eventually spun off six singles, the first five of which -- &quot;What Have You Done for Me Lately,&quot; the catch phrase-inspiring &quot;Nasty,&quot; the number one &quot;When I Think of You,&quot; the title track, and the ballad &quot;Let's Wait Awhile&quot; -- hit the Top Five on the pop charts. Jackson was hailed as a role model for young women and Control eventually sold over five million copies, establishing Jackson as not just a star, but her own woman. It also made Jam and Lewis a monstrously in-demand production team.\nFor the hotly anticipated follow-up, McClain wanted to push Jackson toward more overtly sexual territory, to which she objected strenuously. Instead, she began collaborating with Jam and Lewis on more socially conscious material, which formed the backbone of 1989's Rhythm Nation 1814 (the &quot;1814&quot; purportedly stood for either the letters &quot;R&quot; and &quot;N&quot; or the year &quot;The Star-Spangled Banner&quot; was written). Actually, save for the title track, most of the record's singles were bright and romantically themed; four of them -- &quot;Miss You Much,&quot; &quot;Escapade,&quot; &quot;Black Cat,&quot; and &quot;Love Will Never Do (Without You)&quot; -- hit number one, and three more -- &quot;Rhythm Nation,&quot; &quot;Alright,&quot; and &quot;Come Back to Me&quot; -- reached the Top Five, making Jackson the first artist ever to produce seven Top Five hits off of one album (something not even her brother Michael had accomplished). Aside from a greater use of outside samples, Rhythm Nation's sound largely resembled that of Control, but was just as well crafted, and listeners embraced it enthusiastically, buying over six million copies. Jackson undertook her first real tour (she'd appeared at high schools around the country in 1982) in support of the album and it was predictably a smashing success. In 1991, Jackson capitalized on her success by jumping from A&amp;M to Virgin for a reported $32 million, and also secretly married choreographer and longtime boyfriend RenÃƒÂ© Elizondo.\nOnce on Virgin, Jackson set about revamping her sound and image. Her 1992 duet with Luther Vandross from the Mo' Money soundtrack, &quot;The Best Things in Life Are Free,&quot; was a major R&amp;B hit, also reaching the pop Top Ten. The following year, she also resumed her acting career, co-starring in acclaimed director (and former junior high classmate) John Singleton's Poetic Justice, along with rapper Tupac Shakur. But neither really hinted at the sexy, seductive, fully adult persona she unveiled with 1993's janet., her Virgin debut. Jackson trumpeted her new image with a notorious Rolling Stone cover photo, in which her topless form was covered by a pair of hands belonging to an unseen &quot;friend.&quot; Musically, Jam and Lewis set aside the synthesized funk of their first two albums with Jackson in favor of warm, inviting, gently undulating grooves. The album's lead single, the slinky &quot;That's the Way Love Goes,&quot; became Jackson's biggest hit ever, spending eight weeks at number one. It was followed by a predictably long parade of Top Ten hits -- &quot;If,&quot; the number one ballad &quot;Again,&quot; &quot;Because of You,&quot; &quot;Any Time, Any Place,&quot; &quot;You Want This.&quot; janet.'s debut showing at number one made it her third straight chart-topping album, and it went on to sell nearly seven million copies.\nIn 1995, Janet and Michael teamed up for the single &quot;Scream,&quot; which was supported by an elaborate, award-winning, space-age video that, upon completion, ranked as the most expensive music video ever made. The single debuted at number five on the pop charts, but gradually slid down from there. In 1996, A&amp;M issued a retrospective of her years at the label, Design of a Decade 1986-1996; it featured the Virgin hit &quot;That's the Way Love Goes&quot; and a few new tracks, one of which, &quot;Runaway,&quot; became a Top Five hit. Jackson also signed a new contract with Virgin for a reported $80 million. Yet while working on her next album, Jackson reportedly suffered an emotional breakdown, or at least a severe bout with depression; she later raised eyebrows when she talked in several interviews about the cleansing value of coffee enemas as part of her treatment. Her next album, The Velvet Rope, appeared in 1997 and was touted as her most personal and intimate work to date. The Velvet Rope sought to combine the sensuality of janet. with the more socially conscious parts of Rhythm Nation, mixing songs about issues like domestic abuse, AIDS, and homophobia with her most sexually explicit songs ever. Critical opinion on the album was divided; some applauded her ambition, while others found the record too bloated. The lead American single &quot;Together Again,&quot; an elegy for AIDS victims, was a number one hit; also popular on the radio was &quot;Got 'til It's Gone,&quot; which featured rapper Q-Tip and a sample of Joni Mitchell over a reggae beat. &quot;I Get Lonely,&quot; featuring Blackstreet, was another big hit; but on the whole, The Velvet Rope didn't prove to be the blockbuster singles bonanza that its predecessors were, which was probably why its sales stalled at around three million copies.\nJackson toured the world again, and stayed on the charts in 1999 with the Top Five Busta Rhymes duet &quot;What's It Gonna Be?!&quot;; her appearance in the video remade her as a glitzy, artificially costumed, single-name diva. In 2000, she appeared in the Eddie Murphy comedy Nutty Professor II: The Klumps, and her soundtrack contribution, &quot;Doesn't Really Matter,&quot; became a number one single. Unfortunately, Jackson's marriage to Elizondo had become strained and the couple divorced in 2000, sparking a court battle over her musical income. Jackson returned with a new album, All for You, in 2001, which largely continued the sensual tone of janet. and The Velvet Rope; it debuted at number one, selling over 600,000 copies in its first week alone. The title track was issued as the album's first single and quickly topped the charts, followed by another sizable hit in &quot;Someone to Call My Lover.&quot;\nWhile Jackson spent much of 2001 and 2002 on the road supporting All for You, she also found time for some guest appearances, most notably with Beenie Man on his Tropical Storm LP and Justin Timberlake on Justified. By 2003 she was back in the studio, working once again with Jam and Lewis on tracks for a new album; additional producers included Dallas Austin and Kanye West. Later that year, it was revealed Jackson would take part in an MTV-produced extravaganza during halftime at the Super Bowl. 2004 began with an Internet leak of the upbeat Austin production &quot;Just a Little While.&quot; The singer's camp rolled with the punches, offering the track to radio as an authorized digital download, but the buzz this business caused was minuscule in comparison to the nightmare union of free exposure and bad publicity that Jackson's next adventure caused. Appearing at halftime of Super Bowl XXXVIII as scheduled, Jackson performed &quot;All for You&quot; and &quot;Rhythm Nation&quot; before bringing out surprise guest Timberlake for a duet on his hit &quot;Rock Your Body.&quot; But the real surprise came at song's end, when a gesture from Timberlake caused Jackson's costume to tear, exposing her right, pierced breast on live television to hundreds of millions of viewers.\nThe incident caused furious backpedaling and apologizing from Timberlake, Jackson, the NFL, CBS, and MTV, which swore no previous knowledge of the so-called &quot;wardrobe malfunction,&quot; and led to speculation over how Damita Jo -- Jackson's upcoming album and her first in three years -- would be received. But while the controversy gave Jackson both grief and a bit of free advertising, it was also the impetus for a national debate on public indecency. A federal commission was set up to investigate prurience, the FCC enacted tougher crackdowns on TV and radio programs broadcasting questionable content, and suddenly everyone from pundits to politicians to the man in the street had an opinion on Janet Jackson's chest. Later that March, the singer quietly started making the talk show rounds. She was still apologizing for the incident, but she was also promoting Damita Jo, which Virgin issued at the end of the month. Largely considered a disappointment, the album nonetheless sold over two million copies worldwide and earned three Grammy nominations. 20 Y.O. followed two years later, and though it was reviewed more favorably than Damita Jo, it was off the Billboard 200 album chart after 15 weeks. Jermaine Dupri, Jackson's love interest and the executive producer of the album, was so upset over Virgin's lack of support that he left his post as president of Virgin's urban division. Dupri moved to Island, and so did Jackson; in 2008, Jackson released her tenth studio album, Discipline.\n\nReview by Andy Kellman\n\nA few lines from a couple songs and some suggestive presentation guarantees that a significant amount of the reaction to Discipline, Janet's tenth studio album, will feast upon the singer's lack of judiciousness when it comes to expressing her sexuality. Leave the teasing and explicitness to the teens and younger twenty-somethings -- not the grown women -- right? Janet should get back to making sunny, uncomplicated songs like &quot;Escapade&quot; and pretend that the occasional-to-frequent salaciousness extending back to Control never existed. She should do that and, while she is at it, act her age. (When the three years younger R. Kelly releases his next album, no protests of a similar nature will be heard; ditto whenever the Rolling Stones perform &quot;Brown Sugar.&quot;) While Discipline is dressed up like a racy affair with track-to-track titillation, it has only a couple moments where Janet takes the S&amp;M imagery further, and more deeply personal, than she did on The Velvet Rope; the majority of its subject matter relates to the more common elements of relationships. The likes of &quot;Never Letchu Go&quot; (a sweet, glistening ballad), &quot;Luv&quot; (carrying a brisk, feel-good clap-and-bounce), &quot;Rollercoaster&quot; (suitably jittery and giddy), and &quot;Can't B Good&quot; (practically a descendent of her brother Michael's &quot;Can't Help It,&quot; with that gentle and affecting self-examination that only a Jackson can do so well) are as innocent, universal, and inviting as anything else in Janet's past. There are two irresistible, grade-A dancefloor tracks as well: the swift, swooning &quot;Rock with U&quot; (that is the correct title) and the more aggressive (as in &quot;let's throw down&quot;) &quot;2Nite.&quot; The absence of Jimmy Jam and Terry Lewis is not felt, not with Ne-Yo, the-Dream, Tricky Stewart, and Stargate stepping up to contribute with established Janet collaborators Johnta Austin, Rodney Jerkins, and of course Jermaine Dupri (who brought Janet with him to Island from Virgin). Janet probably won't hit that late-'80s peak again, but that is no excuse to write her off.","torrent":{"xt":"urn:btih:da336b6c8686387f3ed0e03e9bc174892dc3aef4","amp;dn":"Janet+Jackson+-+Discipline+-+%282008%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da336b6c8686387f3ed0e03e9bc174892dc3aef4","infoHashBuffer":{"type":"Buffer","data":[218,51,107,108,134,134,56,127,62,208,224,62,155,193,116,137,45,195,174,244]},"announce":[],"urlList":[]}}