{"title":"China Salvaje.(1 de 6).Corrientes de cambio [DVBRip].","uid":4512269,"size":556156928,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e04c4e35ddb00cb08f4352374e194488200868c0&amp;dn=China+Salvaje.%281+de+6%29.Corrientes+de+cambio+%5BDVBRip%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cholo24","files":1,"time":1226833343,"description":"China Salvaje\n\nEmocionante recorrido -filmado en alta definiciÃƒÂ³n y con la tecnologÃƒÂ­a mÃƒÂ¡s avanzada- que ofrece imÃƒÂ¡genes nunca vistas de una tierra de asombrosa complejidad natural, que combina fabulosos paisajes, una increÃƒÂ­ble vida salvaje y una gran diversidad ÃƒÂ©tnica. En sus seis episodios, esta serie documental de la BBC viaja por todo el paÃƒÂ­s -desde el Himalaya hasta las estepas, de la zona subÃƒÂ¡rtica a las islas tropicales- para mostrar uno de las civilizaciones mÃƒÂ¡s antiguas de la tierra y un mundo natural sorprendente.\n\nAsÃƒÂ­, la serie visita las cimas del Himalaya -la cordillera mÃƒÂ¡s alta del mundo-, las mesetas del TÃƒÂ­bet, las junglas tropicales -de una biodiversidad tal que muchas especies estÃƒÂ¡n siendo descubiertas todavÃƒÂ­a ahora-, los desiertos y los bosques donde rododendros y camelias prosperan en su hÃƒÂ¡bitat natural. En ellos podremos descubrir al oso panda gigante, al tigre, a la mantis religiosa o a la grulla de cuello negro, pero tambiÃƒÂ©n otras imÃƒÂ¡genes espectaculares, como las gotas de lluvia salpicando las plumas de un faisÃƒÂ¡n dorado, el nacimiento de una flor a travÃƒÂ©s de la nieve, el rugido de una cascada al chocar contra los desfiladeros de piedra caliza o el espectÃƒÂ¡culo de las luces de los pescadores cuando sus barcas se balancean en el mar nocturno.\n","torrent":{"xt":"urn:btih:e04c4e35ddb00cb08f4352374e194488200868c0","amp;dn":"China+Salvaje.%281+de+6%29.Corrientes+de+cambio+%5BDVBRip%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e04c4e35ddb00cb08f4352374e194488200868c0","infoHashBuffer":{"type":"Buffer","data":[224,76,78,53,221,176,12,176,143,67,82,55,78,25,68,136,32,8,104,192]},"announce":[],"urlList":[]}}