{"title":"New York-Ancient Long Island Epitaphs","uid":8498442,"size":8053884,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1f78ab0bedb53149d902ad0c28306bc181c82f9&amp;dn=New+York-Ancient+Long+Island+Epitaphs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1369203261,"description":"Ancient Long Island Epitaphs\nfrom the Towns of Southold, Shelter Island, and Easthampton, New York\n\nEdward Doubleday Harris \n\n\n\nPDF:106 pages\n\n\nOver the period 1877-1890, Mr. Harris visited all public and church cemeteries, as well as some private or family burial grounds, in the above-named towns of easternmost Long Island, New York that had been in use prior to 1800. For this publication, most of which originally appeared in The New England Historical and Genealogical Register before being reprinted, with additions, in 1900, he transcribed the inscriptions found on the tombstones situated in those burial grounds. The vast majority of the roughly 1,000 inscriptions refer to individuals of English birth or descent, many of whom had emigrated to Long Island from New England. The epitaphs alone ordinarily give the deceased's full name, date of death, and age of death. Many of them also indicate the name(s) and relationships of surviving family members. Because the transcriber was a genealogist, he also compiled genealogical notes which shed light on many of the individuals who are represented in the book, and their families. At the back of the volume, the researcher will find a full-name index to the burials and a separate index to all other persons named in the inscriptions--as many as 2,500. Following is a town-by-town list of the burial grounds covered by Mr. Harris: Southold--Southold Village, East Marion, Old Orient, Orient Village, King Family, Southold Estates, and Hashamock; Shelter Island--Sylvester Manor Epitaphs; and Easthampton--Amagansett, Easthampton Village, North Ground, Early Easthampton, and Wainscott.","torrent":{"xt":"urn:btih:e1f78ab0bedb53149d902ad0c28306bc181c82f9","amp;dn":"New+York-Ancient+Long+Island+Epitaphs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1f78ab0bedb53149d902ad0c28306bc181c82f9","infoHashBuffer":{"type":"Buffer","data":[225,247,138,176,190,219,83,20,157,144,42,208,194,131,6,188,24,28,130,249]},"announce":[],"urlList":[]}}