{"title":"Opposition - Promises - TQMP","uid":4956939,"size":377502616,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e2b0724ca707063970d58264a5e46af4f30c0ac4&amp;dn=Opposition+-+Promises+-+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mio959mao","files":19,"time":1245157301,"description":"The Opposition are a long running post-punk band from London, England that featured Ralph Hall, Marcus Bell and Mark Long, and mixed New Wave sounds with Reggae rhythms.\n\nFounded in 1979, The Opposition released their first single on the independent record label Double Vision records. This was called &quot;Very Little Glory&quot; which the NME (New Musical Express) reviewed and said that it was &quot;a song recorded before its time&quot;.\n\nWith the press picking up on the band, they switched from indie to major and secured a contract with the Ariola Record label in Europe. A single called &quot;This Year &quot; came out by Ariola, followed by the self produced &quot;Breaking The Silence&quot; album, and a French tour.\n\nIn 1984 the band signs to Virgin Records offshoot Charisma Records and released firstly &quot;Intimacy&quot; in 1983. The &quot; Promises&quot; album was released a year later, and another album called &quot;Empire Days&quot; the following year. On these releases the band worked with Producer Kenny Jones.\n\nAfter a hiatus, when band members Marcus Bell and Mark Long recorded a more commercial sounding album under the name SO, the band regrouped and released the album &quot;Blue Alice Blue&quot;, again recorded with Producer Kenny Jones. Also, a number of re-issues get the deluxe treatment with extra tracks on Virgin Records.\n\nRecorded at Focus Studios London 1984, Produced by Kenny Jones &amp; Opposition,engineered by Kenny Jones,\nthe Promises CD was released in 1990 (CDOVD 281 Virgin) with bonustracks the 5 first tracks from the Intimacy album.\n\nFLAC and full covers\nenjoy","torrent":{"xt":"urn:btih:e2b0724ca707063970d58264a5e46af4f30c0ac4","amp;dn":"Opposition+-+Promises+-+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b0724ca707063970d58264a5e46af4f30c0ac4","infoHashBuffer":{"type":"Buffer","data":[226,176,114,76,167,7,6,57,112,213,130,100,165,228,106,244,243,12,10,196]},"announce":[],"urlList":[]}}