{"title":"Corbin Fisher - - - Damon Fucks Dirk ((MictrmbL))","uid":4960009,"size":272239785,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:e3144908bec2c05e5d391c7850c3f93e50dcd5e0&amp;dn=Corbin+Fisher+-+-+-+Damon+Fucks+Dirk+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mictrmbl","files":2,"time":1245266304,"description":"From the vaults of Corbin Fisher:\n\n\nThe last time we saw Dirk, he was part of the fantastic foursome in the Straight Stud Fuck Fest where Dirk, Logan, Lucas and Cody spent some time discovering just how much fun a bunch of uninhibited straight studs can have with one another and reminding me of why it is I love my job so much!\n\nWhen I realized it had been way too long since we'd had Dirk here for a shoot, I instantly picked up my phone, gave him a call, and told him I wanted him back out here ASAP... without even knowing who I was going to team him up with yet!\n\nAs fate would have it, Damon was already on his way to town to get his first taste of guy-on-guy fun. I figured it'd be perfect to have a hot gay guy break Damon in, and then unleash a fellow straight stud upon him to see what kind of trouble they could stir up together!\n\nWell, talk about your stars aligning just right! With Dirk already set to come to town and Damon needing to continue his education, I arranged the pairing right away and got these two straight studs together!\n\nFor you many Dirk-lovers out there, I know you'll get a kick out of seeing this bad-ass frat boy get his very first facial! He doesn't quite take to it as eagerly as Logan has, but I'm sure we'll do something about that down the line! ;)","torrent":{"xt":"urn:btih:e3144908bec2c05e5d391c7850c3f93e50dcd5e0","amp;dn":"Corbin+Fisher+-+-+-+Damon+Fucks+Dirk+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3144908bec2c05e5d391c7850c3f93e50dcd5e0","infoHashBuffer":{"type":"Buffer","data":[227,20,73,8,190,194,192,94,93,57,28,120,80,195,249,62,80,220,213,224]},"announce":[],"urlList":[]}}