{"title":"Manson Family - The Leslie Van Houten Files","uid":4474126,"size":23593100,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e8ba6aa52e3164b7f95db1a18ef170c0103b908c&amp;dn=Manson+Family+-+The+Leslie+Van+Houten+Files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZuZusMan","files":2,"time":1225273523,"description":"+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|*********************************************************************************|\n+*********************************************************************************+ \n|*************************** Rare Manson Family Material *************************|\n+*********************************************************************************+\n|*********************************************************************************|  \n+*********************************************************************************+\n|                                                                                 |\n+                            Leslie Van Houten Files                              +\n|                                                                                 |\n+*********************************************************************************+\n|                                                                                 |\n+                                                                                 +\n| News clippings and documents from my own collection. May be updated in the      |\n+ future as I'm still researching and collecting data. This WinRAR zip package    +\n| contains the following files:                                                   |\n+                                                                                 +\n|                                                                                 |\n+   Legal Documents Folder:                                                       +\n|                                                                                 |\n+ * Response Habeas Corpus (March 1, 2004) (PDF Document)                         +\n| * Response Habeas Corpus (March 30, 2004) (PDF Document)                        |\n+ * News article on Judge Krug ruling (2002) - source and date unknown            +\n| * Supreme Court response Habeas Corpus (June 23, 2004) (PDF Document)           |\n+ * Supreme Court response Habeas Corpus (March 30, 2005) (PDF Document)          +\n|                                                                                 |\n+   Re-trial 1977 Folder:                                                         +\n|                                                                                 |\n+ * $200,000 bail set for Manson follower - Valley News (Dec. 28, 1976)           +\n| * Changes in Van Houten described - The Duartean (May 19, 1977)                 |\n+ * Follower saw Manson as Christ - The Daily Review (May 26, 1977)               +\n| * Defense rests in Van Houten re-trial on murder charges (June 16, 1977)        |\n+ * Doctor says drugs sank Van Houten - Press-Telegram (May 20, 1977)             +\n| * Van Houten could have deceived psychiatrists, a specialist testifies (1977)   |\n+ * Van Houten said to be 'shark-like' - Valley News (June 2, 1977)               +\n| * Van Houten not mentally ill for murders - witness - Valley News (June 1977)   |\n+ * Van Houten Described As Mentally Ill - Charleston Daily Mail (June 1, 1977)   +\n| * Eight jurors excused at Van Houten trial - The Daily Review (March 30, 1977)  |\n+ * First-degree murder asked by deputy DA in Van Houten Trial - Valley News      +\n| * Leslie broken free of Manson - mother  - Star-News (May 19, 1977)             |\n+ * Van Houten felt malice in murders - Valley News (June 22, 1977)               +\n| * Jury hears Van Houten confession - Star-News (May 13, 1977)                   |\n+ * Jury gets grisly Van Houten confession - Press-Telegram (May 13, 1977)        +\n| * Leslie Stabbed Corpse - Witness  - Valley News (April 26, 1977)               |\n+ * Leslie called 'sick' in attorney's final pleas - Press-Telegram (July 1977)   +\n| * Leslie 'innocent robot?' - Press-Telegram (April 19, 1977)                    |\n+ * Leslie jury asks for more tape - Press-Telegram (July 15, 1977)               +\n| * Leslie legal eagle flies at Manson - Star-News (April 19, 1977)               |\n+ * Leslie relies on new image - Press-Telegram (July 5, 1977)                    +\n| * Leslie Van Houten testifies that she lied during first trial (May 6, 1977)    |\n+ * Leslie again denies killing - Press-Telegram (June 16, 1977)                  +\n| * Manson 'Christ-like,' Van Houten tells jury - Source unknown (1977)           |\n+ * Van Houten testifies in murder retrial - The Herald (May 13, 1977)            +\n| * Manson: Leslie Wasn't a 'Robot' - The San Mateo Times (June 28, 1977)         |\n+ * Leslie's high-school lover tells of LSD use, abortion (June 17, 1977)         +\n| * Leslie Van Houten loses bid to move retrial site - Temple City Times (1977)   |\n+ * Manson Follower Fails In Appeal for Release - Amarillo Globe-Times (1976)     +\n| * Manson girl changed by life in prison - Press-Telegram (Jan. 2, 1977)         |\n+ * Manson 'father figure' to Van Houten, doctors say - Monrovia News-Post (1977) +\n| * Manson follower to get new trial - Source unknown (1976)                      |\n+ * Jury hears Manson tape: 'I never forced anybody' - Press-Telegram (June 1977) +\n| * Mansonite Enters Not-Guilty Plea - The Galveston Daily News (Dec. 26, 1976)   |\n+ * On LSD at trial, claims Van Houten - Press-Telegram (May 6, 1977)             +\n| * Stabbing 'necessary,' Leslie tells jury - Press-Telegram (June 14, 1977)      |\n+ * Sub juror to delay verdict on Van Houten - Valley News (July 26, 1977)        +\n| * Van Houten admits deed was 'horrible' - Press-Telegram (February 18, 1977)    |\n+ * Van Houten awaits next move - Syracuse Herald-Journal (August 8, 1977)        +\n| * Van Houten boyfriend testifies - (June 17, 1977)                              |\n+ * Van Houten case mistrial declared - Star-News (August 7, 1977)                +\n| * Van Houten change described - The Argus (June 17, 1977)                       |\n+ * Van Houten defense hit by prosecutor - Star-News (July 6, 1977)               +\n| * Leslie Van Houten details sex, drug cult life - Star-News (Feb. 14, 1977)     |\n+ * Van Houten friend tells about 'trips' - Monrovia News-Post (June 19, 1977)    +\n| * Van Houten 'fun' knifing claim bared - Star-News (April 29, 1977)             |\n+ * Van Houten judge declares a mistrial - Chronicle-Telegram (August 7, 1977)    +\n| * Van Houten jury mulls issue of mental state: no verdict (July 23, 1977)       |\n+ * Van Houten Jury Seating Goes On - The San Mateo Times (March 29, 1977)        +\n| * Van Houten quiet as death scene described - Press-Telegram (April 28, 1977)   |\n+ * Van Houten still as grisly murders recalled in court (April 26, 1977)         +\n| * Van Houten retrial delayed - The Times-Standard (January 29, 1977)            |\n+ * Van Houten says she took LSD [during first trial] - Star-News (May 6, 1977)   +\n| * Leslie Van Houten to be tried again for murder - Press-Telegram (Sept. 1977)  |\n+ * Van Houten trial jury resumes deliberations - The Times-Standard (Aug. 1977)  +\n| * Van Houten Trial Prosecution Ends - The San Mateo Times (July 6, 1977)        |\n+ * Venue change denied to Leslie Van Houten (January 21, 1977)                   +\n| * Van Houten testifies (June 16, 1977) (PDF Document)                           |\n+                                                                                 +\n|                                                                                 |\n+   Re-trial 1978 Folder:                                                         +\n|                                                                                 |\n+ * Disciple of Manson Declared Guilty - The Post-Standard (July 6, 1978)         +\n| * Kasabian recalls murders - Press-Telegram (April 11, 1978)                    | \n+ * Leslie Van Houten will face a third trial - The Modesto Bee (Sept. 2, 1977)   +\n| * Manson follower freed - The Sun (December 28, 1977)                           |\n+ * Manson murderess sent back to prison - Syracuse Herald-Journal (July 6, 1978) +\n| * Van Houten's new bail bid fails - Valley News (December 17, 1977)             |\n+ * 'Thank You' ends Leslie's testimony - Press-Telegram (June 1, 1978)           +\n| * Third Trial Ahead For Van Houten? - Oakland Tribune (August 8, 1977)          |\n+ * Van Houten convicted again for 1969 murders - The Sun (July 6, 1978)          +\n| * Van Houten sentenced to life term for murders - The News (Aug. 12, 1978)      |\n+ * Van Houten to appear for new trial date - The Argus (September 21, 1977)      +\n|                                                                                 |\n+   Main Folder:                                                                  +\n|                                                                                 |\n+ * Ex-Manson Family Member helps Convicts Learn to READ (PDF Document)           +\n| * Fun with CNN (Text File)                                                      |\n+ * Leslie Van Houten appeals (newspaper article from 1981) (Text File)           +\n| * Leslie Van Houten set up in 2007 parole hearing (PDF Document)                |\n+ * Leslie's drawing of jurors causes delay and hoopla (PDF Document)             +\n| * The Union Oil card (Text File)                                                |\n+ * William Cywin arrest (PDF Document)                                           +\n| * Another &quot;Manson&quot; girl may go free - The Sun (March 17, 1977)                  |\n+ * 'Bad company' hinders parole for Manson killer - Daily Herald (July 26, 1987) +\n| * Big bail bars release of Leslie Van Houten - Independent (December 28, 1976)  |\n+ * Ex-Con Wants To Marry Former Manson Family Girl - The Fresno Bee (Jan. 1977)  +\n| * For Van Houten, It's Far From Over - Syracuse Post-Standard (Dec. 25, 1980)   |\n+ * His Love Skirts Iron Bars - News Journal (May 13, 1976)                       +\n| * Girl In Tate Case Ties Her Downfall To Drugs - The Fresno Bee (Feb. 20, 1971) |\n+ * Defendant's Mother Called In Tate Case - The Times Recorder (Feb. 3, 1971)    +\n| * Leslie Van Houten rehabilitated? - Chronicle-Telegram (April 22, 1982)        |\n+ * Manson family member denied parole - Pacific Stars and Stripes (July 1986)    +\n| * No parole, but encouragement for Manson follower - The Facts (May 1988)       |\n+ * Leslie Van Houten considered different one in Manson cult (2002)              +\n| * Parole review ordered for Van Houten - The Capital (June 5, 2002)             |\n+ * Leslie Van Houten says she sometimes hates Manson - The Times (July 31, 1987) +\n| * Women claim they, not Manson, &quot;guilty&quot; - The Lowell Sun (Feb. 23, 1971)       |\n+ * All a Big Lie, Woman Yells At Attorney - Charleston Gazette (March 4, 1971)   +\n| * Manson Cult Murders Still Bring Nightmares To Leslie - The Fresno Bee (1977)  |\n+ * Tate Defendant Ejected; Mistrial Motion Denied - Florence Morning News (1970) +\n| * Manson girl tells new death role - Independent (February 23, 1971)            |\n+ * Another of 'Manson's Girls' Implicates Herself in Murder (February 23, 1971)  +\n| * Mind Blank During Killings, Girl Says - Source unknown (February 1971)        |\n+ * Leslie Van Houten's New Look - The Daily Review (December 18, 1976)           +\n| * Leslie writes Tex Watson a letter - The News (April 30, 1970)                 |\n+ * Picture from 1977 of Van Houten stepping out of a police car (black &amp; white)  +\n| * Jobies Honor Bethels During 'Hi Neighbor' Night Meeting (Nov. 26, 1964)       |\n+ * Assistant Officers of Bethel 29 Job's Daughters Receive Honor (Aug. 6, 1964)  +\n| * Manson follower denied parole - Pacific Stars and Stripes (April 26, 1982)    |\n+ * Monrovia Girl Held As Suspect - Star-News (December 11, 1969)                 +\n| * Mother says Van Houten now free of Manson spell - Press-Telegram (May 1977)   |\n+ * Board refuses to set parole date for Van Houten in Manson killings (1981)     +\n| * Polanski in court (and Van Houten retried in same building) (March 30, 1977)  |\n+ * Called by Manson Defense, Woman Refuses to Testify - The News (Nov. 11, 1971) +\n| * Reject parole bid by Manson follower - The Indiana Gazette (July 12, 1986)    |\n+ * State fights overturning of Manson girl murder verdict (Aug. 14, 1976)        +\n| * Third Girl Defendant Joins In Admitting Mass Slayings, 'Absolves' Manson ('71)|\n+ * Third Girl confesses to ghastly murders - The Daily Gleaner (Feb. 23, 1971)   +\n| * Van Houten Trials Cost Million Plus - The San Mateo Times (Aug. 19, 1977)     |\n+                                                                                 +\n|                                                                                 |\n+                                                                                 +\n|  Torrent Information:                                                           |\n+  ====================                                                           +\n|                                                                                 |\n+  File Format: RAR (WinRAR containing JPG, PDF &amp; Text files)                     +\n|  File Size  : 22.4 MB                                                           |\n+  Total number of files: 122                                                     +\n|                                                                                 |\n+                                                                                 +\n|                                                                                 |\n+                                                                                 +\n|*********************************************************************************|\n+******************** Not often offered torrent - Please seed!********************+\n|*********************************************************************************|\n+                                                                                 +\n|                                                                                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+","torrent":{"xt":"urn:btih:e8ba6aa52e3164b7f95db1a18ef170c0103b908c","amp;dn":"Manson+Family+-+The+Leslie+Van+Houten+Files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ba6aa52e3164b7f95db1a18ef170c0103b908c","infoHashBuffer":{"type":"Buffer","data":[232,186,106,165,46,49,100,183,249,93,177,161,142,241,112,192,16,59,144,140]},"announce":[],"urlList":[]}}