{"title":"The Boleyn Women (2013) Elizabeth Norton (multi)","uid":9362955,"size":6077214,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8ce3cda44b3ec7660266f1153e971588932384d&amp;dn=The+Boleyn+Women+%282013%29+Elizabeth+Norton+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"7","files":-1,"time":1387359203,"description":"The Boleyn Women: The Tudor Femmes Fatales Who Changed English History (2013) Elizabeth Norton (multi)\n\nThe Boleyn Women: The Tudor Femmes Fatales Who Changed English History by Elizabeth Norton\n\n\nFormat: mobi/epub/azw3\nLength: 304 pages\nGenre: History\nDate: 1 December 2013\n\nThe Boleyn family was the most ambitious dynasty of the sixteenth century, rising dramatically to prominence in the early years of a century that would end with a Boleyn on the throne.\n\nThe Boleyn family appeared from nowhere at the end of the fourteenth century, moving from peasant to princess in only a few generations. The women of the family brought about its advancement, beginning with the heiresses Alice Bracton Boleyn, Anne Hoo Boleyn and Margaret Butler Boleyn who brought wealth and aristocratic connections.\n\nThen there was Elizabeth Howard Boleyn, who was rumored to have been the mistress of Henry VIII, along with her daughter Mary and niece Madge, who certainly were. Anne Boleyn became the king's second wife and her aunts, Lady Boleyn and Lady Shelton, helped bring her to the block. The infamous Jane Boleyn, the last of her generation, betrayed her husband before dying on the scaffold with Queen Catherine Howard.\n\nThe next generation was no less turbulent and Catherine Carey, the daughter of Mary Boleyn fled from England to avoid persecution under Mary Tudor. Her daughter, Lettice was locked in bitter rivalry with the greatest Boleyn lady of all, Elizabeth I, winning the battle for the affections of Robert Dudley but losing her position in society as a consequence. Finally, another Catherine Carey, the Countess of Nottingham, was so close to her cousin, the queen, that Elizabeth died of grief following her death.\n\nAuthor:\n\nElizabeth Norton is a British historian specialising in the queens of England and the Tudor period. She is the author of five non-fiction works: She Wolves, The Notorious Queens of England (The History Press, 2008), Anne Boleyn, Henry VIII's Obsession (Amberley, 2008), Jane Seymour, Henry VIII's True Love (Amberley, 2009), Anne of Cleves, Henry VIII's Discarded Bride (Amberley, 2009) and Catherine Parr (Amberley, 2010).","torrent":{"xt":"urn:btih:e8ce3cda44b3ec7660266f1153e971588932384d","amp;dn":"The+Boleyn+Women+%282013%29+Elizabeth+Norton+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ce3cda44b3ec7660266f1153e971588932384d","infoHashBuffer":{"type":"Buffer","data":[232,206,60,218,68,179,236,118,96,38,111,17,83,233,113,88,137,50,56,77]},"announce":[],"urlList":[]}}