{"title":"What Would Lincoln and Darwin Think of Modern Atheism?","uid":4693516,"size":8322085,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e93dadadb6af55988d6bdd4ffba5d72fc1209a66&amp;dn=What+Would+Lincoln+and+Darwin+Think+of+Modern+Atheism%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"the_Phyrexian","files":-1,"time":1233478013,"description":"City Arts &amp; Lectures\nSan Francisco, CA\nJan 26th, 2009\n\nAdam Gopnik, author of Angels and Ages, discusses how Lincoln and Darwin differed in their approaches to atheism.\n\nHe contrasts this view with the modern atheism of Richard Dawkins, which he considers &quot;off-putting.&quot;\n\nAdam Gopnik has been a staff writer for The New Yorker since 1986. His work for that publication has earned him both the George Polk Award for Magazine Reporting as well as three National Magazine Awards for Essay and Criticism. In 1995, The New Yorker dispatched Gopnik to Paris to write the Paris Journals, in which he described daily life in that city, drawing revelations from everyday observations. A beloved collection of essays called Paris to the Moon grew from his time there, recounting his family's life in the City of Light. With help from his young son Luke, Gopnik wrote the children's novel The King in the Window, a magical adventure of a young American boy living in Paris. In his essay collections and New Yorker pieces, Gopnik's topics are imaginative and wide-ranging, from the state of New York department stores (&quot;like luxury lines becalmed in a lagoon&quot;) to science-fiction writer Philip K. Dick (&quot;the doomed genius who supplies a style of horrors and frissons&quot;) to busyness (&quot;our art form, our civic ritual&quot;). His most recent book, Through the Children's Gate, chronicles his family's relocation to New York. Gopnik also wrote and presented the BBC's Lighting Up New York, a cultural journey through the recent history of New York.\n\nBrian Gruber is Founder and Chief Executive Officer of FORA.tv.Gruber has twenty years experience successfully building and marketing media enterprises. As the senior marketing officer for a range of respected media institutions, he has managed billion dollar revenue budgets and large and small marketing teams. As the first marketing director for C-SPAN, he built its affiliate sales and marketing organization, launching C-SPAN II with the largest subscriber base ever for a cable network at launch. As director of marketing for News Corp's FOXTEL, he helped build the cable television brand in Australia, going from number three to number one in cable subscriptions, brand equity and consumer awareness. As the head of marketing of the largest urban divisions of 3 top ten cable companies (MSO's), he turned flat or negative subscriber growth into substantial gains. And as president of g/media and Principals.com, he has helped more than twenty new media companies develop brands, marketing strategies, and consumer products. He also acted as the media adviser and new media producer for the World Affairs Council of Northern California, the nation's most prolific presenter of quality world affairs events.\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tkCity&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tkCity&lt;/a&gt; Arts &amp; Lectures\nSan Francisco, CA\nJan 26th, 2009\n\nAdam Gopnik, author of Angels and Ages, discusses how Lincoln and Darwin differed in their approaches to atheism.\n\nHe contrasts this view with the modern atheism of Richard Dawkins, which he considers &quot;off-putting.&quot;","torrent":{"xt":"urn:btih:e93dadadb6af55988d6bdd4ffba5d72fc1209a66","amp;dn":"What+Would+Lincoln+and+Darwin+Think+of+Modern+Atheism%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e93dadadb6af55988d6bdd4ffba5d72fc1209a66","infoHashBuffer":{"type":"Buffer","data":[233,61,173,173,182,175,85,152,141,107,221,79,251,165,215,47,193,32,154,102]},"announce":[],"urlList":[]}}