{"title":"Arthur 'Big Boy' Crudup - Crudup's After Hours (1945-1947) [FLAC","uid":9425677,"size":148247254,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e9c05f72f1473c7017984c902e49dfb25cedf750&amp;dn=Arthur+%27Big+Boy%27+Crudup+-+Crudup%27s+After+Hours+%281945-1947%29+%5BFLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1388686135,"description":"artist/s: Arthur 'Big Boy' Crudup\nalbum: Crudup's After Hours\nlabel: Past Perfect\ncatalogue number/UPC Code: 205751-203\nformat: factory pressed silver CD\npackage: jewel case housed in a slipcase\nrecording year/s: 1945-1947\nCD release year: 2001\ncodec: reference libFLAC 1.2.1 20070917 - level 8\ntags manually filled: tracknumber - title - artist - album - year - genre\ncovers: full scans 300 dpi\nextra contents: cue non compliant, info, m3u, st5, ffp, md5.\nnote: If present non standard ascii and prohibited windows characters are deleted before ripping then restored on tags\nIf a track name is too long I short it and then I restore the full name on tags\n\n\n\n\nTrack List:\n\n01. She's Gone    [0:03:01.57]\n02. That's All Right    [0:02:54.50]\n03. So Glad You're Mine    [0:02:48.63]\n04. You Got To Reap    [0:02:58.16]\n05. I Want My Lovin'    [0:02:58.53]\n06. Chicago Blues    [0:03:14.09]\n07. I Don't Know It    [0:02:51.27]\n08. Crudup's After Hours    [0:02:57.28]\n09. Train Fare Blues    [0:02:46.51]\n10. Cry Your Blues Away    [0:03:10.74]\n11. Crudup's Vicksburg Blues    [0:03:14.30]\n12. Gonna Be Some Changes Made    [0:02:45.43]\n13. Katie May    [0:03:05.12]\n14. Hoodoo Lady Blues    [0:03:03.49]\n15. Hey, Mama Everything's All Right    [0:02:56.48]\n16. Lonesome World To Me    [0:03:13.32]\n17. Roberta Blues    [0:02:47.29]\n18. Just Like A Spider    [0:03:16.17]\n19. Some Day    [0:02:57.70]\n20. That's Why I'm Lonesome    [0:03:02.00]\n\n\n\n\n\n\nBiography by Bill Dahl (AMG)\n\nArthur Crudup may well have been Elvis Presley's favorite bluesman. The swivel-hipped rock god recorded no less than three of &quot;Big Boy's&quot; Victor classics during his seminal rockabilly heyday: &quot;That's All Right Mama&quot; (Elvis' Sun debut in 1954), &quot;So Glad You're Mine,&quot; and &quot;My Baby Left Me.&quot; Often lost in all the hubbub surrounding Presley's classic covers are Crudup's own contributions to the blues lexicon. He didn't sound much like anyone else, and that makes him an innovator, albeit a rather rudimentary guitarist (he didn't even pick up the instrument until he was 30 years old).\n\nAround 1940, Crudup migrated to Chicago from Mississippi. Times were tough at first; he was playing for spare change on the streets and living in a packing crate underneath an elevated train track when powerful RCA/Bluebird producer Lester Melrose dropped a few coins in Crudup's hat. Melrose hired Crudup to play a party that 1941 night at Tampa Red's house attended by the cream of Melrose's stable: Big Bill Broonzy, Lonnie Johnson, Lil Green. A decidedly tough crowd to impress -- but Crudup overcame his nervousness with flying colors. By September of 1941, he was himself an RCA artist.\n\nCrudup pierced the uppermost reaches of the R&amp;B lists during the mid-'40s with &quot;Rock Me Mama,&quot; &quot;Who's Been Foolin' You,&quot; &quot;Keep Your Arms Around Me,&quot; &quot;So Glad You're Mine,&quot; and &quot;Ethel Mae.&quot; He cut the original &quot;That's All Right&quot; in 1946 backed by his usual rhythm section of bassist Ransom Knowling and drummer Judge Riley, but it wasn't a national hit at the time. Crudup remained a loyal and prolific employee of Victor until 1954, when a lack of tangible rewards for his efforts soured Crudup on Nipper (he had already cut singles in 1952 for Trumpet disguised as Elmer James and for Checker as Percy Lee Crudup).\n\nIn 1961, Crudup surfaced after a long layoff with an album for Bobby Robinson's Harlem-based Fire logo dominated by remakes of his Bluebird hits. Another lengthy hiatus preceded Delmark boss Bob Koester's following the tip of Big Joe Williams to track down the elusive legend (Crudup had drifted into contract farm labor work in the interim). Happily, the guitarist's sound hadn't been dimmed by Father Time: his late-'60s work for Delmark rang true as he was reunited with Knowling (Willie Dixon also handled bass duties on some of his sides). Finally, Crudup began to make some decent money, playing various blues and folk festivals for appreciative crowds for a few years prior to his 1974 death.\n\n\n &lt;a href=&quot;\nhttp://www.allmusic.com/artist/arthur-big-boy-crudup-p67615/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/arthur-big-boy-crudup-p67615/biography&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e9c05f72f1473c7017984c902e49dfb25cedf750","amp;dn":"Arthur+%27Big+Boy%27+Crudup+-+Crudup%27s+After+Hours+%281945-1947%29+%5BFLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9c05f72f1473c7017984c902e49dfb25cedf750","infoHashBuffer":{"type":"Buffer","data":[233,192,95,114,241,71,60,112,23,152,76,144,46,73,223,178,92,237,247,80]},"announce":[],"urlList":[]}}