{"title":"Seether feat. Amy Lee - Broken  (2nafish)","uid":5317641,"size":150575108,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eb7f13f61f73aab939a0b9f03ff8c9cfd96dc493&amp;dn=Seether+feat.+Amy+Lee+-+Broken++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264725300,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Broken&quot; is a song by post-grunge band Seether with Amy Lee of Evanescence. The original acoustic version is the 12th track on Seether's debut album Disclaimer. It was then re-recorded with Amy Lee, the future girlfriend of Seether vocalist Shaun Morgan, for The Punisher: The Album in March 2004. This version includes electric guitar and violins. This song peaked at number 20 on the Billboard Hot 100 and at number 3 on the ARIA singles chart. It was certified gold by the RIAA.\n\nThe Nigel Dick-directed music video features Morgan sitting in an abandoned car playing an acoustic guitar with Lee appearing behind him as her vocals fade in. For the remainder of the video, Lee and Morgan wander through a dilapidated landscape that was revealed on the Disclaimer II DVD to be a real-life trailer park incinerated by a crystal meth lab explosion. Although there are shots of the band and Lee performing together in a clearing, the underlying theme of the video is Lee and Morgan searching for each other in this landscape and never finding each other. It's rumored that Amy Lee wears her black wings as an image of Morgan viewing her as an angel in his dreams.\n\nThe re-recorded version's inclusion in the film's trailers, not to mention heavy airplay at the time of its release, made it one of the most popular songs Seether has ever recorded. This led to the Disclaimer II re-release in June which includes both versions of &quot;Broken&quot;. Although it was recorded with Lee, the song had been written long before Morgan and Lee were dating.\n\nDisclaimer is the major label debut album by post-grunge band Seether, released in 2002. The album was remastered and remixed slightly in 2004 as Disclaimer II with eight extra tracks. The album had ten different cover variations. These feature images from the &quot;Fine Again&quot; music video with people holding signs depicting a negative outlook or a poor situation in life.\n\n&quot;Fine Again&quot; &quot;Driven Under&quot;, and &quot;Gasoline&quot; were released as singles from the album. The band revealed during their interview for One Cold Night that they originally intended to release &quot;Sympathetic&quot; as a single but for a variety of reasons, the release was dropped in favor of continued touring and a release of Disclaimer II.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:eb7f13f61f73aab939a0b9f03ff8c9cfd96dc493","amp;dn":"Seether+feat.+Amy+Lee+-+Broken++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb7f13f61f73aab939a0b9f03ff8c9cfd96dc493","infoHashBuffer":{"type":"Buffer","data":[235,127,19,246,31,115,170,185,57,160,185,240,63,248,201,207,217,109,196,147]},"announce":[],"urlList":[]}}