{"title":"MICHAEL JACKSON GREATEST HITS [Ekstra Fast]","uid":4977674,"size":223032339,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ebaf5cefde0e3930ef022933453e5b85f6a30cfb&amp;dn=MICHAEL+JACKSON+GREATEST+HITS+%5BEkstra+Fast%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xforcer","files":38,"time":1246092325,"description":"MICHAEL JACKSON GREATEST HITS\n\nbad.mp3 (5.64 megabyte)\ni want you back.mp3 (4.09 megabyte)\njam.mp3 (12.95 megabyte)\na b c (1,2,3).mp3 (4.05 megabyte)\nsay say say.mp3 (5.41 megabyte) [With Paul McCartney]\nthe way you make me feel.mp3 (6.09 megabyte)\nman in the mirror.mp3 (7.29 megabyte)\ndirty diana.mp3 (6.42 megabyte)\nrockin robin.mp3 (3.5 megabyte)\nben.mp3 (3.8 megabyte)\nsmooth crimanal.mp3 (5.88 megabyte)\nblame it on the boogie.mp3 (4.81 megabyte)\nblack or white.mp3 (4.61 megabyte)\ndont stop til you get enough.mp3 (5.41 megabyte)\nremember the time.mp3 (5.49 megabyte)\ngive in to me.mp3 (12.55 megabyte)\nin the closet.mp3 (6.6 megabyte)\nrock with you.mp3 (4.64 megabyte)\nwho is it.mp3 (5.48 megabyte)\nheal the world.mp3 (8.8 megabyte)\ncan you feel it.mp3 (5.27 megabyte)\nwill you be there.mp3 (5.04 megabyte)\nthe girl is mine.mp3 (5.07 megabyte)\nyou are not alone.mp3 (6.77 megabyte)\nbillie jean.mp3 (6.7 megabyte)\nearth song.mp3 (6.91 megabyte)\nbeat it.mp3 (5.9 megabyte)\nthey dont care about us.mp3 (6.5 megabyte)\nwanna be startin something.mp3 (5.89 megabyte)\nyou rock my world.mp3 (7.05 megabyte)\nhuman nature.mp3 (5.17 megabyte)\np y t (pretty young thing).mp3 (5.46 megabyte)\nthriller.mp3 (7.19 megabyte)        \nThere Must Be More Than Life That This.mp3 (4.33 megabyte) [With Freddy Mercury]\n\nCOMMENTS ON THE DAY THE WORLD FOUND OUT\n\nThe following 143 users said thanks to the torrent uploader:\n01735 from DM, 0zz1 from SK, 4thelove from US, acamposp from CL, achew from TH, adwh from ES, Afa88 from PL, Agamemnon222 from SE, akimvi from EE, AlienGamers from LK, altrixi from HU, amarove4, andy07841 from GB, angelagwen from TW, argiemegg from PH, Aristedis from GR, armenitux from IT, artjay from PH, aspicmed from MA, autumn_breeze9, bbbq from KR, BogdyBBA from RO, buttan from FR, buttercake from GB, C-Laud from AU, cacaoline from FR, celalkan from TR, chandran_p from AE, chris150 from MK, ClacBek from FR, clarkkent70 from AU, coolpranil from IN, CrackEM from US, crazyonher from MY, cstkyd from PH, dalturbo from JM, danicsta from BR, darkshadow667 from US, Dark_Knight1 from US, DavidMarc99 from US, dearsina from GB, Decklyn from GB, Deonhotboy from GD, desert_access from SA, Dijinn from PH, dnesh88 from MY, dream-torrent from TN, dreamtimek452 from GB, dwears from TT, eagleonmychest from AL, ekto33 from FR, eldhose40784 from QA, entrail from CA, escobarm from GT, eTati from DE, extreme82 from AU, faisal_asif from SA, Fallen_Angel_3 from SI, fssalaska from US, gazza2007 from GB, germanhitler from IN, gigininis from NL, GPdogg from IT, guven016 from TR, hammmy1 from GB, hellchef from CA, hrvn from VN, HunKors from HU, iNsAnEnEwBiE from US, invader123 from IN, J4B3R from GB, jorjap from RO, jujija from PT, kabukiwk from BR, kamehameha from VN, kenlfc1892 from IE, KikiRose from FR, Kn0w7edge from US, lady-garden from GB, Ladycharm from NL, Leetske from NL, liRiiik from CZ, localhostt from IN, locomotion from US, luiscoxo from PT, LukaCruz from NL, lukas_1987_dion from PL, mbalan from MY, mchan-makikun from JP, MEMX from GB, MetallicaKinG from NL, molonj from GB, movalia from RO, mv21972 from PT, neewy from RU, neoxmass from FR, ortofio from IT, Pagani-Power from KW, phoenixuk from GB, prasugopu from IN, Pyro2094 from CA, Rashje from NL, Reminyl from GB, riksam from AU, rob9028 from GB, roman9911 from PH, sageauk, SamiRapper from IT, saraviva09 from FR, Sebastian_3358 from GR, shamanch from RU, shell000 from GB, shlakhbroukette, shylock20 from BR, Sim69 from AU, sivaramsammeta from GB, skunkburner from GB, skurix from PL, Snooza from GB, somamax from EG, stanley3 from PH, Stroke from SI, Sully6000 from GB, t23dob from GB, tdr85 from FR, Teriaaaaa from FR, thanksalot from GB, thiassou from FR, tony_081983 from PH, TOPRANKIN from GB, tost from TR, Turtli from FR, vasco_tech88 from PT, vdthewarrior from PK, Vid89 from RS, vipanuj from IN, waitingfortheday from MY, winamp3 from CN, xelahs from CA, xhofl102 from CZ, xman2009 from TH, zadyq from QA, zlich from MY\n\n1.Posted by wawijr on Jun 26 2009 at 05:10\n\nthank u 4 sharing!\n\ni all ready miss Michael and was hoping to get a chance toc a full show.\nbut i did get 20 min and 2 songs at the 911 concert. right in front of his crane , so we were quite close.\n\nThe world tommorow will be a little dimmer with Michael with us.\n\nRIP forever\nmichael\n","torrent":{"xt":"urn:btih:ebaf5cefde0e3930ef022933453e5b85f6a30cfb","amp;dn":"MICHAEL+JACKSON+GREATEST+HITS+%5BEkstra+Fast%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebaf5cefde0e3930ef022933453e5b85f6a30cfb","infoHashBuffer":{"type":"Buffer","data":[235,175,92,239,222,14,57,48,239,2,41,51,69,62,91,133,246,163,12,251]},"announce":[],"urlList":[]}}