{"title":"insurgencycontent.gcf","uid":4618766,"size":1844659800,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ebfba02b70954a994adb6d49a425454049bde637&amp;dn=insurgencycontent.gcf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Smile1988","files":1,"time":1230944197,"description":"Welcome to 21st century warfare, soldier! Insurgency has a focus on objective capturing and reinforcement-based gameplay. In Insurgency, you will either deploy as a marine or take up arms as an insurgent. The layout of the objective areas and the amount of reinforcements available varies from battle to battle.\n\nIn Insurgency, you are either a Commander, or a follower. There is one Commander per Squad or Cell, and this person has a wide range of leadership abilities. Using the Communications Menu, Commanders can call for reinforcements, change the target objective, assign waypoints, or give orders. This Chain of Command gives the Commanders of each team ultimate responsibility for Victory or Defeat.\n\nThe team with the better leadership and execution will win, making Insurgency ideal for tactical and competitive gamers. Stick with your team-mates as you sprint from cover to cover, because your heart will be pounding when you're outnumbered and overwhelmed by an enemy force. Rise in rank by getting kills and securing objectives, which are located on your directional indicator on the top of the screen. Proceed with caution however, because you won't know if your enemy is dead until you see their corpse, and you could kill or be killed in one well-placed shot.\n\nThe Insurgency manual will ideally connect all the dots for you, the player, so that you can enjoy the game to its full potential. Please use the navigation to the right!\n\n\n &lt;a href=&quot;\nhttp://www.insmod.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.insmod.net/&lt;/a&gt;","torrent":{"xt":"urn:btih:ebfba02b70954a994adb6d49a425454049bde637","amp;dn":"insurgencycontent.gcf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebfba02b70954a994adb6d49a425454049bde637","infoHashBuffer":{"type":"Buffer","data":[235,251,160,43,112,149,74,153,74,219,109,73,164,37,69,64,73,189,230,55]},"announce":[],"urlList":[]}}