{"title":"Barclay James Harvest - Baclay James Harvest...And Other Short S","uid":10676232,"size":455631235,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ec415abdd417a71b6c865c11fa9ff3a06e815cb9&amp;dn=Barclay+James+Harvest+-+Baclay+James+Harvest...And+Other+Short+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moondust1970","files":47,"time":1406949939,"description":"AMG Review:\n\nLike the work of Buffalo Springfield or the Moody Blues in the first go 'round, you'll need to take it on faith that the Baroque touches on Barclay James Harvest and Other Stories were effective for their time. The fuzzed guitars, Mellotron, bongos, heavy orchestration and dreamy arrangements may sound stilted today, but strip them away (or simply acquiesce to enjoy them) and a very good collection of songs reveals itself. There are obvious nods to the Beatles (&quot;Blue John Blues,&quot; &quot;Medicine Man&quot;) and the Moodies (the lovely &quot;Ursula&quot;), but that's a fait accompli on any Barclay James Harvest album. Although the album doesn't really tell any stories (an optimistic acceptance of mortality comes into play on a couple of tracks), the band does aspire to bigger things on the aptly titled &quot;The Poet.&quot; The only knock on this album (and it pertains to Barclay James Harvest in general) is that you wish they aspired to more. The classical arrangements are stunning, and when the band musters a big orchestral ending for a song like &quot;Little Lapwing,&quot; you can't help but wonder how much better it would have been if they'd invoked it sooner. Musically the band is solid; Mel Pritchard's Ringo-isms on the drums are especially neat, while John Lees gets in some nice distorted guitar parts and Stewart Wooly Wolstenholme steals the show when the Mellotron comes into play. The epic &quot;After the Day&quot; closes things on a high note, ending with an explosion that announces all bets are off. Barclay James Harvest and Other Stories is itself a high note in the band's early catalog and worth a flyer for anyone interested in the band's oeuvre. [The 2002 EMI CD reissue included six bonus tracks, five of which were previously unreleased.]\n\nFLAC\n\nBarclay James Harvest\n\nBarclay James Harvest...And Other Short Stories (2002 Remaster)\n\n1972\n\nCD - Artwork included\n\n","torrent":{"xt":"urn:btih:ec415abdd417a71b6c865c11fa9ff3a06e815cb9","amp;dn":"Barclay+James+Harvest+-+Baclay+James+Harvest...And+Other+Short+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec415abdd417a71b6c865c11fa9ff3a06e815cb9","infoHashBuffer":{"type":"Buffer","data":[236,65,90,189,212,23,167,27,108,134,92,17,250,159,243,160,110,129,92,185]},"announce":[],"urlList":[]}}