{"title":"Alan John Miller. Secrets of the Universe Day 1","uid":4579341,"size":2370272421,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ee5d76f9bdea69a4c051d9cd9e35ad8e73518125&amp;dn=Alan+John+Miller.+Secrets+of+the+Universe+Day+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cooked1","files":6,"time":1229359243,"description":"Secrets of the universe is a seminar recorded over two days in January 2008 featuring Alan John (AJ) Miller.\nit provides a wealth of clear infomation about the the nature of the spirit world, the makeup of humans as multi-faseted interdimentional beings, the importance of working through and clearing emotional damage stored in the soul and most importantly how you as a child of god, can create and develop a direct relationship and comunication with God.\n\nboth days includes a question session with a spirit channeled through a medium.\n\nAJ says he knows this infomation because he remembers living in the first centuary and existing in the spirit world for almost 2000 years leading up to this life.\n\nAJ makes some big claims, that may be hard to handle but give it a good chance. i found this an incredibly refreshing viewpoint on spirutality and religion that proves it's merrit through practice.\n\nthis Secrets Of The Universe seminar is the recomended introduction to AJ's teachings. More DVD rips are on the way! AJ gave permision for this to be uploaded.\n\nin .avi (XVID) format.","torrent":{"xt":"urn:btih:ee5d76f9bdea69a4c051d9cd9e35ad8e73518125","amp;dn":"Alan+John+Miller.+Secrets+of+the+Universe+Day+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee5d76f9bdea69a4c051d9cd9e35ad8e73518125","infoHashBuffer":{"type":"Buffer","data":[238,93,118,249,189,234,105,164,192,81,217,205,158,53,173,142,115,81,129,37]},"announce":[],"urlList":[]}}