{"title":"THE ODD COUPLE - 1968 [PALDVD] XVID MP3 ENG [A-RG]","uid":3743498,"size":979188494,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f007475ec4b30a9d25b5223e76790ca1e43404e1&amp;dn=THE+ODD+COUPLE+-+1968+%5BPALDVD%5D+XVID+MP3+ENG+%5BA-RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MacTorrent007","files":5,"time":1184573669,"description":"Originated: Darkside Release Group\n\nThe Odd Couple was originally produced for Broadway and the original cast starred Art Carney as Felix and Walter Matthau as Oscar. For the film version, Matthau reprised his role as Oscar, but Carney turned the film down. Felix was played by Jack Lemmon who had not played the character before. Most of the script from the play is the same, although the setting is expanded: instead of taking place entirely in Oscar\\\\\\\\\\\\\\&amp;#039;s apartment, Simon also wrote some scenes that take place at various outdoor New York City locations (most notably one at Shea Stadium in Queens, New York).\n\nOscar\\\\\\\\\\\\\\&amp;#039;s poker player friends also made up the cast, they were Roy (David Sheiner), Vinnie (John Fiedler), Speed (Larry Haines) and Murray the Cop (Herb Edelman). The plot of the film is simply having to deal with Felix, who was just thrown out of his house by his wife Frances, having nowhere to turn but to his good friend Oscar\\\\\\\\\\\\\\&amp;#039;s house. Oscar asks Felix to stay with him for awhile, as Felix was near suicide at his plight with his crumbling marriage. It would soon comedically be a decision that Oscar would regret.\n\nThe film made its debut at Radio City Music Hall in 1968. The critics were divided, most had positive things to say about Matthau\\\\\\\\\\\\\\&amp;#039;s perfomance, they were less amicable about Lemmon.[citation needed] The film nonetheless was a hit and earned Neil Simon a nomination for the Academy Award for Writing Adapted Screenplay. The film was also nominated for the Golden Globe Award for Best Motion Picture - Musical or Comedy and Lemmon and Matthau were both nominated for the Golden Globe Award for Best Actor - Motion Picture Musical or Comedy.\n\nThe film also eventually spawned a television series spinoff in 1970, also titled The Odd Couple. A sequel, The Odd Couple II was released 30 years later.\n\n","torrent":{"xt":"urn:btih:f007475ec4b30a9d25b5223e76790ca1e43404e1","amp;dn":"THE+ODD+COUPLE+-+1968+%5BPALDVD%5D+XVID+MP3+ENG+%5BA-RG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f007475ec4b30a9d25b5223e76790ca1e43404e1","infoHashBuffer":{"type":"Buffer","data":[240,7,71,94,196,179,10,157,37,181,34,62,118,121,12,161,228,52,4,225]},"announce":[],"urlList":[]}}