{"title":"DC++ 0.761","uid":5487626,"size":21220841,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f24d249da77c1baf60a1ab62ad75156d9846ce9c&amp;dn=DC%2B%2B+0.761&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1270774628,"description":"Copied from DC++ Homepage:\n\n\nWelcome to DC++\n\nDC++ announces the freedom to share!\nDC++ is an open source client for Windows for the Direct Connect network.\nDirect Connect allows you to share files over the Internet without restrictions or limits. The client is completely free of advertisements and has a nice, easy to use interface. Firewall and router support is integrated and it is easy and convenient to use functionality like multi-hub connections, auto-connections and resuming of downloads.\n\n\nFirst time user?\n\nDC++ is a highly ranked piece of software among the projects hosted at Sourceforge. With more than fifty million downloads, new users continue to find benefits from the software every day.\n\n\nOverview\n\nDC++ is a client for the Direct Connect file sharing network.\nThe Direct Connect network is a decentralized network, made up of individual servers (hubs) that users join to share files with other members on that hub.\nEach hub is individually run by a fellow user of the Direct Connect network, and may have certain themes to the content on the hub.\nHub owners set up rules to regulate their hub as they see fit.\n\n\nFeatures\n\nDC++ is, based on observable factors, the most prevalent client on the Direct Connect network. Below are some of its features:\n\n\n* No ads, spyware, or bundled software that you don't need\n\n* Open source software, code freely available under the GNU GPL\n\n* Joins multiple hubs at the same time\n\n* List of bookmark-like favorite hubs and users\n\n* Shares large files and many files per your organization scheme\n\n* Tiger Tree Hashes (TTH) used for file integrity\n\n* Search across all (or selected) connected hub by type, size, or name\n\n* Resume of downloads, with optional search for alternate sources\n\n* Logging options and configuration for chat, private messages, downloads, and uploads\n\n* Autoconfiguration of UPnP routers\n\n* MAGNET link support for linking to specific content\n\n* Automatic and manual download priorities\n\n* Saving of user's file lists for browsing and queueing\n\n* Translation into other languags by custom supplied gettext po language files\n\n* Segmented downloading\n\n\n\nChangelog:\n\n\n0.761 2010-03-14\n\n* [L#533840] Fix crashes with themed menus (poy)\n* Fix showing settings from the tray menu (poy)\n* Prevent a crash when the app is closed while a modal dialog is up (poy)\n\n\n0.760 2010-03-11\n\n* [L#263390] Fix main icon format (poy)\n* Help updates (emtee, poy)\n* Handle file lists better in finished windows (emtee, poy)\n* [dwt] Implement Richedit text control (cologic)\n* Update the file list window title bar when the user online status changes (poy)\n* Re-open previous windows - no auto-connect/auto-open setting anymore (poy)\n* Fix own file list not deleted on closure\n* Fix menu title size (poy)\n* [L#239895] Display ISTA\n* &quot;Recent windows&quot; button in the toolbar (poy)\n* Upgraded to OpenSSL 0.9.8m-beta1 (poy)\n* [L#350585] Fix sorting issues in finished windows (poy)\n* [L#339872] Fix crash when decompression initialization fails (steven sheehy)\n* Restore check-boxes in the &quot;Context&quot; user command group (poy)\n* CTM protection by domain name instead of ip (thanks poy)\n* [L#362598] Fix share crash (thanks emtee)\n* [L#367186] Fix crash in waiting users (poy)\n* [L#261185] Use standard user menus in PMs, waiting users, file lists (poy)\n* [L#210727] Solve file list refresh &amp; hashing sync issues (thanks ben)\n* [L#264342] Stop hashing on shutdown (thanks steven sheehy)\n* [L#350994] Fix ignored downloads from search (poy)\n* [L#362878] Compilation fix for Mac OS X (thanks ximin luo)\n* Save user nicks (poy)\n* [L#384558] Don't share the temporary download directory (poy)\n* [L#385818] More native menu colors (poy)\n* [L#385821] Apply the font to check-boxes and tabs (poy)\n* [L#213213] Implement bandwidth throttling (cologic, bigmuscle)\n* New icons (thanks radox)\n* Fix dialog focus issues (poy)\n* Fix a crash in queue frame\n* Move finished downloads functionality into queue frame\n* [L#415965] Hashing can be paused (bigmuscle, emtee, poy)\n* [L#414068] No 35-characters limit to nick and description (ullner)\n* [ADC] Support the TS param of MSG (poy)\n* Convert language codes to real names in settings (poy)\n* Improve user command support in ADC hubs (poy)\n* Improve context-sensitive help (poy)\n* Fix Ctrl+Shift+Tab (poy)\n* Readded WTL exception to the license (for mod developers)\n* Update to boost 1.40\n* [L#463723] Fixed download directory path on non-win32 (thanks razzloss)\n* Favorite hub groups (poy)\n* [L#206778] Fix issues related to users online in multiple hubs (poy)\n* [L#460724] [ADC] Handle self-QUI when sent before INF (thanks sulan)\n* [L#431045] Don't overwrite downloaded files in some cases (thanks emtee)\n* Fix splitter positioning (poy)\n* [ADC] Don't send commands that the hub has forbidden via STA (poy)\n* [L#458498] Fix bad bloom error message causing disconnects\n* Fix coloring of drop-down controls (poy)\n* Show last main chat lines, add a &quot;History&quot; settings category (poy)\n* [L#483323] Fix share files instantly after downloaded (emtee)\n* Toolbar customization (shift+drag, double-click, right-click) (poy)\n* [L#338888] Fix sharing hidden directories (emtee)\n* Auto-resize the message editing box when composing a multiline message (poy)\n* Remove flicker when opening a window (poy)\n* Re-try UPnP mappings after closing settings (poy)\n* [L#485018] Handle adcs:// links (thanks emtee)\n* [L#484247] Fix memory usage when parsing (unreasonably) large file lists\n* [L#242259] Fix a few more cases when adding sources to the queue (emtee)\n* [ADC] Filter some status messages\n* Drop support for non-xml hub lists\n* [L#351393] Fix memory leak during share update\n* [L#400080] Improve hub list status messages (emtee)\n* [ADC] Allow hubs to send IPs of passive users via INF (poy)\n* [L#473173] Fix crash when hashing files on non-Windows systems (thanks razzloss)\n* Update list-view filters more often (poy)\n* Show multiple user-command params in the same dialog (poy)\n* [L#509456] Fix pressing Tab in the notepad (poy)\n* Register in HKCU instead of HKLM to avoid UAC warnings; ditch magnet.exe (poy)\n* Don't use the Vista download dir when running in local mode\n* When a static window is opened, check its menu &amp; toolbar buttons (poy)\n* [L#321246] Fix crash with debug builds on non-Windows systems (steven sheehy)\n* [L#510314] Fix a possible crash in rechecker (thanks poy)\n* Don't move files &lt;= 10 MB to weird places\n* [L#515646] Remove ADC 0.10 compatibility (not ADCS 0.10) (cologic)\n* Change the tray icon on private messages (poy)\n* [L#195209] Revise keyboard shortcuts (poy)\n* Error message when loading the notepad file fails (poy)\n* Remove obsolete default hublists (emtee)\n* Chat actions should work better when the user list is hidden (poy)\n* Icons and tooltips in status bars (radox, poy)\n* Update the installer to cope with new settings directories (emtee)\n* [L#512032] Guard against out-of-screen window placement\n\n\nThe client can be downloaded, precompiled and ready to run. DC++ runs on Windows NT based operating systems such as Windows 2000, XP, Vista &amp; Windows 7.\n\n\nED2K Link:\ned2k://|file|DCPlusPlus-0.761.exe|21220841|fd1818f59c12f1f3f00d605b04012d85|/\n\n\nComments from the uploader (olofolleola4):\nHere is a FAQ (Frequently Asked Questions) for DC++:\nhttp://www.dslreports.com/faq/dc/\n\n\nNew user on Direct Connect and unsure of what to do? Go read our startup guide: http://dcplusplus.sourceforge.net/webhelp/get_started.html\n\nHere is some links if you cannot download it through this torrent:\nupload box  .  com  /  files  /  1858427769\nrapid share  .  com  /  files  /  373821459  /  DCPlusPlus-0.761.exe","torrent":{"xt":"urn:btih:f24d249da77c1baf60a1ab62ad75156d9846ce9c","amp;dn":"DC%2B%2B+0.761","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f24d249da77c1baf60a1ab62ad75156d9846ce9c","infoHashBuffer":{"type":"Buffer","data":[242,77,36,157,167,124,27,175,96,161,171,98,173,117,21,109,152,70,206,156]},"announce":[],"urlList":[]}}