{"title":"Angels and Agony - Discography (1999-2007)","uid":4901644,"size":609181200,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f624d17843c671bbae5d70cf3a012eb994b56184&amp;dn=Angels+and+Agony+-+Discography+%281999-2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":111,"time":1242665315,"description":"Angels and Agony are a Dutch futurepop band consisting of vocalist Reinier Kahle, guitarist Erik Wierenga, DJ Marco van Belle on synthesizer and backing vocals and Fried Bruggink as sound engineer and drummer. The band formed in 1995 and produced two EPs before its first full album, Eternity (2001). Eternity was produced by VNV Nation's Ronan Harris. Other high-profile collaborations include Axel Ermes of Girls Under Glass, Diorama, and SITD The band's current record label (since Eternity, 2001) is Out of Line, a German label of industrial- and synthpop-oriented electronic bands. Metropolis Records is the band's US distributor since 2004.\n\nAccording to Reiner, the name of the band symbolizes the duality of human experience. It was also the name of a graphic novel Reiner worked on in 1995 simultaneously to founding the band.\n\nSimilar artists to Angels and Agony are VNV Nation, Assemblage 23, and Covenant. A 2007 interview commented on the musical style of the band, noting that, in contrast with many electro-industrial projects whose lyrics center on violence and provocation, Angels and Agony songs are philosophical and humanist in character. To this Renier replied: &quot;The lyrics are meant to be 'universal', multi-interpretable and objective, in a way.... I'm just not the guy to write songs, singing 'Fuck' 116 times in 4 minutes, or singing I'd like to cut up my bitch or what have you not.&quot;[4] Metropolis Records describes the band's music thus: &quot;Although the music can be dark and melancholic, but still danceable with pumping beats and sequences, the songs have a very positive message.","torrent":{"xt":"urn:btih:f624d17843c671bbae5d70cf3a012eb994b56184","amp;dn":"Angels+and+Agony+-+Discography+%281999-2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f624d17843c671bbae5d70cf3a012eb994b56184","infoHashBuffer":{"type":"Buffer","data":[246,36,209,120,67,198,113,187,174,93,112,207,58,1,46,185,148,181,97,132]},"announce":[],"urlList":[]}}