{"title":"Crysis: Special Edition Un-Touched (Original)","uid":4801033,"size":6655266816,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f793e34e558c4d2e83ab42f3cd4c430be58a489d&amp;dn=Crysis%3A+Special+Edition+Un-Touched+%28Original%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"utsa-guzman","files":-1,"time":1238040594,"description":"Crysis: Special Edition\n\nSet in 2019 after a colossal asteroid crashes to Earth, Crysis begins amidst a tense military standoff between the North Korean and United States governments for control of the impact zone. Amid rising tensions, the asteroid suddenly bursts open revealing a massive alien ship, which begins freezing vast portions of the island and altering the global weather system. The invasion of Earth has begun. Crysis features an epic three-act story of alien invasion where players are able to customize their armor and weapons in real time to confront an ever-changing enemy and a harsh, dynamic environment.\n\nAvailable for a limited time, this Special Edition 3-disc set contains a tremendous amount of extras including behind the scenes looks and interviews with the minds behind Crysis at Crytek, and some of the breathtaking art that has had kept people buzzing since the game's debut.\n\n___________________________________________________________________________________\n\nRemember That to open these files you are going to need Power ISO, although do not extract them just yet but instead mount them onto an image... Then open them for safer extraction....\n_____________________________________________________________________________________\n\nHey guys; I know that all of you, like myself are trying to meet loose ends meet due to this tough economy. So that's why i have brought you a couple of links that could help you keep money in your pocket and maybe even earn some without wasting a cent.\n\n \n\n","torrent":{"xt":"urn:btih:f793e34e558c4d2e83ab42f3cd4c430be58a489d","amp;dn":"Crysis%3A+Special+Edition+Un-Touched+%28Original%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f793e34e558c4d2e83ab42f3cd4c430be58a489d","infoHashBuffer":{"type":"Buffer","data":[247,147,227,78,85,140,77,46,131,171,66,243,205,76,67,11,229,138,72,157]},"announce":[],"urlList":[]}}