{"title":"Deck the Halls(2006)DVDRip.AC3(ENG)-DROCK","uid":6220040,"size":731933303,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f9b5f801673b2753d201fbcd3734eabc83e8fe03&amp;dn=Deck+the+Halls%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":1,"time":1299299372,"description":"When the spirit of Christmas compels a small-town New Englander to decorate his home with enough lights to make it visible from space, much more is set to be decked than just the halls in this holiday comedy featuring Danny DeVito and Matthew Broderick as two warring neighbors determined to outdo each other in creating the best lighting display on the planet. Christmas is without question the most wonderful time of the year for Cloverdale, MA optometrist Steve Finch (Broderick). Unfortunately, the same can't be said for Steve's wife, Kelly (Kristin Davis), and the pair's two children, Madison (Alia Shawkat) and Carter (Dylan Blue). Despite Steve's annual holiday zeal, the rest of the Carters have grown to resent the seemingly endless family rituals leading up the Winterfest carnival over which their terminally cheerful patriarch presides. Though it seems that nothing in the world could dampen the spirits of the local &quot;King of Christmas,&quot; Steve soon finds his royal status challenged when used-car salesman Buddy Hall (Danny DeVito) moves in next door and covers his house with enough festive lights to make it visible from the deepest crater of the moon. His Yuletide thunder effectively stolen, Steve resorts to desperate measures in regaining his crown when Buddy's lavish decorations make him a local celebrity, his wife strikes up a warm friendship with the neighbor's outspoken better half, Tia (Kristin Chenoweth), and even the kids seem to warm to the car salesman's air-headed twin daughters, Ashley and Emily (Sabrina and Kelly Aldridge).\n\nRipped with Handbrake.\n\nLength: 1 Hour 33 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:f9b5f801673b2753d201fbcd3734eabc83e8fe03","amp;dn":"Deck+the+Halls%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9b5f801673b2753d201fbcd3734eabc83e8fe03","infoHashBuffer":{"type":"Buffer","data":[249,181,248,1,103,59,39,83,210,1,251,205,55,52,234,188,131,232,254,3]},"announce":[],"urlList":[]}}