{"title":"Job Reconnaisance LittleFairyRG","uid":9386761,"size":5309762,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9b9a65706b8a6cdec8acf4f972bf39f00dbb3a7&amp;dn=Job+Reconnaisance+LittleFairyRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SirHates","files":2,"time":1387817199,"description":"\n\nJob Reconnaissance: Using Hacking Skills to Win the Job Hunt Game by Josh More\n2013 | ISBN: 0124166016 | English | 196 pages | PDF | 4 MB\n\nThere is considerably more skill in the IT and security communities than is reflected in the jobs people are able to attain. Most people's limiting factor in their ability to get better jobs is not technical skills or even the soft skills necessary to do well in a new job. It is that getting a job is a completely different skill set and one that most people only practice every few years.\nJob Reconnaissance: Using Hacking Skills to Win the Job Hunt Game explains the job hunting process, why the most commonly followed models fail and how to better approach the search. It covers the entire job hunt process from when to decide to leave your current job, research new possible job opportunities, targeting your new boss, controlling the job interview process and negotiating your new compensation and the departure from your current job.\n\n\n\nThis is not a complete all-in-one job-hunting book. This book assumes that the reader is reasonably competent and has already heard most of the &quot;standard&quot; advice, but is having difficulty putting the advice into practice. The goal is to fill in the gaps of the other books and to help the readers use their technical skills to their advantage in a different context.\n\nThe emphasis in Job Reconnaissance is for infosec and IT job seekers to leverage the same skills they use in penetration testing and recon toward job-hunting success. These skills include targeting, reconnaissance and profiling combined with a technical look at skills other career search books commonly miss.\n\nCovers the entire job hunt process from when to decide to leave your current job to the departure of your current job\nSuggests how to research new possible job opportunities\nShows how to target your new boss, controlling the job interview process and negotiating your new compensation\n","torrent":{"xt":"urn:btih:f9b9a65706b8a6cdec8acf4f972bf39f00dbb3a7","amp;dn":"Job+Reconnaisance+LittleFairyRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9b9a65706b8a6cdec8acf4f972bf39f00dbb3a7","infoHashBuffer":{"type":"Buffer","data":[249,185,166,87,6,184,166,205,236,138,207,79,151,43,243,159,0,219,179,167]},"announce":[],"urlList":[]}}