{"title":"Aenaon Diskography","uid":5799693,"size":50614014,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fb02ea57c2f6719757f5d5b1536daf80ed683791&amp;dn=Aenaon+Diskography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"crown666","files":11,"time":1283210020,"description":"Aenaon is a black/experimental metal band coming from Hellas (Greece).\n\n\nThis torrent contains:\n(2009)Phenomenon mini EP\n(2010)A Parallel Zoetrope 7&quot; Split with Satanochio\n\n\nBiography\n\n2005: Thyragon and Draugen had the idea for Aenaon in December, with Draugen on guitars and vocals, and Thyragon on guitars and bass.\n\n2006: There was a long &quot;dead&quot; period, in which Aenaon continued composing music. In June Astrous (Disolvo Animus, ex-Black Winter, ex-Majeste Simphonia) joined the band and  took care of the vocal and lyrical section. At the end of 2006 was the time for Vanghmar (Soulless, ex-Enshrine, ex-Obsecration, Soulskinner-session) to fill the empty rhythm section slot . Aenaon begun to work their songs, and the first rehearsals were made...\n\n2007: In January 2007, Achilleas (Varathron, Netherrealm) came &quot;onboard&quot; to fill the second guitar slot. Finally with full line up, Aenaon performed a lot of rehearsals and started the recordings of their debut EP album &quot;Phenomenon&quot;. Meanwhile Aenaon made a mini tour in Greece with Nethescerial and released a promo cd under the title &quot;Promo 2007&quot;.\n\n2008: Achilleas left the band. A few weeks later Dagwn (Nethescerial) took his place. Aenaon signed with the Canadian Bleak Art Records in the beginning of the year.\n\n2009: The &quot;Phenomenon&quot; EP released at 22 September. In the end of the year Draugen and Vanghmar left the band for different reasons and the vacant guitarist position was taken once again from one of their first guitarists, Achilleas. \n\n\n2010: New standards and new purposes make the band to develop their sound. In 19 July, Aenaon are going to release &quot;A Parallel Zoetrope&quot; split 7' with the Romanian band, Satanochio. This split is going to be released from Floga Records and Orkestral Promenade Productions limited in 500 worldwide copies.\n\nAenaon are currently composing their new album.\n\nAenaon 2010 line up:\n\nAstrous: vocals\nAchilleas: guitars\nThyragon: bass\nDagwn: guitars\n\n\n\nWebsite:","torrent":{"xt":"urn:btih:fb02ea57c2f6719757f5d5b1536daf80ed683791","amp;dn":"Aenaon+Diskography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb02ea57c2f6719757f5d5b1536daf80ed683791","infoHashBuffer":{"type":"Buffer","data":[251,2,234,87,194,246,113,151,87,245,213,177,83,109,175,128,237,104,55,145]},"announce":[],"urlList":[]}}