{"title":"Jennifer Lopez - Waiting For Tonight (Hex Hector Remix)","uid":4887053,"size":179097604,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fb5b0a66c0a0bbe76ef8a0f73bcddb3a7e0763dd&amp;dn=Jennifer+Lopez+-+Waiting+For+Tonight+%28Hex+Hector+Remix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1241774972,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Waiting for Tonight&quot; is a song originally recorded by American female pop trio 3rd Party for their 1997 album Alive. American singer Jennifer Lopez recorded a version for her debut album, On the 6 (1999), and the song became the third single from the album and also the most famous version of the song so far, being considered one of Lopez's signature tunes. Released in 1999, the single peaked at number eight in the U.S., becoming Lopez's second top ten single; it also peaked at number five in the United Kingdom. The song also known for its remix made by Hex Hector. There is also a Spanish version of the song, called &quot;Una Noche MÃƒÂ¡s&quot; (&quot;One More Night&quot;). In 2006, Italian house trio Lil' Love released their version of the song. There is also a version of the song in the popular dance video game Dance Dance Revolution. In 2000, the song earned Lopez a nomination for the Grammy Award for Best Dance Recording.\n\nThe song was written by Maria Christiansen, Michael Garvin, and Phil Temple. The original version was produced by dance producers LCD. Lopez's version was produced by Ric Wake.\n\n&quot;Waiting for Tonight&quot; was nominated for a Grammy Award in 2000 for Best Dance Recording. In the same year, its music video won the MTV Video Music Award for Best Dance Video and was also nominated for Best Choreography.\n\nLopez would perform it years later during a guest stint on the sitcom Will &amp; Grace, at the behest of characters Will and Karen.\n\nThe song's success could be tied to its theme and the much anticipated millennium new year on December 31, 1999. In the U.S., &quot;Waiting for Tonight&quot; rose from number fifty-six to number thirty-seven the week of October 23, 1999, as &quot;If You Had My Love&quot; was falling from the top forty of the Billboard Hot 100. The single became known for its upbeat music video which was centered around a millennium party for the year 2000. (The music video also humorously portrayed the Y2K bug worries when the tropical skyline blackouts during the millennium party, but immediately lights back up seconds later, as if the event was a prank.) As 1999 drew to a close and hype for the millennium became more prevalent, &quot;Waiting for Tonight&quot; soared up the charts, reaching number four by the week of December 4, and returning to that position two weeks later.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fb5b0a66c0a0bbe76ef8a0f73bcddb3a7e0763dd","amp;dn":"Jennifer+Lopez+-+Waiting+For+Tonight+%28Hex+Hector+Remix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5b0a66c0a0bbe76ef8a0f73bcddb3a7e0763dd","infoHashBuffer":{"type":"Buffer","data":[251,91,10,102,192,160,187,231,110,248,160,247,59,205,219,58,126,7,99,221]},"announce":[],"urlList":[]}}