{"title":"Digitaction Audio Catalog v3.7.0","uid":4346380,"size":2558819,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ffd676d0f6529a1d91a413d0883039e01ced2ac6&amp;dn=Digitaction+Audio+Catalog+v3.7.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"romelanda","files":6,"time":1218897270,"description":"Audio Catalog is the fast Windows application which is created for the work with music collections. Beautiful adjusted interface and good functionality will help you to put in order any collection quickly and easily.\n\nBasic possibilities of the program. The fast and comfortable editor of tags supports mp3, ogg, ape, flac, wav and other files...; The &amp;#039;FileName to Tag&amp;#039; utility on the templates chosen by you will get tags from the names of files. And if you have files with names like &amp;#039;Track 01.mp3&amp;#039;, &amp;#039;Track 02.mp3&amp;#039; and so on, the program can rename these files using the information from tags. Audio Catalog also supports on-line-database CDDB (FreeDB.org). With the help of this function you can get information about names of tracks, the year of issue, genre. The program can also do the search of identical files (duplicates) in your collection and the quick search on the set criterias will find a necessary song in a few seconds.\n\nWhy Audio Catalog?\nAudio Catalog is not just a simple program for cataloguing of music files it is also a combination of useful utilities which will help you during a work with music files. Try the program in work and you will see by yourself how good it is. Audio Catalog got several awards on different download sites over the Internet!\n","torrent":{"xt":"urn:btih:ffd676d0f6529a1d91a413d0883039e01ced2ac6","amp;dn":"Digitaction+Audio+Catalog+v3.7.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffd676d0f6529a1d91a413d0883039e01ced2ac6","infoHashBuffer":{"type":"Buffer","data":[255,214,118,208,246,82,154,29,145,164,19,208,136,48,57,224,28,237,42,198]},"announce":[],"urlList":[]}}